{"symbol": "ADSK", "name": "Autodesk, Inc.", "next_earnings_utc": 1590609600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 867959330.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.79068, "eps_up_revisions": 1, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 17, "total_analysts": 26, "analysts_sell": 0, "analysts_buy": 12, "analysts_outperform": 4, "analysts_hold": 7, "analysts_underperform": 3, "webpage": "autodesk.com", "year_founded": 1982, "street_address": "111 McInnis Parkway", "city": "San Rafael", "state": "CA", "zipcode": "94903", "country": "United States", "phone_number": "415 507 5000", "short_description": "Autodesk, Inc. operates as a software design and services company worldwide.", "long_description": "Autodesk, Inc. operates as a software design and services company worldwide. The company offers AutoCAD, a professional design, drafting, detailing, and visualization software; AutoCAD Civil 3D, a surveying, design, analysis, and documentation solution for civil engineering, including land development, transportation, and environmental projects; AutoCAD LT, a drafting and detailing software; BIM 360, a construction management cloud-based software; computer-aided manufacturing (CAM) software for computer numeric control machining, inspection, and modelling for manufacturing; Fusion 360, a 3D CAD, CAM, and computer-aided engineering tool; and Industry Collections software products for professionals in architecture, engineering and construction, product design and manufacturing, and media and entertainment industries. It also provides Inventor tools for 3D mechanical design, simulation, analysis, tooling, visualization, and documentation; Maya and 3ds Max software products that offer 3D modeling, animation, effects, rendering, and compositing solutions; and PlanGrid, a cloud-based field collaboration software, which provides general contractors, subcontractors, owners, and architects access to construction information in real-time. In addition, the company offers Revit software for building information modeling; Shotgun, a cloud-based software for review and production tracking in the media and entertainment industry; and Vault, a data management software to manage data in one central location, accelerate design processes, and streamline internal/external collaboration. Autodesk, Inc. sells its products and services to customers directly, as well as through distributors and resellers. The company was founded in 1982 and is headquartered in San Rafael, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 42685997920, "total_enterprise": 43386897920, "number_of_employees": 10100, "outstanding_shares": 219183558, "eps": 0.976331, "diluted_eps": 0.96, "earnings_from_cont_operations": 214500000, "gross_profit": 2984400000, "cash": 1843700000, "total_debt": 2544600000, "total_revenue": 3274300000, "cash_from_operations": 1415100000, "net_income": 214500000, "ebitda": 467700000, "year_low_stock_price": 125.38, "year_high_stock_price": 211.58, "stocktwits_watchlist_count": 5244, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ADSK.png"}