{"symbol": "AZO", "name": "AutoZone, Inc.", "next_earnings_utc": 1590490500, "next_earnings_period_start_date_utc": 1575072000, "next_earnings_period_end_date_utc": 1582934400, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2570058690.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 11.74203, "eps_up_revisions": 0, "eps_down_revisions": 16, "revenue_up_revisions": 0, "revenue_down_revisions": 14, "total_analysts": 24, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 5, "analysts_hold": 11, "analysts_underperform": 1, "webpage": "autozone.com", "year_founded": 1979, "street_address": "123 South Front Street", "city": "Memphis", "state": "TN", "zipcode": "38103", "country": "United States", "phone_number": "901-495-6500", "short_description": "AutoZone, Inc. retails and distributes automotive replacement parts and accessories.", "long_description": "AutoZone, Inc. retails and distributes automotive replacement parts and accessories. The company offers various products for cars, sport utility vehicles, vans, and light trucks, including new and remanufactured automotive hard parts, maintenance items, accessories, and non-automotive products. Its products include A/C compressors, batteries and accessories, bearings, belts and hoses, calipers, carburetors, chassis, clutches, CV axles, engines, fuel pumps, fuses, ignition and lighting products, mufflers, radiators, starters and alternators, thermostats, and water pumps. The company also offers maintenance products, such as antifreeze and windshield washer fluids; brake drums, rotors, shoes, and pads; brake and power steering fluids, and oil and fuel additives; oil and transmission fluids; oil, air, fuel, and transmission filters; oxygen sensors; paints and accessories; refrigerants and accessories; shock absorbers and struts; spark plugs and wires; and windshield wipers, as well as air fresheners, cell phone accessories, drinks and snacks, floor mats and seat covers, interior and exterior accessories, mirrors, performance products, protectants and cleaners, sealants and adhesives, steering wheel covers, stereos and radios, tools, and wash and wax products. In addition, it provides a sales program that offers commercial credit and delivery of parts and other products; and towing and tire repair services. Further, it sells automotive diagnostic and repair software under the ALLDATA brand through alldata.com and alldatadiy.com; and automotive hard parts, maintenance items, accessories, and non-automotive products through autozone.com. As of October 16, 2019, it operated 5,772 stores in the United States, the District of Columbia, Puerto Rico, and Saint Thomas; 604 stores in Mexico; and 35 stores in Brazil. AutoZone, Inc. was founded in 1979 and is based in Memphis, Tennessee.", "industry_name": "Specialty Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 25792058362, "total_enterprise": 33968000362, "number_of_employees": 75840, "outstanding_shares": 23352430, "eps": 67.173549, "diluted_eps": 65.5532, "earnings_from_cont_operations": 1620797000, "gross_profit": 6489551000, "cash": 200921000, "total_debt": 8376863000, "total_revenue": 12078141000, "cash_from_operations": 1963088000, "net_income": 1620797000, "ebitda": 2620406000, "year_low_stock_price": 684.91, "year_high_stock_price": 1274.41, "stocktwits_watchlist_count": 3732, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AZO.png"}