{"symbol": "BMO", "name": "Bank of Montreal", "next_earnings_utc": 1590573600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 4305958305.625273, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.7740809861924477, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 2, "revenue_down_revisions": 0, "total_analysts": 14, "analysts_sell": 1, "analysts_buy": 2, "analysts_outperform": 2, "analysts_hold": 8, "analysts_underperform": 1, "webpage": "bmo.com", "year_founded": 1817, "street_address": "129 rue Saint Jacques", "city": "Montreal", "state": "QC", "zipcode": "H2Y 1L6", "country": "Canada", "phone_number": "416-867-7366", "short_description": "Bank of Montreal provides diversified financial services primarily in North America.", "long_description": "Bank of Montreal provides diversified financial services primarily in North America. It operates through three groups: Personal and Commercial Banking, BMO Wealth Management, and BMO Capital Markets. The company's personal banking products and services include checking and savings accounts, credit cards, mortgages, and financial and investment advice services; and commercial banking products and services comprise business deposit accounts, commercial credit cards, business loans and commercial mortgages, cash management solutions, foreign exchange, and specialized banking programs for small business and commercial banking customers. It also offers wealth management products and services, such as investment and wealth advisory services; digital investing services; financial services and solutions to high net worth and ultra-high net worth clients; and investment management, and trust and custody services to institutional, retail, and high net worth investors. In addition, the company provides life insurance, accident and sickness insurance, and annuity products to brokers and individuals; creditor and travel insurance to bank customers; and reinsurance solutions. Further, it offers investment and corporate banking services, including client's debt and equity capital-raising services, as well as loan origination and syndication, balance sheet management, and treasury management; strategic advice on mergers and acquisitions, restructurings, and recapitalizations, as well as valuation and fairness opinions; and trade finance, risk mitigation, and other operating services. Additionally, the company provides research and access to markets for institutional, corporate, and retail clients; new product development and origination services, as well as risk management advice and services to hedge against fluctuations; and funding and liquidity management services to its clients. The company was founded in 1817 and is headquartered in Montreal, Canada.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 30484937748, "total_enterprise": null, "number_of_employees": 45513, "outstanding_shares": 639628587, "eps": 6.63429363676202, "diluted_eps": 6.61114586638862, "earnings_from_cont_operations": 4412409145, "gross_profit": 18608428910, "cash": 208442510238, "total_debt": 120465569609, "total_revenue": 18608428910, "cash_from_operations": 25494507155, "net_income": 4412409145, "ebitda": null, "year_low_stock_price": 38.31, "year_high_stock_price": 79.93, "stocktwits_watchlist_count": 1533, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BMO.png"}