{"symbol": "CIR", "name": "CIRCOR International, Inc.", "next_earnings_utc": 1590749700, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 187009000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.45956, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "circor.com", "year_founded": 1999, "street_address": "30 Corporate Drive", "city": "Burlington", "state": "MA", "zipcode": "01803", "country": "United States", "phone_number": "781 270 1200", "short_description": "CIRCOR International, Inc. designs, manufactures, and markets technology products and sub-systems.", "long_description": "CIRCOR International, Inc. designs, manufactures, and markets technology products and sub-systems. The company operates through Energy, Aerospace & Defense, and Industrial segments. The Energy segment offers engineered integrated flow control solutions, valves, and pipelines products and services for the midstream and downstream oil and gas, and refinery markets. Its products include pipeline pigs, quick opening closure products, pig signalers, delayed coking unheading devices, and fluid catalytic converters and isolation valves. This segment offers its products and services to end-user customers, such as oil companies; engineering, procurement, and construction (EPC) companies; and distributors through direct sales, sales representatives, and agents. The Aerospace & Defense segment manufactures and markets control valves, automatic recirculation valves, regulators, fluid controls, actuation systems, landing gear components, pneumatic controls, electro-mechanical controls, and other flow control products and systems. Its products and services are used in the military and defense, commercial aerospace, business and general aviation, and general industrial markets. This segment serves aircraft manufacturers and tier 1 suppliers to aircraft manufacturers. The Industrial segment provides 3 and 2 screw, progressing cavity, specialty centrifugal, and gear metering pumps; multiphase pump systems; automatic recirculation valves; and severe service and general service control valves for the end-users, OEMs, and EPC companies. The company has operations in Europe, the Middle East, Africa, North America, and internationally. CIRCOR International, Inc. was founded in 1999 and is headquartered in Burlington, Massachusetts.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 262199316, "total_enterprise": 843672316, "number_of_employees": 4000, "outstanding_shares": 19984704, "eps": -6.729387, "diluted_eps": -6.729387, "earnings_from_cont_operations": -24768000, "gross_profit": 307989000, "cash": 84531000, "total_debt": 666004000, "total_revenue": 964313000, "cash_from_operations": 15913000, "net_income": -133935000, "ebitda": 129555000, "year_low_stock_price": 8.0, "year_high_stock_price": 47.8, "stocktwits_watchlist_count": 242, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CIR.png"}