{"symbol": "CRM", "name": "salesforce.com, inc.", "next_earnings_utc": 1590696300, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 4848860910.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.69501, "eps_up_revisions": 16, "eps_down_revisions": 11, "revenue_up_revisions": 18, "revenue_down_revisions": 7, "total_analysts": 43, "analysts_sell": 1, "analysts_buy": 26, "analysts_outperform": 12, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "salesforce.com", "year_founded": 1999, "street_address": "Salesforce Tower", "city": "San Francisco", "state": "CA", "zipcode": "94105", "country": "United States", "phone_number": "415 901 7000", "short_description": "salesforce.com, inc. develops enterprise cloud computing solutions with a focus on customer relationship management worldwide.", "long_description": "salesforce.com, inc. develops enterprise cloud computing solutions with a focus on customer relationship management worldwide. The company offers Sales Cloud to store data, monitor leads and progress, forecast opportunities, and gain insights through analytics and relationship intelligence, as well as deliver quotes, contracts, and invoices. It also provides Service Cloud, which enables companies to deliver personalized customer service and support, as well as a field service solution that enables companies to connect agents, dispatchers, and mobile employees through a centralized platform, which helps to schedule and dispatch work, and track and manage jobs in real-time. In addition, the company offers Marketing Cloud to plan, personalize, and optimize one-to-one customer marketing interactions; and Commerce Cloud, which enables companies to enhance engagement, conversion, revenue, and loyalty from their customers. Further, it provides Customer 360 Platform that offers no-code to pro-code Platform-as-a-Service tools for building, securing, integrating, and managing the business apps; MuleSoft Anypoint Platform enables customers to connect any system, application, data, or device; Quip collaboration platform, which combines documents, spreadsheets, apps, and chat with live CRM data; and Tableau and Einstein Analytics, provides analytical technology to customers. Additionally, the company offers various solutions for financial services, healthcare and life sciences, manufacturing, consumer goods, government, and philanthropy. The company also provides professional services and education services, including instructor-led and online courses; and support and adoption programs. It provides its services through direct sales; and consulting firms, systems integrators, and other partners. The company was founded in 1999 and is headquartered in San Francisco, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 157630896820, "total_enterprise": 155936896820, "number_of_employees": 49000, "outstanding_shares": 899411713, "eps": 0.15199, "diluted_eps": 0.15, "earnings_from_cont_operations": 126000000, "gross_profit": 12863000000, "cash": 7947000000, "total_debt": 6253000000, "total_revenue": 17098000000, "cash_from_operations": 4331000000, "net_income": 126000000, "ebitda": 2278000000, "year_low_stock_price": 115.29, "year_high_stock_price": 195.72, "stocktwits_watchlist_count": 28828, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CRM.png"}