{"symbol": "DELL", "name": "Dell Technologies Inc.", "next_earnings_utc": 1590697500, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 20043809290.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.9625, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 18, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 3, "analysts_hold": 9, "analysts_underperform": 0, "webpage": "delltechnologies.com", "year_founded": 1984, "street_address": "One Dell Way", "city": "Round Rock", "state": "TX", "zipcode": "78682", "country": "United States", "phone_number": "800-289-3355", "short_description": "Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports information technology (IT) products and services worldwide.", "long_description": "Dell Technologies Inc. designs, develops, manufactures, markets, sells, and supports information technology (IT) products and services worldwide. It operates through three segments: Infrastructure Solutions Group (ISG), Client Solutions Group (CSG), and VMware. The ISG segment provides traditional and next-generation storage solutions; and rack, blade, tower, and hyperscale servers. It also offers networking products and services that help its business customers to transform and modernize their infrastructure, mobilize and enrich end-user experiences, and accelerate business applications and processes; and attached software, and peripherals, as well as support and deployment, configuration, and extended warranty services. The CSG segment offers desktops, notebooks, and workstations; displays and projectors; third-party software and peripherals; and support and deployment, configuration, and extended warranty services. The VMware segment offers compute, cloud management, and networking, as well as security storage, availability, and other end-user computing offerings that provides a flexible digital foundation to enable the digital transformation. The company also offers cloud-native platform that makes software development and IT operations a strategic advantage for customers; information security and cybersecurity solutions; cloud software and infrastructure-as-a-service solutions that enable customers to migrate, run, and manage mission-critical applications in cloud-based IT environments; cloud-based integration services; and financial services. It has a collaboration with Microsoft to deliver a joint Internet of Things (IoT) solution, as well as a partnership with ipoque GmbH. The company was formerly known as Denali Holding Inc. and changed its name to Dell Technologies Inc. in August 2016. Dell Technologies Inc. was founded in 1984 and is headquartered in Round Rock, Texas.", "industry_name": "Technology Hardware, Storage and Peripherals", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 32841594991, "total_enterprise": 82116594991, "number_of_employees": 165000, "outstanding_shares": 739842194, "eps": 6.37569, "diluted_eps": 6.03462, "earnings_from_cont_operations": 5529000000, "gross_profit": 28928000000, "cash": 9302000000, "total_debt": 53848000000, "total_revenue": 92154000000, "cash_from_operations": 9291000000, "net_income": 4616000000, "ebitda": 8991000000, "year_low_stock_price": 25.51, "year_high_stock_price": 70.39, "stocktwits_watchlist_count": 3371, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DELL.png"}