{"symbol": "DOCU", "name": "DocuSign, Inc.", "next_earnings_utc": 1591301100, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 281121070.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.103, "eps_up_revisions": 8, "eps_down_revisions": 1, "revenue_up_revisions": 8, "revenue_down_revisions": 2, "total_analysts": 15, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 3, "analysts_hold": 5, "analysts_underperform": 1, "webpage": "docusign.com", "year_founded": 2003, "street_address": "221 Main Street", "city": "San Francisco", "state": "CA", "zipcode": "94105", "country": "United States", "phone_number": "415 489 4940", "short_description": "DocuSign, Inc. provides cloud based software in the United States and internationally.", "long_description": "DocuSign, Inc. provides cloud based software in the United States and internationally. The company provides e-signature solution that enables businesses to digitally prepare, execute, and act on agreements. It also offers DocuSign CLM, which automates workflows across the entire agreement process; Intelligent Insights that use artificial intelligence to search and analyze agreements by legal concepts and clauses; Gen for Salesforce, which allows sales representatives to automatically generate agreements with a few clicks from within Salesforce; and Negotiate for Salesforce that supports for approvals, document comparisons, and version control. In addition, the company provides Guided Forms, which enable complex forms to be filled via an interactive and step-by-step process; Click that supports no-signature-required agreements for standard terms and consents; Identify, a signer-identification option for checking government-issued IDs; Standards-Based Signatures, which support signatures that involve digital certificates; Payments that enables customers to collect signatures and payment; and eNotary, which offers the ability to execute electronic notarial acts. Further, it offers industry-specific cloud offerings, including Rooms for Real Estate that provides a way for brokers and agents to manage the entire real estate transaction digitally; Rooms for Mortgage, which offers digital workspace to create and close mortgages; FedRAMP, an authorized version of DocuSign eSignature for U.S. federal government agencies; and life sciences modules that support compliance with the electronic signature practices. The company sells its products through direct, partner-assisted, and Web-based sales. It serves enterprise, commercial, and small businesses, such as professionals, sole proprietorships, and individuals. The company was founded in 2003 and is headquartered in San Francisco, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 23403684403, "total_enterprise": 23396023403, "number_of_employees": 3909, "outstanding_shares": 183127421, "eps": -1.179141, "diluted_eps": -1.179141, "earnings_from_cont_operations": -208359000, "gross_profit": 733314000, "cash": 656142000, "total_debt": 648481000, "total_revenue": 973971000, "cash_from_operations": 115696000, "net_income": -208359000, "ebitda": -147427000, "year_low_stock_price": 43.13, "year_high_stock_price": 136.29, "stocktwits_watchlist_count": 9854, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DOCU.png"}