{"symbol": "ERJ", "name": "Embraer S.A.", "next_earnings_utc": 1590573600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 745872790.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.53556, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 1, "revenue_down_revisions": 1, "total_analysts": 10, "analysts_sell": 1, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 6, "analysts_underperform": 1, "webpage": "embraer.com", "year_founded": 1969, "street_address": "São Paulo Corporate Towers", "city": "São Paulo", "state": "SP", "zipcode": "04543-907", "country": "Brazil", "phone_number": "55 11 3040 9518", "short_description": "Embraer S.A. designs, develops, manufactures, and sells aircraft and systems in Brazil, North America, Latin America, the Asia Pacific, Europe, and internationally.", "long_description": "Embraer S.A. designs, develops, manufactures, and sells aircraft and systems in Brazil, North America, Latin America, the Asia Pacific, Europe, and internationally. It operates through Commercial Aviation, Defense and Security, Executive Jets, Service & Support, and Other segments. The Commercial Aviation segment develops, produces, and sells commercial jets; and provides support services, as well as leases aircraft. Its products include ERJ 145 family, EMBRAER 170/190 family, and E-Jets family of commercial aircraft. The Defense and Security segment engages in the research, development, production, modification, and support for military defense and security aircraft, as well as offers a range of products and integrated solutions that include radars, special space systems (satellites), and information and communications systems, such as command, control, communications, computer, intelligence, surveillance, and reconnaissance systems. The Executive Jets segment develops, produces, and sells executive jets; and offers support services. It also leases Legacy 600 and Legacy 650 executive jets in the super midsize and large categories; Legacy 450 and Legacy 500 executive jets in the midlight and midsize categories; Phenom family executive jets in the entry jet and light jet categories; Lineage 1000, an ultra-large executive jet; and Praetor 500 and Praetor 600, disruptive executive jets in the midsize and super midsize categories. The Service & Support segment after-service solutions and support services. The Other segment is involved in the supply of fuel systems, structural parts, and mechanical and hydraulic systems; and production of agricultural crop-spraying aircraft. The company has a strategic partnership with The Boeing Company. The company was formerly known as Embraer-Empresa Brasileira de Aeronautica S.A. and changed its name to Embraer S.A. in November 2010. Embraer S.A. was founded in 1969 and is headquartered in Sao Paulo, Brazil.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 869250601, "total_enterprise": 131817442, "number_of_employees": 18734, "outstanding_shares": 736079826, "eps": -0.445213464696223, "diluted_eps": -0.445213464696223, "earnings_from_cont_operations": -210891924, "gross_profit": 355924019, "cash": 1268549037, "total_debt": 147548639, "total_revenue": 2604351645, "cash_from_operations": 932824302, "net_income": -327610340, "ebitda": 22085635, "year_low_stock_price": 3.99, "year_high_stock_price": 20.92, "stocktwits_watchlist_count": 1157, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ERJ.png"}