{"symbol": "MOD", "name": "Modine Manufacturing Company", "next_earnings_utc": 1590697800, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 456100000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.09, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "modine.com", "year_founded": 1916, "street_address": "1500 DeKoven Avenue", "city": "Racine", "state": "WI", "zipcode": "53403", "country": "United States", "phone_number": "262-636-1200", "short_description": "Modine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on- and off-highway original equipment manufacturer (OEM) vehicular applications.", "long_description": "Modine Manufacturing Company provides engineered heat transfer systems and heat transfer components for use in on- and off-highway original equipment manufacturer (OEM) vehicular applications. It operates through Vehicular Thermal Solutions, Commercial and Industrial Solutions, and Building HVAC Systems segments. The company offers powertrain cooling products, including engine cooling assemblies, radiators, condensers, and charge air coolers; auxiliary cooling products, such as power steering and transmission oil coolers; component assemblies; radiators for special applications; on-engine cooling products comprising exhaust gas recirculation, engine oil, fuel, charge air, and intake air coolers; and chillers and cooling plates for battery thermal management. It also provides heat-exchanger and microchannel Coils; unit, fluid, transformer oil, and brine coolers, as well as remote condensers; and coatings to protect against corrosion. In addition, the company offers gas-fired, hydronic, electric, and oil-fired unit heaters; indoor and outdoor duct furnaces; infrared units; hydronic products, such as commercial fin-tube radiation, cabinet unit heaters, and convectors; roof-mounted direct- and indirect-fired makeup air units; commercial packaged rooftop ventilation units; unit ventilators; single packaged vertical units; precision air conditioning units for data center applications; air-handling units; chillers; ceiling cassettes; hybrid fan coils; and condensing units. It serves automobile, truck, bus, and specialty vehicle OEMs; agricultural, industrial, and construction equipment OEMs; commercial and industrial equipment OEMs; heating, ventilation, and cooling OEMs; construction architects and contractors; and wholesalers of heating equipment. The company has operations in North America, South America, Europe, the Asia/Pacific, the Middle East, and Africa. Modine Manufacturing Company was founded in 1916 and is headquartered in Racine, Wisconsin.", "industry_name": "Auto Components", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 206787424, "total_enterprise": 687987424, "number_of_employees": 12200, "outstanding_shares": 50807721, "eps": 0.210629, "diluted_eps": 0.210629, "earnings_from_cont_operations": 10800000, "gross_profit": 324200000, "cash": 36200000, "total_debt": 511700000, "total_revenue": 2059300000, "cash_from_operations": 81800000, "net_income": 10800000, "ebitda": 139700000, "year_low_stock_price": 2.84, "year_high_stock_price": 14.96, "stocktwits_watchlist_count": 290, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MOD.png"}