{"symbol": "OOMA", "name": "Ooma, Inc.", "next_earnings_utc": 1590524100, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 39818600.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.025, "eps_up_revisions": 4, "eps_down_revisions": 0, "revenue_up_revisions": 1, "revenue_down_revisions": 2, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "ooma.com", "year_founded": 2003, "street_address": "525 Almanor Avenue", "city": "Sunnyvale", "state": "CA", "zipcode": "94085", "country": "United States", "phone_number": "650 566 6600", "short_description": "Ooma, Inc. creates connected experiences for businesses and consumers in the United States, Canada, and internationally.", "long_description": "Ooma, Inc. creates connected experiences for businesses and consumers in the United States, Canada, and internationally. The company's smart cloud-based software-as-a-service and unified-communications-as-a-service (UCaaS) platforms serve as a communications hub, which offers cloud-based communications solutions, smart security, and other connected services. Its business and residential solutions deliver PureVoice high-definition voice quality, advanced functionality, and integration with mobile devices; and platform helps to create smart workplace and homes by offering communications, monitoring, security, automation, productivity, and networking infrastructure applications. The company's products and services include Ooma Office, a multi-user communications system for small and medium-sized businesses; Ooma Office Mobile HD app to make, receive, and transfer phone calls; Ooma Office Pro that offers services, including call recording, enhanced call blocking, voicemail transcription, and support for overhead paging systems for businesses; and Ooma Enterprise, an UCaaS offering. It also provides Ooma Telo, a home communications solution designed to serve as the primary phone line in the home; Ooma Telo 4G. a solution that provides home phone and internet service; Ooma Telo Air, a solution that connects to the Internet wirelessly using the home's Wi-Fi network and can be paired with mobile phones to answer incoming mobile calls from any phone in the home; and Ooma HD3 cordless handset. In addition, the company offers Ooma Premier Service, a suite of advanced calling features to enhance the capabilities of Ooma Telo; and Ooma Mobile HD app that allows users to make and receive phone calls and access Ooma features and settings with iOS or Android device over a Wi-Fi or cellular data connection. Further, it provides Ooma Smart Security, a security and monitoring platform; and Talkatone mobile app. The company offers its products through direct sales, distributors, retailers, and resellers, as well as online. Ooma, Inc. was incorporated in 2003 and is headquartered in Sunnyvale, California.", "industry_name": "Diversified Telecommunication Services", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 258190604, "total_enterprise": 240539604, "number_of_employees": 848, "outstanding_shares": 22067573, "eps": -0.893115, "diluted_eps": -0.893115, "earnings_from_cont_operations": -18801000, "gross_profit": 91663000, "cash": 26064000, "total_debt": 8413000, "total_revenue": 151593000, "cash_from_operations": -7564000, "net_income": -18801000, "ebitda": -12751000, "year_low_stock_price": 7.45, "year_high_stock_price": 15.84, "stocktwits_watchlist_count": 326, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/OOMA.png"}