{"symbol": "QADA", "name": "QAD Inc.", "next_earnings_utc": 1590610500, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 72704670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.07, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "qad.com", "year_founded": 1979, "street_address": "100 Innovation Place", "city": "Santa Barbara", "state": "CA", "zipcode": "93108", "country": "United States", "phone_number": "805-566-6000", "short_description": "QAD Inc. provides enterprise software solutions for manufacturing companies in the automotive, life sciences, consumer products, food and beverage, high technology, and industrial products industries worldwide.", "long_description": "QAD Inc. provides enterprise software solutions for manufacturing companies in the automotive, life sciences, consumer products, food and beverage, high technology, and industrial products industries worldwide. The company offers QAD Cloud ERP and QAD Enterprise Applications, an integrated suite of software applications, which support the core business processes. Its QAD Enterprise Applications include software solutions, such as QAD Financials to manage and control finance and accounting processes; QAD Customer Management for manufacturers to acquire new customers; QAD Manufacturing, which supports manufacturing business processes; QAD Automation Solutions that improve manufacturers’ material transaction processing; QAD Demand and Supply Chain Planning that fulfills materials planning and logistics requirements; QAD Supply Chain Execution that offers tools to support inventory and warehouse management; and QAD Transportation Management to manage and optimize outside carriers for shipments. The company’s QAD Enterprise Applications also comprise QAD Service and Support that handles service calls, manages service queues, and organizes mobile field resources; QAD Enterprise Asset Management to manage, maintain, and install capital equipment; Action Centers with Embedded Analytics; and QAD Analytics that provides data to measure performance. It also offers QAD Enterprise Quality Management that provides quality management and regulatory compliance solutions; QAD Interoperability, which integrates QAD Enterprise Applications with other non-QAD core business applications; and QAD Internationalization, which supports companies that manufacture and distribute their products worldwide. In addition, it provides customer support, product updates, maintenance, and professional services. The company markets its products through direct and indirect sales channels; and distributors and sales agents. QAD Inc. was founded in 1979 and is headquartered in Santa Barbara, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 809213668, "total_enterprise": 704555668, "number_of_employees": 1920, "outstanding_shares": 20433901, "eps": -0.797529, "diluted_eps": -0.797529, "earnings_from_cont_operations": -15949000, "gross_profit": 170863000, "cash": 136717000, "total_debt": 32059000, "total_revenue": 310772000, "cash_from_operations": 16997000, "net_income": -15949000, "ebitda": -176000, "year_low_stock_price": 28.21, "year_high_stock_price": 54.54, "stocktwits_watchlist_count": 121, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/QADA.png"}