{"symbol": "SMTC", "name": "Semtech Corporation", "next_earnings_utc": 1590610500, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 129183770.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.31931, "eps_up_revisions": 0, "eps_down_revisions": 12, "revenue_up_revisions": 0, "revenue_down_revisions": 13, "total_analysts": 15, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 3, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "semtech.com", "year_founded": 1960, "street_address": "200 Flynn Road", "city": "Camarillo", "state": "CA", "zipcode": "93012-8790", "country": "United States", "phone_number": "805 498 2111", "short_description": "Semtech Corporation designs, develops, manufactures, and markets analog and mixed-signal semiconductor products and advanced algorithms.", "long_description": "Semtech Corporation designs, develops, manufactures, and markets analog and mixed-signal semiconductor products and advanced algorithms. The company provides signal integrity products, including a portfolio of optical data communications and video transport products used in various enterprise computing, communications, and industrial applications; a portfolio of integrated circuits for data centers, enterprise networks, passive optical networks, wireless base station optical transceivers, and high-speed interface applications; and video products for broadcast applications, as well as video-over-IP technology for professional audio video applications. It also offers protection products, such as filter and termination devices that are integrated with the transient voltage suppressor devices, which protect electronic systems from voltage spikes; and wireless and sensing products comprising a portfolio of specialized radio frequency products used in various industrial, medical, and communications applications, as well as specialized sensing products used in industrial and consumer applications. In addition, the company provides power products consisting of switching voltage regulators, combination switching and linear regulators, smart regulators, isolated switches, and wireless charging that control, alter, regulate, and condition the power within electronic systems. It serves original equipment manufacturers and their suppliers in the enterprise computing, communications, and consumer and industrial end-markets. The company sells its products directly, as well as through independent sales representative firms and independent distributors in the United States, Europe, and Asia. Semtech Corporation was founded in 1960 and is headquartered in Camarillo, California.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 3035152598, "total_enterprise": 2937575598, "number_of_employees": 1388, "outstanding_shares": 65132030, "eps": 0.480977, "diluted_eps": 0.47, "earnings_from_cont_operations": 31866000, "gross_profit": 336684000, "cash": 304024000, "total_debt": 206201000, "total_revenue": 547512000, "cash_from_operations": 118616000, "net_income": 31871000, "ebitda": 90411000, "year_low_stock_price": 26.03, "year_high_stock_price": 55.3, "stocktwits_watchlist_count": 493, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SMTC.png"}