{"symbol": "TD", "name": "The Toronto-Dominion Bank", "next_earnings_utc": 1590661800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7080400708.14802, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.6192304667109996, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 14, "analysts_sell": 1, "analysts_buy": 1, "analysts_outperform": 5, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "td.com", "year_founded": 1855, "street_address": "Toronto-Dominion Centre", "city": "Toronto", "state": "ON", "zipcode": "M5K 1A2", "country": "Canada", "phone_number": "416-308-6963", "short_description": "The Toronto-Dominion Bank, together with its subsidiaries, provides various personal and commercial banking products and services in Canada and the United States.", "long_description": "The Toronto-Dominion Bank, together with its subsidiaries, provides various personal and commercial banking products and services in Canada and the United States. The company operates through three segments: Canadian Retail, U.S. Retail, and Wholesale Banking. It offers personal deposits, such as checking, savings, and investment products; financing, investment, cash management, international trade, and day-to-day banking services to businesses; financing options to customers at point of sale for automotive and recreational vehicle purchases through auto dealer network; credit cards; investing, advice-based, and asset management services to retail and institutional clients; and property and casualty insurance, as well as life and health insurance products. The company also provides capital markets, and corporate and investment banking services, including underwriting and distribution of new debt and equity issues; providing advice on strategic acquisitions and divestitures; and trading, funding, and investment services to companies, governments, and institutions, as well as automated teller machines, telephone, Internet, and mobile banking services. It offers its products and services under the TD Bank, America's Most Convenient Bank, and TD Ameritrade brand names. The company offers personal and business banking products and services through a network of 1,091 branches and 3,509 automated teller machines in Canada; and through a network of 1,241 stores. The Toronto-Dominion Bank was founded in 1855 and is headquartered in Toronto, Canada.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 73494531289, "total_enterprise": null, "number_of_employees": 85000, "outstanding_shares": 1802445300, "eps": 4.98783565287033, "diluted_eps": 4.98067757680161, "earnings_from_cont_operations": 9266814754, "gross_profit": 29147589042, "cash": 310219562688, "total_debt": 206530969974, "total_revenue": 29147589042, "cash_from_operations": 10762802786, "net_income": 9266814754, "ebitda": null, "year_low_stock_price": 33.74, "year_high_stock_price": 59.55, "stocktwits_watchlist_count": 3686, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TD.png"}