{"symbol": "TGI", "name": "Triumph Group, Inc.", "next_earnings_utc": 1590660000, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 660099810.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.59423, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 12, "analysts_sell": 1, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 8, "analysts_underperform": 2, "webpage": "triumphgroup.com", "year_founded": 1993, "street_address": "899 Cassatt Road", "city": "Berwyn", "state": "PA", "zipcode": "19312", "country": "United States", "phone_number": "610 251 1000", "short_description": "Triumph Group, Inc. designs, engineers, manufactures, repairs, overhauls, and distributes aerostructures, aircraft components, accessories, subassemblies, and systems worldwide.", "long_description": "Triumph Group, Inc. designs, engineers, manufactures, repairs, overhauls, and distributes aerostructures, aircraft components, accessories, subassemblies, and systems worldwide. The company offers aircraft and engine-mounted accessory drives, thermal control systems and components, cargo hooks, high lift actuations, cockpit control levers, hydraulic systems and components, control system valve bodies, landing gear actuation systems, electronic engine controls, landing gear components and assemblies, exhaust nozzles and ducting, main engine gear box assemblies, geared transmissions and drive train components, main fuel pumps, fuel-metering units, secondary flight control systems, and vibration absorbers. It also provides aircraft wings, flight control surfaces, composite and metal bonding products, helicopter cabins, engine nacelles, integrated testing and certification services, comprehensive processing services, stretch-formed leading edges and fuselage skins, empennages, wing spars and stringers, acoustic and thermal insulation systems, and composite ducts and floor panels. In addition, the company offers air cycle machines, blades and vanes, APUs, constant speed drives, combustors, engine and airframe accessories, stators, flight control surfaces, transition ducts, integrated drive generators, sidewalls, nacelles, light assemblies, remote sensors, overhead bins, thrust reversers, and fuel bladder cells, as well as cabin panes, shades, light lenses, and other components. It serves original equipment manufacturers of commercial, regional, and military aircraft; and aircraft components, as well as business jet and regional airlines, and air cargo carriers. Triumph Group, Inc. has strategic alliance with Air France-KLM. The company was founded in 1993 and is headquartered in Berwyn, Pennsylvania.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 292947872, "total_enterprise": 1720221872, "number_of_employees": 10776, "outstanding_shares": 51849181, "eps": -3.050847, "diluted_eps": -3.050847, "earnings_from_cont_operations": -152669000, "gross_profit": 581484000, "cash": 53594000, "total_debt": 1480868000, "total_revenue": 3076034000, "cash_from_operations": 57984000, "net_income": -152669000, "ebitda": 296382000, "year_low_stock_price": 3.02, "year_high_stock_price": 29.38, "stocktwits_watchlist_count": 707, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TGI.png"}