{"symbol": "UHAL", "name": "AMERCO", "next_earnings_utc": 1590610200, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 744000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -2.93, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 0, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "amerco.com", "year_founded": 1945, "street_address": "5555 Kietzke Lane", "city": "Reno", "state": "NV", "zipcode": "89511", "country": "United States", "phone_number": "775-688-6300", "short_description": "AMERCO operates as a do-it-yourself moving and storage operator for household and commercial goods in the United States and Canada.", "long_description": "AMERCO operates as a do-it-yourself moving and storage operator for household and commercial goods in the United States and Canada. The company’s Moving and Storage segment rents trucks, trailers, portable moving and storage units, specialty rental items, and self-storage spaces primarily to the household movers; and sells moving supplies, towing accessories, and propane. It also provides uhaul.com, an online marketplace that connects consumers to independent Moving Help service providers and independent self-storage affiliates; auto transport and tow dolly options to transport vehicles; and specialty boxes for dishes, computers, and sensitive electronic equipment, as well as tapes, security locks, and packing supplies. This segment rents its products and services through a network of approximately 1,981 company operated retail moving stores and 20,000 independent U-Haul dealers. As of March 31, 2019, it had a rental fleet of approximately 167,000 trucks, 120,000 trailers, and 43,000 towing devices; and 1,631 self-storage locations with approximately 697,000 rentable storage units. The company’s Property and Casualty Insurance segment offers loss adjusting and claims handling services. It also provides moving and storage protection packages, such as Safemove and Safetow packages, which offer moving and towing customers with a damage waiver, cargo protection, and medical and life insurance coverage; Safestor that protects storage customers from loss on their goods in storage; Safestor Mobile, which protects customers stored belongings; and Safemove Plus, which provides rental customers with a layer of primary liability protection. The company’s Life Insurance segment provides life and health insurance products primarily to the senior market through the direct writing and reinsuring of life insurance, medicare supplement, and annuity policies. AMERCO was founded in 1945 and is based in Reno, Nevada.", "industry_name": "Road and Rail", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5937630362, "total_enterprise": 9811287362, "number_of_employees": 21900, "outstanding_shares": 19607788, "eps": 16.346106, "diluted_eps": 16.346106, "earnings_from_cont_operations": 320511000, "gross_profit": 1178787000, "cash": 631951000, "total_debt": 4657605000, "total_revenue": 3882875000, "cash_from_operations": 1049869000, "net_income": 320511000, "ebitda": 1194180000, "year_low_stock_price": 222.34, "year_high_stock_price": 426.5, "stocktwits_watchlist_count": 367, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UHAL.png"}