{"symbol": "VMW", "name": "VMware, Inc.", "next_earnings_utc": 1590696900, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2614992730.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.17706, "eps_up_revisions": 1, "eps_down_revisions": 17, "revenue_up_revisions": 10, "revenue_down_revisions": 4, "total_analysts": 31, "analysts_sell": 1, "analysts_buy": 12, "analysts_outperform": 7, "analysts_hold": 10, "analysts_underperform": 1, "webpage": "vmware.com", "year_founded": 1998, "street_address": "3401 Hillview Avenue", "city": "Palo Alto", "state": "CA", "zipcode": "94304", "country": "United States", "phone_number": "650 427 5000", "short_description": "VMware, Inc. provides software in the areas of hybrid cloud, multi-cloud, modern applications, networking and security, and digital workspaces in the United States and internationally.", "long_description": "VMware, Inc. provides software in the areas of hybrid cloud, multi-cloud, modern applications, networking and security, and digital workspaces in the United States and internationally. It offers compute products, including VMware vSphere, a data center platform, which enables users to deploy hypervisor, a layer of software that resides between the operating system and system hardware to enable compute virtualization; and cloud management products for businesses with automated operation, programmable provisioning, and application monitoring solutions. It also provides networking and security products and services that enable customers to connect and operate their network consistently within and across the data center, cloud, and network edges; and storage and availability products, including data storage and protection options. In addition, it offers VMware Cloud Foundation, a platform that combines its compute, storage, and networking technologies with cloud management into an integrated stack and delivers enterprise-ready cloud infrastructure for private and public clouds. Further, it provides hybrid cloud computing solutions, such as VMware Cloud Provider Program, VMware Cloud Foundation, and VMware Cloud Services; end-user computing solutions, such as Workspace ONE that delivers and manages any application on any device by integrating access control, application management, and multi-platform endpoint management; pivotal cloud foundry, pivotal labs, and heptio, as well as pivotal application and pivotal container services; and VMware Carbon Black Cloud platform, AppDefense, and VMware Workspace ONE platform. The company sells its products through distributors, resellers, system vendors, and systems integrators. VMware, Inc. has strategic alliances with Amazon Web Services to build and deliver an integrated hybrid solution. The company was incorporated in 1998 and is headquartered in Palo Alto, California. VMware, Inc. is a subsidiary of Dell Technologies Inc.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 57083360796, "total_enterprise": 60830360796, "number_of_employees": 29450, "outstanding_shares": 418009379, "eps": 15.37436, "diluted_eps": 15.08, "earnings_from_cont_operations": 6356000000, "gross_profit": 9012000000, "cash": 2915000000, "total_debt": 6662000000, "total_revenue": 10811000000, "cash_from_operations": 3872000000, "net_income": 6412000000, "ebitda": 2039000000, "year_low_stock_price": 86.0, "year_high_stock_price": 205.44, "stocktwits_watchlist_count": 7716, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VMW.png"}