{"symbol": "WPRT", "name": "Westport Fuel Systems Inc.", "next_earnings_utc": 1591302600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 61447600.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.0525, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "wfsinc.com", "year_founded": 1995, "street_address": "1750 West 75th Avenue", "city": "Vancouver", "state": "BC", "zipcode": "V6P 6G2", "country": "Canada", "phone_number": "604 718 2000", "short_description": "Westport Fuel Systems Inc. engineers, manufactures, and supplies alternative fuel systems and components for use in transportation applications worldwide.", "long_description": "Westport Fuel Systems Inc. engineers, manufactures, and supplies alternative fuel systems and components for use in transportation applications worldwide. It operates through Transportation and Cummins Westport Inc. (CWI) Joint Venture segments. The company offers alternative fuel systems and components, which include a range of alternative fuels, such as liquefied petroleum gas, compressed natural gas, liquefied natural gas, renewable natural gas, and hydrogen; and independent aftermarket, original equipment manufacturers (OEMs) and delayed OEMs, electronics, current and advanced research and development programs, supply chain, and product planning activities. It also provides Westport High Pressure Direct Injection 2.0, a fully integrated system that powers compression ignition engines by natural gas, which reduces greenhouse gas emissions. In addition, the company develops, sells, and markets spark-ignited natural gas or propane engines; and CWI engines for transit, school and shuttle buses, conventional trucks and tractors, refuse collection trucks, and specialty vehicles, such as short-haul port drayage trucks and street sweepers. Its products and services are used for passenger cars; light-, medium-, and heavy-duty trucks; and horsepower, cryogenics, and hydrogen applications. Westport Fuel Systems Inc. markets its products primarily under the Cummins Westport, BRC, Westport, OMVL, Prins, GFi Control systems, Emer, Zavoli, TA Gas Technology, Valtek, and AFS brands. The company was formerly known as Westport Innovations Inc. and changed its name to Westport Fuel Systems Inc. in June 2016. Westport Fuel Systems Inc. was founded in 1995 and is headquartered in Vancouver, Canada.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 189314245, "total_enterprise": 210677218, "number_of_employees": 1294, "outstanding_shares": 136424206, "eps": 0.000305, "diluted_eps": 0.000305, "earnings_from_cont_operations": 188000, "gross_profit": 68252000, "cash": 43733000, "total_debt": 66403000, "total_revenue": 305338000, "cash_from_operations": -15832000, "net_income": 41000, "ebitda": -6077000, "year_low_stock_price": 0.7, "year_high_stock_price": 3.39, "stocktwits_watchlist_count": 3232, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WPRT.png"}