{"symbol": "ABMC", "name": "American Bio Medica", "next_earnings_utc": 1591624800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "abmc.com", "year_founded": 1986, "street_address": "122 Smith Road", "city": "Kinderhook", "state": "NY", "zipcode": "12106", "country": "United States", "phone_number": "518-758-8158", "short_description": "American Bio Medica Corporation develops, manufactures, and sells lateral flow immunoassay tests primarily for the immediate detection of drugs in urine and oral fluids.", "long_description": "American Bio Medica Corporation develops, manufactures, and sells lateral flow immunoassay tests primarily for the immediate detection of drugs in urine and oral fluids. Its drugs detection products in urine include Rapid Drug Screen, a rapid drug test, which detects the presence or absence of 2 to 10 drugs; Rapid ONE product line that consists of single drug tests, each of which tests for the presence or absence of a single drug; Rapid Reader, a portable device that interprets the results of drug screen; RDS InCup, a drug-testing cup that detects the presence or absence of 1 to 12 drugs; Rapid TOX, a drug test in a cassette platform, which detects the presence or absence of 1 to 10 drugs; Rapid TOX Cup II, a drug testing cup that detects the presence or absence of 1 to 14 drugs; and Rapid TOX Cup II (2G) which consists of a smaller cup with smaller test strip, as well as private labeled versions of Rapid TOX. The company also offers OralStat, a drug test for the detection of drugs in oral fluids, as well as private labeled versions of OralStat. In addition, the company distributes other products for the detection of substances of abuse; and products that detect the presence or absence of alcohol, and alternative sample options for drug testing, as well as toxicology management services. Further, it provides bulk test strip contract manufacturing services to non-affiliated diagnostic companies. American Bio Medica Corporation serves rehabilitation/drug treatment, pain management, other clinical, government, and employment/workplace markets in the United States and internationally. The company was formerly known as American Micro Media, Inc. and changed its name to American Bio Medica Corporation in September 1992. American Bio Medica Corporation was founded in 1986 and is based in Kinderhook, New York.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 9230626, "total_enterprise": 10748626, "number_of_employees": 42, "outstanding_shares": 35847093, "eps": -0.026678, "diluted_eps": -0.026678, "earnings_from_cont_operations": -853000, "gross_profit": 1085000, "cash": 15000, "total_debt": 1533000, "total_revenue": 3659000, "cash_from_operations": -54000, "net_income": -853000, "ebitda": -678000, "year_low_stock_price": 0.055, "year_high_stock_price": 0.44, "seekingalpha_follower_count": 242, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ABMC.png"}