{"symbol": "ABT", "name": "Abbott Laboratories", "next_earnings_utc": 1594899000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 6788606130.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.43657, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 15, "total_analysts": 22, "analysts_sell": 0, "analysts_buy": 11, "analysts_outperform": 5, "analysts_hold": 5, "analysts_underperform": 1, "webpage": "abbott.com", "year_founded": 1888, "street_address": "100 Abbott Park Road", "city": "Abbott Park", "state": "IL", "zipcode": "60064", "country": "United States", "phone_number": "224 667 6100", "short_description": "Abbott Laboratories discovers, develops, manufactures, and sells health care products worldwide.", "long_description": "Abbott Laboratories discovers, develops, manufactures, and sells health care products worldwide. Its Established Pharmaceutical Products segment offers branded generic pharmaceuticals for the treatment of pancreatic exocrine insufficiency; irritable bowel syndrome or biliary spasm; intrahepatic cholestasis or depressive symptom; gynecological disorder; hormone replacement therapy; dyslipidemia; hypertension; hypothyroidism; Meniere's disease and vestibular vertigo; pain, fever, and inflammation; migraine; and anti-infective clarithromycin, as well as provides influenza vaccines and products that regulate physiological rhythm of the colon. The company's Diagnostic Products segment offers core laboratory systems in the areas of immunoassay, clinical chemistry, hematology, and transfusion; molecular diagnostics systems that automates the extraction, purification, and preparation of DNA and RNA from patient samples, as well as detects and measures infectious agents; cartridges for blood analysis; rapid diagnostics systems for infectious diseases; molecular point-of-care testing for HIV, influenza A and B, RSV, and strep A; cardiometabolic test systems; drug and alcohol test systems, as well as remote patient monitoring and consumer self-test systems; and informatics and automation solutions for use in laboratories. Its Nutritional Products segment provides pediatric and adult nutritional products. The company's Medical Devices segment offers rhythm management, electrophysiology, heart failure, vascular, and structural heart devices for the treatment of cardiovascular diseases, as well as neuromodulation devices for the management of chronic pain and movement disorders. This segment also provides glucose and blood glucose monitoring systems, including test strips, sensors, data management decision software, and accessories for people with diabetes. The company was founded in 1888 and is headquartered in Abbott Park, Illinois.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 167898798343, "total_enterprise": 182711798343, "number_of_employees": 107000, "outstanding_shares": 1768845326, "eps": 2.011409, "diluted_eps": 1.990983, "earnings_from_cont_operations": 3559000000, "gross_profit": 18782000000, "cash": 3668000000, "total_debt": 18272000000, "total_revenue": 32095000000, "cash_from_operations": 6139000000, "net_income": 3579000000, "ebitda": 8026000000, "year_low_stock_price": 61.61, "year_high_stock_price": 100.0, "seekingalpha_follower_count": 102283, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ABT.png"}