{"symbol": "ACN", "name": "Accenture plc", "next_earnings_utc": 1593081900, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 10901222700.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.84797, "eps_up_revisions": 0, "eps_down_revisions": 22, "revenue_up_revisions": 0, "revenue_down_revisions": 19, "total_analysts": 29, "analysts_sell": 0, "analysts_buy": 15, "analysts_outperform": 4, "analysts_hold": 9, "analysts_underperform": 1, "webpage": "accenture.com", "year_founded": 1989, "street_address": "1 Grand Canal Square", "city": "Dublin", "state": null, "zipcode": "2", "country": "Ireland", "phone_number": "353 1 646 2000", "short_description": "Accenture plc provides consulting, technology, and outsourcing services worldwide.", "long_description": "Accenture plc provides consulting, technology, and outsourcing services worldwide. Its Communications, Media & Technology segment provides professional services for clients to accelerate and deliver digital transformation, develop industry-specific solutions, and enhance efficiencies and business results for communications, media, high tech, software, and platform companies. The company's Financial Services segment offers services for profitability pressures, industry consolidation, regulatory changes, and the need to continually adapt to new digital technologies for banking, capital market, and insurance industries. Its Health & Public Service segment provides consulting services and digital solutions to help clients deliver social, economic, and health outcomes for healthcare payers and providers, government departments and agencies, public service organizations, educational institutions, and non-profit organizations. The company's Products segment helps clients enhance their performance in distribution, sales, and marketing; in research and development, and manufacturing; and in business functions, such as finance, human resources, procurement, and supply chain. This segment serves clients in consumer goods, retail, and travel services industries; automotive, freight and logistics, industrial and electrical equipment, consumer durable and heavy equipment, and construction and infrastructure management companies; and pharmaceutical, medical technology, and biotechnology companies. Its Resources segment enables clients in chemicals, energy, forest products, metals and mining, and utilities and related industries to develop and implement strategies, improve operations, manage complex change initiatives, and integrate digital technologies. Accenture plc has alliance relationships with Amazon Web Services, Google, Microsoft, Oracle, Pegasystems, Salesforce, SAP, Workday, TradeIX, and others. Accenture plc was founded in 1989 and is based in Dublin, Ireland.", "industry_name": "IT Services", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 128418352558, "total_enterprise": 126834679558, "number_of_employees": 492000, "outstanding_shares": 637027395, "eps": 7.804547, "diluted_eps": 7.665143, "earnings_from_cont_operations": 5041447000, "gross_profit": 13969844000, "cash": 5440099000, "total_debt": 3410209000, "total_revenue": 44655801000, "cash_from_operations": 6557347000, "net_income": 4971651000, "ebitda": 7198248000, "year_low_stock_price": 137.15, "year_high_stock_price": 216.39, "seekingalpha_follower_count": 42599, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ACN.png"}