{"symbol": "ACU", "name": "Acme United", "next_earnings_utc": 1594990800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "acmeunited.com", "year_founded": 1867, "street_address": "55 Walls Drive", "city": "Fairfield", "state": "CT", "zipcode": "06824", "country": "United States", "phone_number": "203 254 6060", "short_description": "Acme United Corporation, together with its subsidiaries, supplies cutting, measuring, first aid, sharpening, and safety products to the school, home, office, hardware, sporting good, and industrial markets in the United States, Canada, Europe, and Asia.", "long_description": "Acme United Corporation, together with its subsidiaries, supplies cutting, measuring, first aid, sharpening, and safety products to the school, home, office, hardware, sporting good, and industrial markets in the United States, Canada, Europe, and Asia. It offers scissors, rulers, pencil sharpeners, paper trimmers, safety cutters, lettering products, glue guns, and other craft products under the Westcott brand name; and cutting tools for hardware and industrial, lawn and garden, food processing, sewing, and housewares channels under the Clauss brand. The company also provides fixed blade, folding knives, line of sight cutting tools, and tactical tools under the Camillus brand name; fishing tools and knives, as well as cut and puncture resistant gloves, telescopic landing nets, net containment systems, and fishing gaffs under the Cuda brand name; and sharpening tools for knives, scissors, chisels, skis, skates, and other edges under the DMT brand name. In addition, it offers first aid kits, refills, and safety products under the First Aid Only brand; portable eyewash solutions and over-the-counter medications, including active ingredients aspirin, acetaminophen, and ibuprofen under the PhysiciansCare brand; and bodily fluid and spill clean-up solutions under the Spill Magic brand, as well as through Pac-Kit brand. The company sells its products directly and through its independent manufacturer representatives to wholesale, contract, and retail stationery distributors; office supply super stores; school supply distributors; industrial distributors; wholesale florists; mass market and ecommerce retailers; and hardware chains, as well as sells a selection of products through its websites. The company was formerly known as Acme Shear Company and changed its name to Acme United Corporation in 1971. The company was founded in 1867 and is based in Fairfield, Connecticut.", "industry_name": "Commercial Services and Supplies", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSEMKT", "equity_type": "stocks", "market_cap": 71393616, "total_enterprise": 107120616, "number_of_employees": 441, "outstanding_shares": 3337710, "eps": 1.785495, "diluted_eps": 1.71536, "earnings_from_cont_operations": 5983608, "gross_profit": 53729858, "cash": 4272000, "total_debt": 39999000, "total_revenue": 146862342, "cash_from_operations": 16178231, "net_income": 5983608, "ebitda": 12376070, "year_low_stock_price": 17.1, "year_high_stock_price": 24.91, "seekingalpha_follower_count": 799, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ACU.png"}