{"symbol": "AGX", "name": "Argan", "next_earnings_utc": 1591733700, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 65700000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.08, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "arganinc.com", "year_founded": 1961, "street_address": "One Church Street", "city": "Rockville", "state": "MD", "zipcode": "20850", "country": "United States", "phone_number": "301 315 0027", "short_description": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, operations management, maintenance, project development, technical, and consulting services to the power generation and renewable energy markets.", "long_description": "Argan, Inc., through its subsidiaries, provides engineering, procurement, construction, commissioning, operations management, maintenance, project development, technical, and consulting services to the power generation and renewable energy markets. The company operates through Power Industry Services, Industrial Fabrication and Field Services, and Telecommunications Infrastructure Services segments. The Power Industry Services segment offers engineering, procurement, and construction (EPC) contracting services to the owners of alternative energy facilities, such as biomass plants, wind farms, and solar fields; and design, construction, project management, start-up, and operation services for projects with approximately 15 gigawatts of power-generating capacity. This segment serves independent power project owners, public utilities, power plant equipment suppliers, and energy plant construction companies. The Industrial Fabrication and Field Services segment provides industrial field, and steel pipe and vessel fabrication services for forest products, power, energy, large fertilizer, EPC, mining, and petrochemical companies in southeast region of the United States. The Telecommunications Infrastructure Services segment offers trenchless directional boring and excavation for underground communication and power networks, as well as aerial cabling services; and installs buried cable, high and low voltage electric lines, and private area outdoor lighting systems. It also provides structuring, cabling, terminations, and connectivity that offers the physical transport for high speed data, voice, video, and security networks. This segment serves state and local government agencies, regional communications service providers, electric utilities, and other commercial customers, as well as federal government facilities comprising cleared facilities in the mid-Atlantic region of the United States. Argan, Inc. was founded in 1961 and is headquartered in Rockville, Maryland.", "industry_name": "Construction and Engineering", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 610153752, "total_enterprise": 286282752, "number_of_employees": 1154, "outstanding_shares": 15644968, "eps": -2.732795, "diluted_eps": -2.732795, "earnings_from_cont_operations": -40712000, "gross_profit": -10220000, "cash": 327862000, "total_debt": 2210000, "total_revenue": 238997000, "cash_from_operations": 53565000, "net_income": -42689000, "ebitda": -46296000, "year_low_stock_price": 29.91, "year_high_stock_price": 47.73, "seekingalpha_follower_count": 4249, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AGX.png"}