{"symbol": "AIR", "name": "AAR", "next_earnings_utc": 1594238700, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 366035200.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.12575, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "aarcorp.com", "year_founded": 1951, "street_address": "One AAR Place", "city": "Wood Dale", "state": "IL", "zipcode": "60191", "country": "United States", "phone_number": "630-227-2000", "short_description": "AAR Corp. provides products and services to commercial aviation, government, and defense markets worldwide.", "long_description": "AAR Corp. provides products and services to commercial aviation, government, and defense markets worldwide. The company operates in two segments, Aviation Services and Expeditionary Services. The Aviation Services segment offers aftermarket support and services; inventory management and distribution services; and maintenance, repair, and overhaul, as well as engineering services. This segment also sells and leases new, overhauled, and repaired engine and airframe parts, and components; and provides inventory and repair programs, warranty claim management, and outsourcing programs for engine and airframe parts and components, as well as performance-based supply chain logistics programs in support of the U.S. Department of Defense and foreign governments. In addition, it offers airframe inspection, maintenance, repair and overhaul, painting, line maintenance, airframe modification, structural repair, avionic and installation, exterior and interior refurbishment, and engineering and support services; and repairs and overhauls landing gears, wheels, and brakes. The Expeditionary Services segment provides products and services supporting the movement of equipment and personnel by the U.S. and foreign governments, and non-governmental organizations. This segment also designs, manufactures, and repairs transportation pallets, and various containers and shelters, as well as composite materials for commercial, business, and military aircraft; and provides engineering, design, and system integration services for command and control systems. It serves commercial, defense, and governmental aircraft fleet operators; original equipment manufacturers; and independent service providers, as well as various other domestic and foreign military customers. The company primarily markets and sells products and services through its employees and foreign sales representatives. AAR Corp. was founded in 1951 and is headquartered in Wood Dale, Illinois.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 804759242, "total_enterprise": 1053759242, "number_of_employees": 5650, "outstanding_shares": 34568696, "eps": 1.249639, "diluted_eps": 1.248691, "earnings_from_cont_operations": 66400000, "gross_profit": 327500000, "cash": 37000000, "total_debt": 286000000, "total_revenue": 2218200000, "cash_from_operations": 34000000, "net_income": 43700000, "ebitda": 143200000, "year_low_stock_price": 8.56, "year_high_stock_price": 52.78, "seekingalpha_follower_count": 3846, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AIR.png"}