{"symbol": "AIRT", "name": "Air T", "next_earnings_utc": 1592474400, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "airt.net", "year_founded": 1980, "street_address": "5930 Balsom Ridge Road", "city": "Denver", "state": "NC", "zipcode": "28037", "country": "United States", "phone_number": "828-464-8741", "short_description": "Air T, Inc., through its subsidiaries, provides overnight air cargo, ground equipment sale, and ground support services in the United States and internationally.", "long_description": "Air T, Inc., through its subsidiaries, provides overnight air cargo, ground equipment sale, and ground support services in the United States and internationally. The company’s Overnight Air Cargo segment offers air express delivery services. As of March 31, 2019, this segment had 79 aircrafts under the dry-lease agreements with FedEx. Its Ground Equipment Sales segment manufactures, sells, and services aircraft deicers, scissor-type lifts, military and civilian decontamination units, flight-line tow tractors, glycol recovery vehicles, and other specialized equipment. This segment sells its products to passenger and cargo airlines, ground handling companies, the United States Air Force, airports, and industrial customers. The company’s Ground Support Services segment provides aircraft ground support equipment, fleet, and facility maintenance services to airlines and aviation service providers. Its Commercial Aircraft, Engines and Parts segment offers commercial aircraft trading, leasing, and parts solutions; commercial aircraft storage, storage maintenance, and aircraft disassembly/part-out services; commercial aircraft parts sales, exchanges, procurement services, consignment programs, and overhaul and repair services; and aircraft instrumentation, avionics, and a range of accessories for civilian, military transport, regional/commuter and business/commercial jet, and turboprop aircraft. This segment also provides composite aircraft structures, and repair and support services. Its Printing Equipment and Maintenance segment designs, manufactures, and sells digital print production equipment, spare parts, supplies, and consumable items, as well as provides maintenance contracts. Air T, Inc. was founded in 1980 and is based in Denver, North Carolina.", "industry_name": "Air Freight and Logistics", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 40485126, "total_enterprise": 137167126, "number_of_employees": 769, "outstanding_shares": 2912599, "eps": 3.406403, "diluted_eps": 3.406403, "earnings_from_cont_operations": 4955932, "gross_profit": 59055094, "cash": 13381000, "total_debt": 100860000, "total_revenue": 272842478, "cash_from_operations": 10043360, "net_income": 9614995, "ebitda": 16665981, "year_low_stock_price": 9.06, "year_high_stock_price": 24.5, "seekingalpha_follower_count": 701, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AIRT.png"}