{"symbol": "ALLY", "name": "Ally Financial", "next_earnings_utc": 1595244600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1517011930.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.23057, "eps_up_revisions": 0, "eps_down_revisions": 13, "revenue_up_revisions": 0, "revenue_down_revisions": 14, "total_analysts": 18, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 6, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "ally.com", "year_founded": 1919, "street_address": "Ally Detroit Center", "city": "Detroit", "state": "MI", "zipcode": "48226", "country": "United States", "phone_number": "866-710-4623", "short_description": "Ally Financial Inc., a bank holding company, provides various digital financial products and services to consumer, commercial, and corporate customers primarily in the United States and Canada.", "long_description": "Ally Financial Inc., a bank holding company, provides various digital financial products and services to consumer, commercial, and corporate customers primarily in the United States and Canada. It operates through Automotive Finance Operations, Insurance Operations, Mortgage Finance Operations, and Corporate Finance Operations segments. The Automotive Finance Operations segment offers automotive financing services, including providing retail installment sales contracts, loans and operating leases, term loans to dealers, financing dealer floorplans, other lines of credit to dealers, warehouse lines to automotive retailers, and fleet financing. It also provides financing services to companies and municipalities for the purchase or lease of vehicles, and vehicle-remarketing services. The Insurance Operations segment offers consumer finance protection and insurance products through the automotive dealer channel, and commercial insurance products directly to dealers. The Mortgage Finance Operations segment manages held-for-investment consumer mortgage loan portfolio that includes bulk purchases of jumbo and low-to-moderate income mortgage loans originated by third parties, as well as direct-to-consumer mortgage offerings. The Corporate Finance Operations segment provides senior secured leveraged cash flow and asset-based loans to middle market companies; leveraged loans; and commercial real estate product. It primarily focuses on businesses owned by private equity sponsors with loans used for leveraged buyouts, mergers and acquisitions, debt refinancing, restructurings, and working capital. The company, through its subsidiary, Ally Bank, also offers commercial banking products and services. In addition, it provides securities brokerage and investment advisory services. The company was formerly known as GMAC Inc. and changed its name to Ally Financial Inc. in May 2010. Ally Financial Inc. was founded in 1919 and is headquartered in Detroit, Michigan.", "industry_name": "Consumer Finance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 6509699127, "total_enterprise": null, "number_of_employees": 8700, "outstanding_shares": 373155582, "eps": 2.730196, "diluted_eps": 2.72744, "earnings_from_cont_operations": 1027000000, "gross_profit": 5572000000, "cash": 6161000000, "total_debt": 40559000000, "total_revenue": 5572000000, "cash_from_operations": 4050000000, "net_income": 1022000000, "ebitda": null, "year_low_stock_price": 10.22, "year_high_stock_price": 35.42, "seekingalpha_follower_count": 11470, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ALLY.png"}