{"symbol": "ALOT", "name": "AstroNova, Inc.", "next_earnings_utc": 1591156800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 29750000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.19, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "astronovainc.com", "year_founded": 1969, "street_address": "600 East Greenwich Avenue", "city": "West Warwick", "state": "RI", "zipcode": "02893", "country": "United States", "phone_number": "401 828 4000", "short_description": "AstroNova, Inc. designs, develops, manufactures, and distributes specialty printers, and data acquisition and analysis systems in the United States, Europe, Asia, Canada, Central and South America, and internationally.", "long_description": "AstroNova, Inc. designs, develops, manufactures, and distributes specialty printers, and data acquisition and analysis systems in the United States, Europe, Asia, Canada, Central and South America, and internationally. The company operates through two segments, Product Identification (PI) and Test & Measurement (T&M). The PI segment offers tabletop and production-ready digital color label printers, as well as specialty OEM printing systems under the QuickLabel brand; digital color label mini-presses and inline specialty printing systems under the TrojanLabel brand; and labels, tags, inks, toner, and thermal transfer materials under the GetLabels brand. This segment also develops and licenses various specialized software used to design and manage labels and print images, as well as manage and operate its printers and presses on an automated basis. It serves chemicals, cosmetics, food and beverage, medical products, pharmaceuticals, and other industries, as well as brand owners, label converters, commercial printers, and packaging manufacturers. The T&M segment offers airborne printing solutions, such as ToughWriter used to print hard copies of navigation maps, arrival and departure information, flight itineraries, weather maps, performance data, passenger data, and various air traffic control data; ToughSwitch, an ethernet switches used to connect multiple computers or Ethernet devices; PTA-45B cockpit printers; TMX high-speed data acquisition systems; Daxus DXS-100 distributed data acquisition systems; SmartCorder DDX100 portable data acquisition systems; EV-500, a digital strip chart recording system; and Miltope and RITEC branded airborne printers. This segment serves aerospace and defense, automotive, commercial airline, energy, manufacturing and transportation industries. The company was formerly known as Astro-Med, Inc. and changed its name to AstroNova, Inc. in May 2016. AstroNova, Inc. was founded in 1969 and is headquartered in West Warwick, Rhode Island.", "industry_name": "Technology Hardware, Storage and Peripherals", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 45631112, "total_enterprise": 62846112, "number_of_employees": 365, "outstanding_shares": 7096596, "eps": 0.250427, "diluted_eps": 0.24, "earnings_from_cont_operations": 1759000, "gross_profit": 48758000, "cash": 4249000, "total_debt": 21464000, "total_revenue": 133446000, "cash_from_operations": 3224000, "net_income": 1759000, "ebitda": 8717000, "year_low_stock_price": 5.29, "year_high_stock_price": 26.97, "seekingalpha_follower_count": 614, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ALOT.png"}