{"symbol": "ALYA", "name": "Alithya Group", "next_earnings_utc": 1592566200, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 50362333.78710999, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 1, "revenue_down_revisions": 1, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "alithya.com", "year_founded": 1992, "street_address": "700, De la Gauchetière Street West", "city": "Montreal", "state": "QC", "zipcode": "H3B 5M2", "country": "Canada", "phone_number": "514-285-5552", "short_description": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe.", "long_description": "Alithya Group Inc. provides strategy and digital technology services in Canada, the United States, and Europe. The company’s digital strategy and transformation services include strategic consulting and organizational change, governance and strategic alignment, investment management, collaborative management and co-management, business and enterprise architecture, managing the people side of change, and project management. It also provides enterprise and business architecture, business analysis and architecture, information systems architecture, and technology architecture services. In addition, the company offers project management, project execution, change and transition management, integrated portfolio, and project management solutions; and infrastructure management services, including IT management, business report, infrastructure health check and audit, technology component design and documentation, technology implementation, infrastructure upgrade, repair and optimization, operation of physical and virtual, SAN, and network infrastructure. Further, it provides code and system audits, strategic positioning, applications health check, organic architecture, development and programming, solutions integration, system evolution, design and ergonomics, user experience, security and mobility, establishment of methodologies and tools, and remote development services, as well as various solutions. It serves banking, financial markets and insurance, manufacturing, retail and distribution, energy, transportation, telecommunications, healthcare, professional services, and public sector clients. The company was founded in 1992 and is based in Montreal, Canada.", "industry_name": "IT Services", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 108090303, "total_enterprise": 136269667, "number_of_employees": 2028, "outstanding_shares": 58081235, "eps": -0.117424084898613, "diluted_eps": -0.117424084898613, "earnings_from_cont_operations": -6485995, "gross_profit": 64130644, "cash": 16265816, "total_debt": 45768547, "total_revenue": 214456022, "cash_from_operations": 3657325, "net_income": -6485995, "ebitda": 4416669, "year_low_stock_price": 0.9615, "year_high_stock_price": 3.19, "seekingalpha_follower_count": 149, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ALYA.png"}