{"symbol": "AMBO", "name": "Ambow Education Holding", "next_earnings_utc": 1595412000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 63182522.57962288, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.606910156868959, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "ambow.com", "year_founded": 2000, "street_address": "Tower 1, Chang'an Center", "city": "Beijing", "state": null, "zipcode": "100043", "country": "China", "phone_number": "86 10 6206 8000", "short_description": "Ambow Education Holding Ltd. provides educational and career enhancement services and products to students, recent graduates, and corporate employees and management in the People's Republic of China.", "long_description": "Ambow Education Holding Ltd. provides educational and career enhancement services and products to students, recent graduates, and corporate employees and management in the People's Republic of China. The company operates through two segments, K-12 Schools and CP&CE Programs. The K-12 Schools segment provides educational services covering K-12 programs and tutoring services; and international education programs. The CP&CE Programs segment operates tutoring centers that provide classroom instruction, small class, and one-on-one tutoring services for students to perform better in school and prepare for important tests, primarily high school and university entrance exams; and educational curriculum through its web-based applications. This segment also offers educational software products include eBoPo, which offers full subjects, online practice tests, and instructions for K-12 level students; career enhancement services and products focusing on improving educational opportunities for primary and advanced degree school students, and employment opportunities for university graduates; and outbound and in-house management trainings for corporate clients. In addition, this segment provides students with training for professional skills, such as case studies, job environment simulation, and technical skills; soft skills, including time management, presentation, leadership, and interview techniques; and intellectualized operational services to corporate clients, colleges, and universities. As of December 31, 2019, the company had 60 centers and schools comprising 3 K-12 schools, 25 tutoring centers, 26 training offices, 5 career enhancement centers, and 1 career enhancement college. The company was founded in 2000 and is headquartered in Beijing, the People's Republic of China.", "industry_name": "Diversified Consumer Services", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSEMKT", "equity_type": "stocks", "market_cap": 35678483, "total_enterprise": 38954704, "number_of_employees": 2803, "outstanding_shares": 21689048, "eps": -0.659845897542691, "diluted_eps": -0.660644271783309, "earnings_from_cont_operations": -14423013, "gross_profit": 28007727, "cash": 35342602, "total_debt": 38716483, "total_revenue": 83860030, "cash_from_operations": -1466343, "net_income": -14353359, "ebitda": -4612302, "year_low_stock_price": 1.1, "year_high_stock_price": 5.11, "seekingalpha_follower_count": 602, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AMBO.png"}