{"symbol": "AMSIY", "name": "ArcelorMittal South Africa", "next_earnings_utc": 1593180000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 899608374.7552342, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "arcelormittalsa.com", "year_founded": 1928, "street_address": "Delfos Boulevard", "city": "Vanderbijlpark", "state": null, "zipcode": null, "country": "South Africa", "phone_number": "27 16 889 9111", "short_description": "ArcelorMittal South Africa Ltd manufactures and sells long and flat steel products.", "long_description": "ArcelorMittal South Africa Ltd manufactures and sells long and flat steel products. The company operates through Flat Steel Products, Long Steel Products, and Coke and Chemicals segments. It offers flat steel products, including hot rolled plates, hot and cold rolled coils, galvanized coils, color coils, electrogalvanized coils, and tinplate coils. The company also provides foundry products that include castings, such as air injection tubes, door bodies, fire bars, pallet cars, pallet frames, goose necks, etc. for coke ovens, direct reduction, sinter plant, and blast furnaces, as well as the hot and cold mills. In addition, it offers long steel products comprising fencing profiles, forgings, hexagon bars, hollow bars, mining bars, rails, reinforcing bars/Y bars, rounds and squares, special profiles, structural and heavy structural sections, window sections, wire rods, billets and blooms, hot-finished and cold-drawn seamless tubes, and forged products; and tubular products, which comprise hot rolled seamless line pipes and OCTG, hot rolled boiler tubes, and cold drawn precision products. Further, the company provides commercial coke for the ferro-alloy industry; processes and beneficiates metallurgical and steel by-products, including coal tar; and provides commercial grade coking coal. It serves clients in agricultural, armament, automotive, bolt and nut, chains, construction, engineering, furniture and appliance, mining, packaging, piping, renewable energy, roofing and cladding, tubing, food and beverages, infrastructure, defense, and oil and gas industries in the South Africa and sub-Saharan Africa. The company was formerly known as Mittal Steel South Africa Limited and changed its name to ArcelorMittal South Africa Ltd in October 2006. The company was founded in 1928 and is headquartered in Vanderbijlpark, South Africa. ArcelorMittal South Africa Ltd is a subsidiary of ArcelorMittal Holdings AG.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 40997641, "total_enterprise": 244273487, "number_of_employees": 8379, "outstanding_shares": 445752100, "eps": -0.305322913468473, "diluted_eps": -0.305598594817676, "earnings_from_cont_operations": -333873605, "gross_profit": 709517111, "cash": 141946263, "total_debt": 389709610, "total_revenue": 2952667919, "cash_from_operations": 9210799, "net_income": -333873605, "ebitda": -111600608, "year_low_stock_price": 0.01, "year_high_stock_price": 0.14, "seekingalpha_follower_count": 159, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AMSIY.png"}