{"symbol": "AMSWA", "name": "American Software", "next_earnings_utc": 1592510700, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 28405000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.06, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "amsoftware.com", "year_founded": 1970, "street_address": "470 East Paces Ferry Road, N.E.", "city": "Atlanta", "state": "GA", "zipcode": "30305", "country": "United States", "phone_number": "404-261-4381", "short_description": "American Software, Inc. develops, markets, and supports a portfolio of software and services worldwide.", "long_description": "American Software, Inc. develops, markets, and supports a portfolio of software and services worldwide. It operates in three segments: Supply Chain Management (SCM), Information Technology Consulting (IT Consulting), and Other. The SCM segment offers supply chain management and retail planning solutions, including sales and operations planning, demand optimization, inventory optimization, manufacturing planning and scheduling, supply optimization, retail allocation and merchandise planning, and transportation optimization to streamline and optimize the forecasting, inventory, production, supply, allocation, distribution, and management of products between trading partners. It also provides cloud solutions for supply chain and product lifecycle management, quality control, vendor compliance, and enterprise resource planning for retailers and manufacturers; and advanced analytics and business intelligence solutions for the supply chain market. The IT Consulting segment offers IT staffing and consulting services, such as professional, product management, and project management outsourcing services; staff augmentation services in the areas of cloud, collaboration, network, and security; and social media and analytic marketing services. It also provides software enhancement, documentation, updates, customer education, consulting, systems integration services, maintenance, and support services. The Other segment offers purchasing and materials management, customer order processing, financial, e-commerce, human resource, and manufacturing solutions. The company markets its products through direct and indirect sales channels to the retail, apparel and footwear, consumer packaged goods, chemicals, oil and gas, life sciences, telecommunications, consumer electronics, industrial products, and other manufacturing industries. American Software, Inc. was founded in 1970 and is headquartered in Atlanta, Georgia.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 672450228, "total_enterprise": 578529228, "number_of_employees": 424, "outstanding_shares": 32190054, "eps": 0.256279, "diluted_eps": 0.250045, "earnings_from_cont_operations": 8071000, "gross_profit": 61532000, "cash": 96287000, "total_debt": 2366000, "total_revenue": 112464000, "cash_from_operations": 23434000, "net_income": 8071000, "ebitda": 8051000, "year_low_stock_price": 9.05, "year_high_stock_price": 21.23, "seekingalpha_follower_count": 1173, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AMSWA.png"}