{"symbol": "AOBC", "name": "American Outdoor Brands", "next_earnings_utc": 1592424900, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 207909750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.3425, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 1, "revenue_down_revisions": 2, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "aob.com", "year_founded": 1852, "street_address": "2100 Roosevelt Avenue", "city": "Springfield", "state": "MA", "zipcode": "01104", "country": "United States", "phone_number": "800-331-0852", "short_description": "American Outdoor Brands Corporation designs, manufactures, and sells firearms worldwide.", "long_description": "American Outdoor Brands Corporation designs, manufactures, and sells firearms worldwide. The company’s Firearms segment offers handguns, long guns, handcuffs, suppressors, and other firearm-related products under the Smith & Wesson, M&P, Performance Center, Thompson/Center Arms, and Gemtech brands. It also provides manufacturing services to other businesses under the Smith & Wesson and Smith & Wesson Precision Components brands; and sells parts purchased through third parties. This segment sells its products to shooting and outdoor enthusiasts, collectors, sportsmen, competitive shooters, hunters, individuals desiring home and personal protection, law enforcement and military personnel and agencies, and other government organizations. The company’s Outdoor Products & Accessories segment offers reloading, gunsmithing, and gun cleaning supplies; stainless steel cutting tools and accessories; flashlights, tree saws, and related trimming accessories; shooting supplies, rests, and other related accessories; apparel; vault accessories; laser grips and laser sights; and products for survival and emergency preparedness, as well as other products. It provides its products under the Caldwell, Wheeler, Tipton, Frankford Arsenal, Lockdown, Hooyman, BOG, Crimson Trace, Imperial, Schrade, Old Timer, Uncle Henry, BUBBA, LaserLyte, Smith & Wesson, M&P, Performance Center, Thompson/Center, UST, and KeyGear brands. The company markets its products through independent dealers, retailers, in-store retails, and direct to consumers; print, broadcast, and digital advertising campaigns; social and electronic media; in-store retail merchandising strategies; and Websites and online retail stores. The company was formerly known as Smith & Wesson Holding Corporation and changed its name to American Outdoor Brands Corporation in January 2017. The company was founded in 1852 and is based in Springfield, Massachusetts.", "industry_name": "Leisure Products", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 650907270, "total_enterprise": 855902270, "number_of_employees": 1984, "outstanding_shares": 55068297, "eps": 0.268785, "diluted_eps": 0.259144, "earnings_from_cont_operations": 14740000, "gross_profit": 216727000, "cash": 46101000, "total_debt": 251096000, "total_revenue": 620486000, "cash_from_operations": 11664000, "net_income": 14740000, "ebitda": 86353000, "year_low_stock_price": 5.41, "year_high_stock_price": 11.84, "seekingalpha_follower_count": 25056, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AOBC.png"}