{"symbol": "APH", "name": "Amphenol", "next_earnings_utc": 1595419200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1744061060.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.62072, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 10, "total_analysts": 17, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 2, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "amphenol.com", "year_founded": 1932, "street_address": "358 Hall Avenue", "city": "Wallingford", "state": "CT", "zipcode": "06492", "country": "United States", "phone_number": "203 265 8900", "short_description": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally.", "long_description": "Amphenol Corporation, together with its subsidiaries, primarily designs, manufactures, and markets electrical, electronic, and fiber optic connectors in the United States, China, and internationally. It operates in two segments, Interconnect Products and Assemblies, and Cable Products and Solutions. The Interconnect Products and Assemblies segment offers connector and connector systems, including fiber optic, harsh environment, high-speed, and radio frequency interconnect products, as well as antennas; power interconnect products, busbars, and distribution systems; and other connectors. It also provides value-add products, such as backplane interconnect systems, cable assemblies and harnesses, and cable management products; and other products comprising antennas, flexible and rigid printed circuit boards, hinges, molded parts, production-related products, sensors and sensor-based products, and switches. The Cable Products and Solutions segment offers coaxial, power, and specialty cables; cable assemblies; and components, which include combiner/splitter products, connector and connector systems, and fiber optic components. The company sells its products through its sales force, independent representatives, and a network of electronics distributors to original equipment manufacturers, electronic manufacturing services companies, original design manufacturers, and service providers in the automotive, broadband communication, commercial aerospace, industrial, information technology and data communication, military, mobile device, and mobile network markets. Amphenol Corporation was founded in 1932 and is headquartered in Wallingford, Connecticut.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 28604108651, "total_enterprise": 31372808651, "number_of_employees": 74000, "outstanding_shares": 295894369, "eps": 3.799209, "diluted_eps": 3.670688, "earnings_from_cont_operations": 1137300000, "gross_profit": 2548000000, "cash": 2383600000, "total_debt": 5092400000, "total_revenue": 8128900000, "cash_from_operations": 1543000000, "net_income": 1129600000, "ebitda": 1862500000, "year_low_stock_price": 63.05, "year_high_stock_price": 110.24, "seekingalpha_follower_count": 6044, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/APH.png"}