{"symbol": "APOG", "name": "Apogee Enterprises", "next_earnings_utc": 1593685800, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 304544200.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.1875, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 6, "analysts_sell": 1, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "apog.com", "year_founded": 1949, "street_address": "4400 West 78th Street", "city": "Minneapolis", "state": "MN", "zipcode": "55435", "country": "United States", "phone_number": "952 835 1874", "short_description": "Apogee Enterprises, Inc. designs and develops glass and metal products and services in the United States, Canada, and Brazil.", "long_description": "Apogee Enterprises, Inc. designs and develops glass and metal products and services in the United States, Canada, and Brazil. The company operates in four segments: Architectural Framing Systems, Architectural Glass, Architectural Services, and Large-Scale Optical Technologies (LSO). The Architectural Framing Systems segment designs, engineers, fabricates, and finishes the aluminum frames used in customized aluminum and glass window; curtain wall; storefront; and entrance systems, such as the outside skin and entrances of commercial, institutional, and multi-family residential buildings. The Architectural Glass segment fabricates coated and high-performance glass used in customized window and wall systems, including the outside skin of commercial, institutional, and multi-family residential buildings. The Architectural Services segment offers full-service installation of the walls of glass, windows, and other curtain wall products making up the outside skin of commercial and institutional buildings. The LSO segment manufactures value-added glass and acrylic products for framing and display applications. The company's products and services are primarily used in commercial buildings, such as office towers, hotels, and retail centers; and institutional buildings comprising education facilities, health care facilities, and government buildings, as well as multi-family residential buildings. It markets its architectural products and services through direct sales force, independent sales representatives, and distributors to glazing subcontractors and general contractors; and value-added glass and acrylics through retail chains, picture-framing shops, and independent distributors to museums, shops, and galleries. The company was founded in 1949 and is based in Minneapolis, Minnesota.", "industry_name": "Building Products", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 543513823, "total_enterprise": 800896823, "number_of_employees": 7200, "outstanding_shares": 26320282, "eps": 2.338671, "diluted_eps": 2.32, "earnings_from_cont_operations": 61914000, "gross_profit": 303959000, "cash": 14952000, "total_debt": 272335000, "total_revenue": 1387439000, "cash_from_operations": 107262000, "net_income": 61914000, "ebitda": 119643000, "year_low_stock_price": 13.77, "year_high_stock_price": 46.7, "seekingalpha_follower_count": 2118, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/APOG.png"}