{"symbol": "AROW", "name": "Arrow Financial", "next_earnings_utc": 1595590200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 30000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.54, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "arrowfinancial.com", "year_founded": 1851, "street_address": "250 Glen Street", "city": "Glens Falls", "state": "NY", "zipcode": "12801", "country": "United States", "phone_number": "518-745-1000", "short_description": "Arrow Financial Corporation, a bank holding company, provides commercial and consumer banking, and financial products and services.", "long_description": "Arrow Financial Corporation, a bank holding company, provides commercial and consumer banking, and financial products and services. The company's deposit products include demand deposits, interest-bearing checking accounts, savings deposits, time deposits, and other time deposits. Its lending activities comprise commercial loans, such as term loans, time notes, and lines of credit; and commercial real estate loans to finance real estate purchases, refinancing, expansions, and improvements to commercial properties, as well as commercial construction and land development loans to finance projects. The company's lending activities also include consumer installment loans to finance personal expenditures, personal lines of credit, overdraft protection, and automobile loans; and residential real estate loans, fixed home equity loans, and home equity lines of credit for consumers to finance home improvements, debt consolidation, education, and other uses. In addition, it maintains an indirect lending program; and sells residential real estate loan originations into the secondary market. Further, the company provides retirement planning, trust, and estate administration services for individuals; and pension, profit-sharing, and employee benefit plan administration services for corporations. Additionally, it offers insurance agency services comprising group health care policies and life insurance, and property and casualty insurance products; and investment advisory services to its proprietary mutual funds, as well as holds a real estate investment trust. The company operates in the northeastern region of New York State in Warren, Washington, Saratoga, Essex, Clinton, Rensselaer, Albany, and Schenectady counties, as well as surrounding areas. It owns twenty-seven branch banking offices; and leases thirteen branch banking offices, as well as two residential loan origination offices. The company was founded in 1851 and is headquartered in Glens Falls, New York.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 438272464, "total_enterprise": null, "number_of_employees": 520, "outstanding_shares": 14983674, "eps": 2.463903, "diluted_eps": 2.459722, "earnings_from_cont_operations": 36868000, "gross_profit": 114917000, "cash": 143720000, "total_debt": 143951000, "total_revenue": 114917000, "cash_from_operations": 46339000, "net_income": 36868000, "ebitda": null, "year_low_stock_price": 20.79, "year_high_stock_price": 38.31, "seekingalpha_follower_count": 905, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AROW.png"}