{"symbol": "ASB", "name": "Associated Banc-Corp", "next_earnings_utc": 1595535300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 305216670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.28429, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 4, "revenue_down_revisions": 2, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 9, "analysts_underperform": 1, "webpage": "associatedbank.com", "year_founded": 1861, "street_address": "433 Main Street", "city": "Green Bay", "state": "WI", "zipcode": "54301", "country": "United States", "phone_number": "920-491-7500", "short_description": "Associated Banc-Corp, a bank holding company, provides various banking and nonbanking products to individuals and businesses in Wisconsin, Illinois, and Minnesota.", "long_description": "Associated Banc-Corp, a bank holding company, provides various banking and nonbanking products to individuals and businesses in Wisconsin, Illinois, and Minnesota. Its Corporate and Commercial Specialty segment offers deposit and cash management solutions, such as commercial checking and interest-bearing deposit products, cash vault and night depository services, liquidity solutions, payables and receivables solutions, and information services; and lending solutions, including commercial loans and lines of credit, commercial real estate financing, construction loans, letters of credit, leasing, asset based lending, and loan syndications. This segment also provides specialized financial services comprising interest rate risk management, foreign exchange solutions, and commodity hedging. The company's Community, Consumer, and Business segment offers checking, credit, debit and pre-paid cards, online banking and bill pay, and money transfer services; residential mortgages, home equity loans and lines of credit, personal and installment loans, real estate financing, business loans, and business lines of credit; savings, money market deposit accounts, IRA accounts, certificates of deposit, and fixed and variable annuities, as well as full-service, discount, and online investment brokerage; investment advisory services; trust and investment management accounts; and insurance and other related products and services. This segment also engages in the administration of pension, profit-sharing and other employee benefit plans, fiduciary and corporate agency services, and institutional asset management services. Its Risk Management and Shared Services segment provides corporate risk management, credit administration, finance, treasury, operations, and technology services. As of December 31, 2019, the company operated 248 banking branches serving over 120 communities. Associated Banc-Corp was founded in 1861 and is headquartered in Green Bay, Wisconsin.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2116568637, "total_enterprise": null, "number_of_employees": 4669, "outstanding_shares": 151075563, "eps": 1.6991, "diluted_eps": 1.684181, "earnings_from_cont_operations": 285942000, "gross_profit": 1156972000, "cash": 990644000, "total_debt": 4095856000, "total_revenue": 1156972000, "cash_from_operations": 567779000, "net_income": 285942000, "ebitda": null, "year_low_stock_price": 10.23, "year_high_stock_price": 22.6, "seekingalpha_follower_count": 1829, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ASB.png"}