{"symbol": "ASRV", "name": "AmeriServ Financial", "next_earnings_utc": 1595329200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "ameriserv.com", "year_founded": null, "street_address": "Main & Franklin Streets", "city": "Johnstown", "state": "PA", "zipcode": "15907-0430", "country": "United States", "phone_number": "814-533-5300", "short_description": "AmeriServ Financial, Inc. operates as the bank holding company for AmeriServ Financial Bank that provides various consumer, mortgage, and commercial financial products.", "long_description": "AmeriServ Financial, Inc. operates as the bank holding company for AmeriServ Financial Bank that provides various consumer, mortgage, and commercial financial products. It offers retail banking services, such as demand, savings, and time deposits; checking and money market accounts; secured and unsecured consumer loans, and mortgage loans; and safe deposit boxes, holiday club accounts, money orders, and traveler's checks. The company also provides lending, depository, and related financial services, such as commercial real estate mortgage loans, short and medium-term loans, revolving credit arrangements, lines of credit, inventory and accounts receivable financing, real estate-construction loans, business savings accounts, certificates of deposit, wire transfers, night depository, and lock box services to commercial, industrial, financial, and governmental customers. In addition, the company offers personal trust products and services, including personal portfolio investment management, estate planning and administration, custodial services, and pre-need trusts; institutional trust products and services comprising 401(k) plans, defined benefit and defined contribution employee benefit plans, and individual retirement accounts; financial services consisting of the sale of mutual funds, annuities, and insurance products; and union collective investment funds to invest union pension dollars in construction projects that utilize union labor. Further, it engages in underwriting as reinsurer of credit life and disability insurance. The company operates through a network of 16 banking locations in Allegheny, Cambria, Centre, Somerset, and Westmoreland counties, Pennsylvania, and Washington County, Maryland; and operates 17 automated bank teller machines. AmeriServ Financial, Inc. is headquartered in Johnstown, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 49937876, "total_enterprise": null, "number_of_employees": 309, "outstanding_shares": 17043644, "eps": 0.322723, "diluted_eps": 0.319611, "earnings_from_cont_operations": 5559000, "gross_profit": 49161000, "cash": 24106000, "total_debt": 99067000, "total_revenue": 49161000, "cash_from_operations": 2563000, "net_income": 5559000, "ebitda": null, "year_low_stock_price": 2.36, "year_high_stock_price": 4.3, "seekingalpha_follower_count": 405, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ASRV.png"}