{"symbol": "ATGN", "name": "Altigen Communications", "next_earnings_utc": 1595536200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "altigen.com", "year_founded": 1994, "street_address": "670 North McCarthy Boulevard", "city": "Milpitas", "state": "CA", "zipcode": "95035", "country": "United States", "phone_number": "408 597 9000", "short_description": "Altigen Communications, Inc., a Microsoft Cloud Solutions provider, designs, delivers, and supports Voice over Internet Protocol (VoIP) phone systems and call center solutions worldwide.", "long_description": "Altigen Communications, Inc., a Microsoft Cloud Solutions provider, designs, delivers, and supports Voice over Internet Protocol (VoIP) phone systems and call center solutions worldwide. The company offers MaxCommunications Server (MaxCS) IP-PBX, a software-based phone system that provides customers with business communications solutions; MaxACD VoIP Contact Center, a software-based automatic call distribution engine, which offers call routing and call distribution options; MaxMobile that extends a set of business PBX functionality to smart phone devices; and MaxCommunicator, a Windows-based desktop application, which provides call control and visual voice mail management to the desktop. It also offers MaxAgent, a Windows-based desktop application to bring call control and workgroup information to call center agents; MaxSupervisor, a Windows-based desktop application for call center supervisors; and MaxACD for Lync, a call center solution. In addition, the company provides hosted services, which include hosted IP PBX, session initiation protocol trunk, call center solution, voice and video calling, conference calling, and various long-distance services; and software assurance services, which offer customers with software updates, patches, new releases, and technical support for the applications they are licensed to use. It sells its products to small-to-medium sized and multi-site businesses, corporate branch offices, call centers, credit unions, and community banks through a channel of distributors and resellers. The company was founded in 1994 and is headquartered in Milpitas, California.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "OTCQB", "equity_type": "stocks", "market_cap": 31560849, "total_enterprise": 28262849, "number_of_employees": 53, "outstanding_shares": 22953345, "eps": 0.078926, "diluted_eps": 0.070095, "earnings_from_cont_operations": 1807000, "gross_profit": 8557000, "cash": 4423000, "total_debt": 1125000, "total_revenue": 10697000, "cash_from_operations": 1698000, "net_income": 1807000, "ebitda": 2140000, "year_low_stock_price": 0.77, "year_high_stock_price": 1.88, "seekingalpha_follower_count": 402, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ATGN.png"}