{"symbol": "AVGO", "name": "Broadcom Inc.", "next_earnings_utc": 1591301700, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5703259420.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 5.1476, "eps_up_revisions": 2, "eps_down_revisions": 23, "revenue_up_revisions": 1, "revenue_down_revisions": 22, "total_analysts": 34, "analysts_sell": 0, "analysts_buy": 18, "analysts_outperform": 8, "analysts_hold": 8, "analysts_underperform": 0, "webpage": "broadcom.com", "year_founded": 2018, "street_address": "1320 Ridder Park Drive", "city": "San Jose", "state": "CA", "zipcode": "95131", "country": "United States", "phone_number": "408-433-8000", "short_description": "Broadcom Inc. designs, develops, and supplies a range of semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide.", "long_description": "Broadcom Inc. designs, develops, and supplies a range of semiconductor devices with a focus on complex digital and mixed signal complementary metal oxide semiconductor based devices and analog III-V based products worldwide. The company operates through three segments: Semiconductor Solutions, Infrastructure Software, and Intellectual Property licensing. It provides set-top box system-on-chips (SoCs); cable, digital subscriber line, and passive optical networking central office/consumer premise equipment SoCs; Wireless local area network access point SoCs; Ethernet switching and routing application specific standard products; embedded processors and controllers; serializer/deserializer application specific integrated circuits; optical and copper, and physical layers; and fiber optic laser and receiver components. The company also offers RF front end modules, filters, and power amplifiers; Wi-Fi, Bluetooth, and global positioning system/global navigation satellite system SoCs; custom touch controllers; serial attached small computer system interface, and redundant array of independent disks controllers and adapters; peripheral component interconnect express switches; fiber channel host bus adapters; read channel based SoCs; custom flash controllers; preamplifiers; and optocouplers, industrial fiber optics, motion control encoders and subsystems, and light emitting diodes. In addition, it provides mainframe and enterprise software solution and cybersecurity solutions. Its products are used in various applications, including enterprise and data center networking, home connectivity, set-top boxes, broadband access, telecommunication equipment, smartphones and base stations, data center servers and storage systems, factory automation, power generation and alternative energy systems, and electronic displays. Broadcom Inc. was incorporated in 2018 and is headquartered in San Jose, California.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 113196921423, "total_enterprise": 152161921423, "number_of_employees": 19000, "outstanding_shares": 399791345, "eps": 6.381371, "diluted_eps": 6.045295, "earnings_from_cont_operations": 2635000000, "gross_profit": 15999000000, "cash": 6444000000, "total_debt": 45381000000, "total_revenue": 22666000000, "cash_from_operations": 9887000000, "net_income": 2638000000, "ebitda": 10107000000, "year_low_stock_price": 155.67, "year_high_stock_price": 331.58, "stocktwits_watchlist_count": 15304, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AVGO.png"}