{"symbol": "AXTI", "name": "AXT", "next_earnings_utc": 1595448300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 21680750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.01, "eps_up_revisions": 1, "eps_down_revisions": 0, "revenue_up_revisions": 2, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "axt.com", "year_founded": 1986, "street_address": "4281 Technology Drive", "city": "Fremont", "state": "CA", "zipcode": "94538", "country": "United States", "phone_number": "510-438-4700", "short_description": "AXT, Inc. researches, develops, and produces compound and single element semiconductor substrates.", "long_description": "AXT, Inc. researches, develops, and produces compound and single element semiconductor substrates. It produces semiconductor substrates using its proprietary vertical gradient freeze technology. The company offers indium phosphide (InP) for use in fiber optic lasers and detectors, passive optical networks, data center connectivity, silicon photonics, photonic integrated circuits, terrestrial solar cells, radio frequency amplifier and switching, infrared light-emitting diode (LEDs) motion control, and infrared thermal imaging. It also provides semi-insulating gallium arsenide (GaAs) substrates for applications in power amplifiers, direct broadcast television, transistors, satellite communications, and solar cells; and semi-conducting GaAs substrates that are used in 3-D sensing, data center communication, high brightness LEDs, lasers, near-infrared sensors, printer head lasers and LEDs, optical couplers, solar cells, and night vision goggles, as well as laser machining, cutting, and drilling. In addition, the company offers germanium (Ge) substrates for use in satellite solar cells, optical sensors and detectors, terrestrial concentrated photo voltaic cells, multi-junction solar cells for satellites, and infrared detectors. Further, it provides materials, including raw gallium, gallium alloys, InP poly-crystal, high purity gallium, arsenic, Ge, Ge dioxide, pyrolytic boron nitride crucibles, and boron oxide. AXT, Inc. sells its products through direct salesforce in the United States, China, and Europe, as well as through independent sales representatives and distributors in Japan, Taiwan, Korea, and internationally. The company was formerly known as American Xtal Technology, Inc. and changed its name to AXT, Inc. in July 2000. AXT, Inc. was founded in 1986 and is headquartered in Fremont, California.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 211096984, "total_enterprise": 200020984, "number_of_employees": 988, "outstanding_shares": 39904912, "eps": -0.04674, "diluted_eps": -0.050039, "earnings_from_cont_operations": -348000, "gross_profit": 23652000, "cash": 28758000, "total_debt": 8976000, "total_revenue": 83771000, "cash_from_operations": 9417000, "net_income": -1674000, "ebitda": 3490000, "year_low_stock_price": 1.85, "year_high_stock_price": 5.91, "seekingalpha_follower_count": 3106, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AXTI.png"}