{"symbol": "AYI", "name": "Acuity Brands", "next_earnings_utc": 1593520800, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 771167560.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.4161, "eps_up_revisions": 0, "eps_down_revisions": 9, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 5, "analysts_underperform": 1, "webpage": "acuitybrands.com", "year_founded": 2001, "street_address": "1170 Peachtree Street, N.E.", "city": "Atlanta", "state": "GA", "zipcode": "30309", "country": "United States", "phone_number": "404-853-1400", "short_description": "Acuity Brands, Inc. provides lighting and building management solutions and services for commercial, institutional, industrial, infrastructure, and residential applications in North America and internationally.", "long_description": "Acuity Brands, Inc. provides lighting and building management solutions and services for commercial, institutional, industrial, infrastructure, and residential applications in North America and internationally. The company offers lighting and control products and solutions, including recessed, surface, and suspended lighting; down, decorative, emergency and exit, track, day, special-use, street and roadway, parking garage, underwater, area pedestrian, flood, decorative site, and landscape lighting; occupancy sensors; photo controls; relay panels; architectural dimming panels; and integrated lighting controls systems. It also provides light emitting diode drivers, power supplies, modular wiring, sensors, glass, and inverters, as well as services across applications that primarily relate to monitoring and controlling lighting systems through network technologies and the commissioning of control systems. The company markets its products under the Lithonia Lighting, Holophane, Peerless, Gotham, Mark Architectural Lighting, Winona Lighting, Juno, Indy, Aculux, Healthcare Lighting, Hydrel, American Electric Lighting, Antique Street Lamps, Sunoptics, eldoLED, Distech Controls, nLight, ROAM, Sensor Switch, Power Sentry, IOTA, and Atrius brands. It serves electrical distributors, retail home improvement centers, electric utilities, national accounts, system integrators, utility distributors, value-added resellers, digital retailers, government entities and municipalities, lighting showrooms, developers, original equipment manufacturers, and energy service companies, as well as the new construction, renovation, and maintenance and repair markets. The company sells its products through independent sales agents, electrical distributors, system integrators, and sales representatives, as well as through a network of distribution centers, regional warehouses, and commercial warehouses. Acuity Brands, Inc. was founded in 2001 and is headquartered in Atlanta, Georgia.", "industry_name": "Electrical Equipment", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3833890251, "total_enterprise": 3924190251, "number_of_employees": 12000, "outstanding_shares": 39241456, "eps": 7.542929, "diluted_eps": 7.512201, "earnings_from_cont_operations": 298700000, "gross_profit": 1479200000, "cash": 380600000, "total_debt": 470900000, "total_revenue": 3544600000, "cash_from_operations": 521100000, "net_income": 298700000, "ebitda": 518400000, "year_low_stock_price": 67.46, "year_high_stock_price": 143.55, "seekingalpha_follower_count": 4886, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/AYI.png"}