{"symbol": "BMI", "name": "Badger Meter", "next_earnings_utc": 1594902600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 98662000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.345, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 6, "analysts_underperform": 0, "webpage": "badgermeter.com", "year_founded": 1905, "street_address": "4545 West Brown Deer Road", "city": "Milwaukee", "state": "WI", "zipcode": "53224", "country": "United States", "phone_number": "800 876 3837", "short_description": "Badger Meter, Inc. manufactures and markets flow measurement, control, and communication solutions in the United States, Asia, Canada, Europe, Mexico, the Middle East, and internationally.", "long_description": "Badger Meter, Inc. manufactures and markets flow measurement, control, and communication solutions in the United States, Asia, Canada, Europe, Mexico, the Middle East, and internationally. It offers mechanical or static water meters, and related radio and software technologies and services to municipal water utilities. The company also provides flow instrumentation products, including meters and valves to measure and control fluids going through a pipe or pipeline, including water, air, steam, oil, and other liquids and gases to original equipment manufacturers as the primary flow measurement device within a product or system, as well as through manufacturers' representatives. Its flow instrumentation products are used in various industries, such as water/wastewater, heating, ventilating and air conditioning, oil and gas, and chemical and petrochemical. In addition, the company offers ORION Migratable for automatic meter reading; ORION (SE) for traditional fixed network applications; and ORION Cellular for infrastructure-free fixed network meter reading solution, as well as BEACON advanced metering analytics, a secure cloud-hosted software suite that establishes alerts for specific conditions and allows consumer engagement tools that permit end water customers to view and manage their water usage activity. It also serves water utilities, municipalities, and commercial and industrial customers. The company sells its products directly, as well as through resellers and representatives. Badger Meter, Inc. was founded in 1905 and is headquartered in Milwaukee, Wisconsin.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1781692665, "total_enterprise": 1723801665, "number_of_employees": 1567, "outstanding_shares": 29117383, "eps": 1.660518, "diluted_eps": 1.650026, "earnings_from_cont_operations": 48207000, "gross_profit": 166393000, "cash": 70376000, "total_debt": 12485000, "total_revenue": 428252000, "cash_from_operations": 93437000, "net_income": 48207000, "ebitda": 87686000, "year_low_stock_price": 41.5, "year_high_stock_price": 70.84, "seekingalpha_follower_count": 2190, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BMI.png"}