{"symbol": "BMRC", "name": "Bank of Marin Bancorp", "next_earnings_utc": 1595246400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 26473000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.43, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 1, "revenue_down_revisions": 2, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "bankofmarin.com", "year_founded": 1989, "street_address": "504 Redwood Boulevard", "city": "Novato", "state": "CA", "zipcode": "94947", "country": "United States", "phone_number": "415-763-4520", "short_description": "Bank of Marin Bancorp operates as the holding company for Bank of Marin that provides a range of financial services primarily to professionals, small and middle-market businesses, individuals, and not-for-profit organizations in California, the United States.", "long_description": "Bank of Marin Bancorp operates as the holding company for Bank of Marin that provides a range of financial services primarily to professionals, small and middle-market businesses, individuals, and not-for-profit organizations in California, the United States. The company offers personal and business checking and savings accounts; and time certificates of deposit, individual retirement accounts, health savings accounts, and demand deposit marketplace accounts, as well as certificate of deposit account registry and insured cash sweep services. It also provides commercial real estate, commercial and industrial, and consumer loans, as well as construction financing and home equity lines of credit. In addition, the company offers merchant card and cash management services; credit cards; mobile deposit, remote deposit capture, automated clearing house, and image lockbox services, as well as wire transfers; fraud detection tools; and valet pick-up service for non-cash deposits. Further, it provides wealth management and trust services comprising customized investment portfolio management, trust administration, estate settlement, and custody services, as well as 401(k) plan services; and automated teller machines, and telephone and Internet banking services. The company operates 23 offices in Marin, Sonoma, San Francisco, Napa, and Alameda counties. Bank of Marin Bancorp was founded in 1989 and is headquartered in Novato, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 454299295, "total_enterprise": null, "number_of_employees": 290, "outstanding_shares": 13500722, "eps": 2.505343, "diluted_eps": 2.471613, "earnings_from_cont_operations": 33990000, "gross_profit": 102724000, "cash": 156274000, "total_debt": 29254000, "total_revenue": 102724000, "cash_from_operations": 39929000, "net_income": 33990000, "ebitda": null, "year_low_stock_price": 23.8, "year_high_stock_price": 47.77, "seekingalpha_follower_count": 462, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BMRC.png"}