{"symbol": "BMTC", "name": "Bryn Mawr Bank", "next_earnings_utc": 1595279700, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 36660000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.4775, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "bmt.com", "year_founded": 1889, "street_address": "801 Lancaster Avenue", "city": "Bryn Mawr", "state": "PA", "zipcode": "19010", "country": "United States", "phone_number": "610-525-1700", "short_description": "Bryn Mawr Bank Corporation operates as the bank holding company for The Bryn Mawr Trust Company that provides commercial and retail banking services to individual and business customers.", "long_description": "Bryn Mawr Bank Corporation operates as the bank holding company for The Bryn Mawr Trust Company that provides commercial and retail banking services to individual and business customers. It operates in two segments, Wealth Management and Banking. The company accepts deposit products, including interest-bearing demand accounts, wholesale time deposits, retail time deposits, savings accounts, noninterest-bearing demand accounts, and wholesale non-maturity deposits, as well as NOW and market rate accounts. It also provides loan and lease portfolio of products, such as commercial mortgages, home equity lines and loans, and residential mortgages, as well as construction, and commercial and industrial consumer loans and leases; and leasing services. In addition, the company offers wealth management services comprising trust administration and other related fiduciary, custody, investment management and advisory, employee benefit account and IRA administration, estate settlement, financial planning, and brokerage services, as well as estate administration, retirement planning, and tax planning and preparation services. Further, it provides insurance and related products and services that include casualty, property, and allied insurance lines, as well as life insurance, annuities, medical insurance, and accident and health insurance for groups and individuals. Additionally, the company offers a small-ticket equipment financing services. It provides its services through 43 banking locations, 6 wealth management offices, and 2 insurance and risk management locations in the Montgomery, Chester, Delaware, Philadelphia, and Dauphin Counties in Pennsylvania; New Castle County in Delaware; and Mercer and Camden Counties in New Jersey. The company was founded in 1889 and is headquartered in Bryn Mawr, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 553348519, "total_enterprise": null, "number_of_employees": 658, "outstanding_shares": 19926126, "eps": 1.857759, "diluted_eps": 1.848976, "earnings_from_cont_operations": 37357000, "gross_profit": 190404000, "cash": 87042000, "total_debt": 374378000, "total_revenue": 190404000, "cash_from_operations": 105684000, "net_income": 37366000, "ebitda": null, "year_low_stock_price": 22.2, "year_high_stock_price": 41.41, "seekingalpha_follower_count": 560, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BMTC.png"}