{"symbol": "BNS", "name": "The Bank of Nova Scotia", "next_earnings_utc": 1590485400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5626898627.825329, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.6804670685229279, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 14, "analysts_sell": 1, "analysts_buy": 1, "analysts_outperform": 6, "analysts_hold": 6, "analysts_underperform": 0, "webpage": "scotiabank.com", "year_founded": 1832, "street_address": "Scotia Plaza", "city": "Toronto", "state": "ON", "zipcode": "M5H 1H1", "country": "Canada", "phone_number": "416-866-6161", "short_description": "The Bank of Nova Scotia provides various banking products and services in Canada, the United States, Mexico, Peru, Chile, Colombia, the Caribbean and Central America, and internationally.", "long_description": "The Bank of Nova Scotia provides various banking products and services in Canada, the United States, Mexico, Peru, Chile, Colombia, the Caribbean and Central America, and internationally. It operates through Canadian Banking, International Banking, Global Banking and Markets, and Global Wealth Management segments. The company offers financial advice and solutions, and day-to-day banking products, including debit and credit cards, chequing and saving accounts, investments, mortgages, loans, and insurance to individuals; and business banking solutions comprising lending, deposit, cash management, and trade finance solutions to small businesses and commercial customers, including automotive financing solutions to dealers and their customers. It is also involved in the provision of wealth management advice and solutions, including online brokerage, mobile investment, full-service brokerage, trust, private banking, and private investment counsel services; and retail mutual funds, exchange traded funds, liquid alternative funds, and institutional funds. In addition, the company offers international banking services for retail, corporate, and commercial customers; and lending and transaction, investment banking advisory, and capital markets access services to corporate customers. Further, it provides Internet, mobile, and telephone banking services. The company operates a network of 950 branches and approximately 3,650 automated banking machines in Canada; and approximately 1,900 branches and 5,500 ATMs internationally, as well as contact centers. The Bank of Nova Scotia was founded in 1832 and is headquartered in Toronto, Canada.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 44867847980, "total_enterprise": null, "number_of_employees": 101813, "outstanding_shares": 1211866493, "eps": 5.18347839883948, "diluted_eps": 5.13640539764571, "earnings_from_cont_operations": 6707013011, "gross_profit": 21386584463, "cash": 297496864470, "total_debt": 146163319582, "total_revenue": 21386584463, "cash_from_operations": 12690965139, "net_income": 6453148375, "ebitda": null, "year_low_stock_price": 31.94, "year_high_stock_price": 58.22, "stocktwits_watchlist_count": 1504, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BNS.png"}