{"symbol": "BOSC", "name": "B.O.S. Better Online Solutions Ltd.", "next_earnings_utc": 1590579000, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "boscom.com", "year_founded": 1990, "street_address": "Drive-In Center Building", "city": "Rishon LeZion", "state": null, "zipcode": "7535825", "country": "Israel", "phone_number": "972 3 954 2000", "short_description": "B.O.S. Better Online Solutions Ltd. provides radio frequency identification (RFID), mobile, and supply chain solutions worldwide.", "long_description": "B.O.S. Better Online Solutions Ltd. provides radio frequency identification (RFID), mobile, and supply chain solutions worldwide. It operates through two segments, Supply Chain Solutions; and RFID and Mobile Solutions. The Supply Chain Solutions segment offers electronic components, telecommunications equipment, and components consolidation services to aerospace, defense, medical, and telecommunications industries, as well as for enterprise customers. This segment also provides inventory and quality control management of components entering production lines; and inventory management services for ongoing projects. The RFID and Mobile Solutions segment offers hardware products, such as thermal and barcode printers; RFID and barcode scanners and readers; wireless, mobile, and forklift terminals; wireless infrastructure; active and passive RFID tags; ribbons, labels, and tags; and RFID systems for libraries. It also develops Warehouse Management System, a data collection solution for logistics management in logistic centers and warehouses; RFID systems for libraries; RFID-based systems for tracking inventory in a produce packing house; automatic systems for industrial packing lines; automatic systems to track the production line; and automatic systems to identify and track vehicles for transportation-related settings. In addition, this segment provides maintenance and repair services for data collection equipment, as well as warehouse and on-site service plans; on-site inventory count services in various fields; and asset tagging and counting services for corporate and governmental entities. The company markets its products through direct sales and sales agents, as well as through distributors. B.O.S. Better Online Solutions Ltd. was founded in 1990 and is headquartered in Rishon LeZion, Israel.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 8191987, "total_enterprise": 11397987, "number_of_employees": 98, "outstanding_shares": 4257790, "eps": -0.225265, "diluted_eps": -0.23, "earnings_from_cont_operations": -913000, "gross_profit": 6658000, "cash": 339000, "total_debt": 3545000, "total_revenue": 33817000, "cash_from_operations": -915000, "net_income": -913000, "ebitda": 906000, "year_low_stock_price": 1.02, "year_high_stock_price": 3.16, "stocktwits_watchlist_count": 1499, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BOSC.png"}