{"symbol": "BSPM", "name": "Biostar Pharmaceuticals", "next_earnings_utc": 1591648200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "biostarpharmaceuticals.com", "year_founded": 2007, "street_address": "No. 588 Shiji Xi Road", "city": "Xianyang", "state": null, "zipcode": "712000", "country": "China", "phone_number": "86 29 3368 6638", "short_description": "Biostar Pharmaceuticals, Inc. develops, manufactures, and markets over-the-counter (OTC) and prescription pharmaceutical products for various diseases and conditions in the People’s Republic of China.", "long_description": "Biostar Pharmaceuticals, Inc. develops, manufactures, and markets over-the-counter (OTC) and prescription pharmaceutical products for various diseases and conditions in the People’s Republic of China. The company principally offers Xin Ao Xing Oleanolic Acid capsule, an OTC medicine for chronic hepatitis B. It also provides 12 other OTC products and 17 prescription-based pharmaceuticals. The company’s OTC products also comprise Ganwang compound paracetamol and amantadine hydrochloride capsule for the relief of common cold, runny nose, sore throat, headache, and fever; Tianqi Dysmenorrhea capsule, a traditional Chinese medicine used for pain and other symptoms associated with menstruation; Deafness Tongqiao pills for hepatobiliary Huosheng, head swelling, deafness and tinnitus, ear pus, dry stool, and urine-yellow; Wenweishu capsules for the treatment of chronic gastritis and pain of epigastric cold; Zhitongtougu ointment for treating joint pain, swelling, tenderness, or dysfunction; and Chuzhang Zehaifu tablets for cataract. Its prescription pharmaceutical products include Danshen granules; Taohuasan pediatric medicines; Jingang tablets; Danxiang Rhinitis tablets; Yanlixiao capsules; Piracetam tablets; Huangyangning tablets; Hyperthyroidism capsules; Fosfomycin Calcium capsules; Qianlietong capsules; Yituo Erythromycin particles; Danshen tablets; Muxiang Shunqi pills; Sifangwei capsules; and Aspirin Enteric-coated tablets. The company also operates a Website that serves as Internet-based China Hepatitis Internet hospital, which offers HBV patients with information on HBV and treatment options, as well as methods to purchase HBV medicines. Biostar Pharmaceuticals, Inc. sells its products through distributors and a network of sales people in approximately 28 provinces. The company was incorporated in 2007 and is headquartered in Xianyang, the People’s Republic of China.", "industry_name": "Pharmaceuticals", "sector_name": "Health Care", "is_defunct": false, "exchange": "OTC Markets", "equity_type": "stocks", "market_cap": 192778, "total_enterprise": null, "number_of_employees": 200, "outstanding_shares": 2637188, "eps": 0.357026, "diluted_eps": 0.340432, "earnings_from_cont_operations": 934353, "gross_profit": -36747, "cash": 364973, "total_debt": null, "total_revenue": null, "cash_from_operations": 8587155, "net_income": null, "ebitda": null, "year_low_stock_price": 0.0104, "year_high_stock_price": 0.39, "seekingalpha_follower_count": 2968, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BSPM.png"}