{"symbol": "BUKS", "name": "Butler National", "next_earnings_utc": 1591869600, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "butlernational.com", "year_founded": 1960, "street_address": "19920 West 161st Street", "city": "Olathe", "state": "KS", "zipcode": "66062", "country": "United States", "phone_number": "913-780-9595", "short_description": "Butler National Corporation, together with its subsidiaries, engages in the design, engineer, manufacture, sale, integration, installation, repair, modification, overhaul, servicing, and distribution of a portfolio of aerostructures, aircraft components, avionics, accessories, subassemblies, and systems worldwide.", "long_description": "Butler National Corporation, together with its subsidiaries, engages in the design, engineer, manufacture, sale, integration, installation, repair, modification, overhaul, servicing, and distribution of a portfolio of aerostructures, aircraft components, avionics, accessories, subassemblies, and systems worldwide. The company operates in two segments, Aerospace Products and Professional Services. The Aerospace Products segment provides aircraft modifications, which include business-size aircraft from passenger to freighter configuration, radar systems, addition of aerial photography capabilities, intelligence surveillance reconaissance modifications, and stability enhancing modifications for Learjet, Beechcraft, Cessna, and Dassault Falcon aircraft along with other specialized modifications. This segment also manufactures, sells, and services electronics upgrades for classic weapon control systems that are used on military aircraft and vehicles; and sells, installs, and repairs avionics equipment, including airplane radio equipment and flight control systems, as well as troubleshoots and repairs autopilot systems. The Professional Services segment manages Boot Hill Casino and Resort, a gaming facility, as well as related dining and entertainment facilities in Dodge City, Kansas; and The Stables Casino. This segment also provides architectural services, such as commercial and industrial building design, and engineering services. The company also acquires, refurbishes, and sells airplanes, primarily Learjets. It serves the aviation industry, including owners and operators of single-engine commercial, regional, business, and military aircraft. Butler National Corporation was founded in 1960 and is headquartered in Olathe, Kansas.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "OTCQB", "equity_type": "stocks", "market_cap": 34012582, "total_enterprise": 70622582, "number_of_employees": 315, "outstanding_shares": 71008122, "eps": 0.087766, "diluted_eps": 0.081068, "earnings_from_cont_operations": 6475000, "gross_profit": 29787000, "cash": 15782000, "total_debt": 46174000, "total_revenue": 68971000, "cash_from_operations": 12460000, "net_income": 5909000, "ebitda": 17151000, "year_low_stock_price": 0.3101, "year_high_stock_price": 0.8, "seekingalpha_follower_count": 327, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BUKS.png"}