{"symbol": "BXS", "name": "BancorpSouth Bank", "next_earnings_utc": 1595277000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 250296750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.40625, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 2, "revenue_down_revisions": 6, "total_analysts": 10, "analysts_sell": 1, "analysts_buy": 3, "analysts_outperform": 0, "analysts_hold": 6, "analysts_underperform": 0, "webpage": "bancorpsouth.com", "year_founded": 1876, "street_address": "One Mississippi Plaza", "city": "Tupelo", "state": "MS", "zipcode": "38804", "country": "United States", "phone_number": "662-680-2000", "short_description": "BancorpSouth Bank provides commercial banking and financial services to individuals and small-to-medium size businesses.", "long_description": "BancorpSouth Bank provides commercial banking and financial services to individuals and small-to-medium size businesses. It offers various deposit products, including interest and noninterest bearing demand deposits, and saving and other time deposits. The company also provides commercial loans, including term loans, lines of credit, equipment and receivable financing, and agricultural loans; a range of short-to-medium term secured and unsecured commercial loans to businesses for working capital, business expansion, and the purchase of equipment and machinery; and construction loans to real estate developers for the acquisition, development, and construction of residential subdivisions. In addition, it offers fixed and adjustable rate residential mortgage loans secured by owner-occupied property; residential construction loans; second mortgage loans; and home equity lines of credit, as well as non-residential consumer loans that consist of automobile, recreation vehicle, boat, personal, and deposit account secured loans, as well as issues credit cards. Further, the company operates as an agent for the sale of commercial lines of insurance; and a line of property and casualty, life, health, and employee benefits products and services. Additionally, it provides investment brokerage, and personal trust and estate services. As of April 25, 2018, the company operated through 279 full service branch locations, as well mortgage, insurance, and loan production offices in Alabama, Arkansas, Florida, Louisiana, Mississippi, Missouri, Tennessee, Texas, and Illinois. The company was formerly known as BancorpSouth, Inc. and changed its name to BancorpSouth Bank in October 2017. BancorpSouth Bank was founded in 1876 and is headquartered in Tupelo, Mississippi.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2281688222, "total_enterprise": null, "number_of_employees": 4693, "outstanding_shares": 102640046, "eps": 1.991379, "diluted_eps": 1.982303, "earnings_from_cont_operations": 206924000, "gross_profit": 910877000, "cash": 306323000, "total_debt": 1213609000, "total_revenue": 910877000, "cash_from_operations": 268389000, "net_income": 206924000, "ebitda": null, "year_low_stock_price": 17.21, "year_high_stock_price": 32.97, "seekingalpha_follower_count": 1450, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/BXS.png"}