{"symbol": "CB", "name": "Chubb", "next_earnings_utc": 1595361900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7789571430.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.9407, "eps_up_revisions": 0, "eps_down_revisions": 19, "revenue_up_revisions": 1, "revenue_down_revisions": 6, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 6, "analysts_hold": 10, "analysts_underperform": 2, "webpage": "chubb.com", "year_founded": 1985, "street_address": "Baerengasse 32", "city": "Zurich", "state": null, "zipcode": "8001", "country": "Switzerland", "phone_number": "41 43 456 76 00", "short_description": "Chubb Limited, through its subsidiaries, provides insurance and reinsurance products worldwide.", "long_description": "Chubb Limited, through its subsidiaries, provides insurance and reinsurance products worldwide. The company's North America Commercial P&C Insurance segment offers commercial property, marine, casualty, workers' compensation, package policies, risk management, professional lines, marine, construction, environmental, medical, cyber risk, surety, and excess casualty; and group accident and health insurance to large, middle market, and small commercial businesses in the United States, Canada, and Bermuda. Its North America Personal P&C Insurance segment provides affluent and high net worth individuals and families with homeowners, automobile and collector cars, valuable articles, personal and excess liability, travel insurance, and recreational marine insurance and services in the United States and Canada. The company's North America Agricultural Insurance segment offers multiple peril crop and crop-hail insurance; and coverage for farm and ranch property, and commercial agriculture products. Its Overseas General Insurance segment provides coverage for traditional commercial property and casualty; specialty categories, such as financial lines, marine, energy, aviation, political risk, and construction risk; and group accident and health, and traditional and specialty personal lines for corporations, middle markets, and small customers through retail brokers, agents, and other channels. The company's Global Reinsurance segment offers traditional and specialty reinsurance under the Chubb Tempest Re brand name to property and casualty companies. Its Life Insurance segment provides protection and savings products comprising whole life, endowment plans, individual term life, group term life, medical and health, personal accident, credit life, universal life, and unit linked contracts. The company was formerly known as ACE Limited and changed its name to Chubb Limited in January 2016. Chubb Limited was founded in 1985 and is headquartered in Zurich, Switzerland.", "industry_name": "Insurance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 55038498187, "total_enterprise": 71957498187, "number_of_employees": 33000, "outstanding_shares": 451357210, "eps": 8.071754, "diluted_eps": 8.022542, "earnings_from_cont_operations": 3666000000, "gross_profit": 7980000000, "cash": 5098000000, "total_debt": 18431000000, "total_revenue": 33965000000, "cash_from_operations": 6732000000, "net_income": 3666000000, "ebitda": 4730000000, "year_low_stock_price": 87.35, "year_high_stock_price": 167.74, "seekingalpha_follower_count": 21355, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CB.png"}