{"symbol": "CBU", "name": "Community Bank System", "next_earnings_utc": 1595241900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 149915400.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.59571, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 2, "revenue_down_revisions": 3, "total_analysts": 7, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 6, "analysts_underperform": 0, "webpage": "cbna.com", "year_founded": 1866, "street_address": "5790 Widewaters Parkway", "city": "DeWitt", "state": "NY", "zipcode": "13214", "country": "United States", "phone_number": "315-445-2282", "short_description": "Community Bank System, Inc. operates as the bank holding company for Community Bank, N.A. that provides various banking and other financial services to retail, commercial, and municipal customers.", "long_description": "Community Bank System, Inc. operates as the bank holding company for Community Bank, N.A. that provides various banking and other financial services to retail, commercial, and municipal customers. It operates through three segments: Banking, Employee Benefit Services, and All Other. The company offers various deposits products, such as checking, savings, and money market accounts, as well as time deposits. It also provides loans comprising consumer mortgages; general purpose commercial and industrial loans, and mortgages on commercial properties; installment loans that are originated through selected dealerships and are secured by automobiles, marine, and other recreational vehicles; personal installment loans and lines of credit for consumers; and home equity products. In addition, the company offers broker-dealer and investment advisory services; and asset management services to individuals, corporations, corporate pension and profit sharing plans, and foundations, as well as operates as a full-service insurance agency that offers personal and commercial property insurance, and other risk management products and services. Further, it offers contribution plan administration services, actuarial and benefits consulting services, and collective investment fund administration and institutional trust services, as well as employee benefit trust, retirement plan administration, VEBA/HRA, and health and welfare consulting services. Additionally, the company provides wealth management, higher educational planning, fiduciary, risk management, and personal financial planning services; and investment alternatives, including stocks, bonds, mutual funds, and advisory products, as well as transfer agency and master recordkeeping services. As of December 31, 2018, it had 224 branches in Upstate New York, as well as Northeastern Pennsylvania, Vermont, and Western Massachusetts. Community Bank System, Inc. was founded in 1866 and is headquartered in DeWitt, New York.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3095481572, "total_enterprise": null, "number_of_employees": 2895, "outstanding_shares": 52094944, "eps": 3.216559, "diluted_eps": 3.189859, "earnings_from_cont_operations": 167251000, "gross_profit": 584313000, "cash": 531717000, "total_debt": 301074000, "total_revenue": 584313000, "cash_from_operations": 194587000, "net_income": 167251000, "ebitda": null, "year_low_stock_price": 47.01, "year_high_stock_price": 72.63, "seekingalpha_follower_count": 1529, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CBU.png"}