{"symbol": "CDNS", "name": "Cadence Design Systems", "next_earnings_utc": 1595275500, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 591088430.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.5197, "eps_up_revisions": 0, "eps_down_revisions": 12, "revenue_up_revisions": 0, "revenue_down_revisions": 12, "total_analysts": 16, "analysts_sell": 1, "analysts_buy": 6, "analysts_outperform": 2, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "cadence.com", "year_founded": 1988, "street_address": "2655 Seely Avenue", "city": "San Jose", "state": "CA", "zipcode": "95134", "country": "United States", "phone_number": "408 943 1234", "short_description": "Cadence Design Systems, Inc. provides software, hardware, services, and reusable integrated circuit (IC) design blocks worldwide.", "long_description": "Cadence Design Systems, Inc. provides software, hardware, services, and reusable integrated circuit (IC) design blocks worldwide. The company offers functional verification services, including emulation and prototyping hardware. Its functional verification offering consists of JasperGold, a formal verification platform; Xcelium, a parallel logic simulation platform; Palladium, an emulation platform; and Protium, a prototyping platform for chip verification. The company also provides digital IC design products; physical implementation tools, including place and route, optimization, and multiple patterning preparation; and signoff products to signoff the design as ready for manufacture by a silicon foundry. In addition, it offers custom IC design and simulation products to create schematic and physical representations of circuits down to the transistor level for analog, mixed-signal, custom digital, memory, and radio frequency designs; and system interconnect design products to develop printed circuit boards and IC packages, as well as to analyze electromagnetic, electro-thermal, and other multi-physics effects. Further, the company provides intellectual property (IP) products consisting of pre-verified and customizable functional blocks to integrate into customer's ICs; and verification IP and memory models for use in system-level verification to model correct behavior of full systems interacting with their environments. Additionally, it offers services related to methodology, education, and hosted design solutions, as well as technical support and maintenance services. Cadence Design Systems, Inc. was founded in 1988 and is headquartered in San Jose, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 25637267027, "total_enterprise": 25387187027, "number_of_employees": 8100, "outstanding_shares": 280833246, "eps": 3.630667, "diluted_eps": 3.542147, "earnings_from_cont_operations": 992412000, "gross_profit": 2107299000, "cash": 946285000, "total_debt": 696205000, "total_revenue": 2377534000, "cash_from_operations": 761905000, "net_income": 992412000, "ebitda": 639664000, "year_low_stock_price": 51.39, "year_high_stock_price": 91.58, "seekingalpha_follower_count": 9463, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CDNS.png"}