{"symbol": "CFFI", "name": "C&F Financial", "next_earnings_utc": 1595512800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "cffc.com", "year_founded": 1927, "street_address": "802 Main Street", "city": "West Point", "state": "VA", "zipcode": "23181", "country": "United States", "phone_number": "804-843-2360", "short_description": "C&F Financial Corporation operates as a bank holding company for Citizens and Farmers Bank that provides banking services to individuals and businesses.", "long_description": "C&F Financial Corporation operates as a bank holding company for Citizens and Farmers Bank that provides banking services to individuals and businesses. The company’s Retail Banking offers various banking services, including checking and savings deposit accounts, as well as business, real estate, development, mortgage, home equity, and installment loans. It also provides ATMs, Internet and mobile banking, and debit and credit cards, as well as safe deposit box rentals, notary public, electronic transfer, and other customary bank services. This segment offers its services through its main office in West Point, Virginia, as well as through 25 Virginia branches located 1 each in Cartersville, Charlottesville, Chester, Cumberland, Hampton, Mechanicsville, Newport News, Norge, Powhatan, Providence Forge, Quinton, Saluda, Sandston, West Point, and Yorktown; 2 in Williamsburg; 4 in Richmond; and 4 in Midlothian. The company’s Mortgage Banking segment provides various residential mortgage loans; originates conventional mortgage loans, mortgage loans insured by the Federal Housing Administration, and mortgage loans guaranteed by the United States Department of Agriculture and the Veterans Administration; and ancillary mortgage loan origination services for residential appraisals, as well as various mortgage origination functions to third parties. It provides mortgage loan origination services through 11 offices in Virginia, 2 offices in Maryland, and 2 offices in North Carolina, as well as through 1 each in South Carolina and West Virginia. The company’s Consumer Finance segment provides automobile loans through its offices in Richmond and Hampton, Virginia; and Nashville, Tennessee. Its Other segment offers brokerage and wealth management services; and insurance products. The company also provides title and settlement agency, and insurance services. C&F Financial Corporation was founded in 1927 and is headquartered in West Point, Virginia.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 131462134, "total_enterprise": null, "number_of_employees": 643, "outstanding_shares": 3647673, "eps": 5.347273, "diluted_eps": 5.347273, "earnings_from_cont_operations": 18718000, "gross_profit": 106578000, "cash": 160059000, "total_debt": 171269000, "total_revenue": 106578000, "cash_from_operations": -51109000, "net_income": 18666000, "ebitda": null, "year_low_stock_price": 28.0, "year_high_stock_price": 57.61, "seekingalpha_follower_count": 322, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CFFI.png"}