{"symbol": "CFG", "name": "Citizens Financial Group", "next_earnings_utc": 1594982100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1675111960.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.15441, "eps_up_revisions": 0, "eps_down_revisions": 13, "revenue_up_revisions": 10, "revenue_down_revisions": 1, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 8, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "citizensbank.com", "year_founded": 1828, "street_address": "One Citizens Plaza", "city": "Providence", "state": "RI", "zipcode": "02903", "country": "United States", "phone_number": "401-456-7000", "short_description": "Citizens Financial Group, Inc. operates as the bank holding company for Citizens Bank, National Association that provides retail and commercial banking products and services in the United States.", "long_description": "Citizens Financial Group, Inc. operates as the bank holding company for Citizens Bank, National Association that provides retail and commercial banking products and services in the United States. The company operates in two segments, Consumer Banking and Commercial Banking. The Consumer Banking segment offers traditional banking products and services, including checking and savings accounts, home and education loans, credit cards, business loans, mortgage and home equity lending, and unsecured product finance and personal loans, as well as wealth management and investment services to retail customers and small businesses. This segment also provides indirect auto finance for new and used vehicles through auto dealerships. The Commercial Banking segment offers various financial products and solutions, such as loans and leasing, trade finance, deposit and treasury management, cash management, and foreign exchange and interest rate risk management solutions; and loan syndications, corporate finance, merger and acquisition, and debt and equity capital markets capabilities. It serves government banking, not-for-profit, healthcare, technology, professionals, oil and gas, asset finance, franchise finance, asset-based lending, commercial real estate, private equity, and sponsor finance industries. Citizens Financial Group, Inc. operates approximately 2,700 ATMs and 1,100 branches in 11 states in the New England, Mid-Atlantic, and Midwest regions, as well as through online, telephone, and mobile banking services; and maintains approximately 135 retail and commercial non-branch offices. The company was formerly known as RBS Citizens Financial Group, Inc. and changed its name to Citizens Financial Group, Inc. in April 2014. Citizens Financial Group, Inc. was founded in 1828 and is headquartered in Providence, Rhode Island.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 10281519273, "total_enterprise": null, "number_of_employees": 18000, "outstanding_shares": 426619057, "eps": 2.958212, "diluted_eps": 2.949641, "earnings_from_cont_operations": 1386000000, "gross_profit": 5652000000, "cash": 6306000000, "total_debt": 17730000000, "total_revenue": 5652000000, "cash_from_operations": -102000000, "net_income": 1386000000, "ebitda": null, "year_low_stock_price": 14.12, "year_high_stock_price": 41.29, "seekingalpha_follower_count": 7252, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CFG.png"}