{"symbol": "CIDM", "name": "Cinedigm", "next_earnings_utc": 1591734600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "cinedigm.com", "year_founded": 2000, "street_address": "45 West 36th Street", "city": "New York", "state": "NY", "zipcode": "10018", "country": "United States", "phone_number": "212-206-8600", "short_description": "Cinedigm Corp., together with its subsidiaries, operates as distributor and aggregator of independent movie, television, and other short form content primarily in the United States.", "long_description": "Cinedigm Corp., together with its subsidiaries, operates as distributor and aggregator of independent movie, television, and other short form content primarily in the United States. The company operates through two segments, Cinema Equipment Business and Content and Entertainment Business. It manages a library of distribution rights to various titles and episodes released across digital, physical, and home and mobile entertainment platforms, as well as services digital cinema assets on approximately 12,000 domestic and foreign movie screens. The company distributes its products for various brands, such as Hallmark, Televisa, ZDF, Shout! Factory, NFL, NHL, and Scholastic, as well as international and domestic content creators, movie producers, television producers, and other short form digital content producers. It also collaborates with producers, various brands, and other content owners to market, source, curate, and distribute content to targeted audiences through existing and emerging digital home entertainment platforms, including Apple, Amazon Prime, Netflix, Hulu, Xbox, PlayStation, Walmart Now, and cable/satellite video-on-demand; and distributes DVD and Blu-ray discs to wholesalers and retailers with sales coverage to approximately 60,000 brick and mortar storefronts, including Walmart, Target, Best Buy, and Amazon. In addition, the company operates various branded and curated over-the-top entertainment channels, including Docurama, CONtv, and Dove Channel. Cinedigm Corp. has a strategic alliance with Starrise Media Holdings Limited to release films in China theatrically and to digital platforms, as well as to evaluate opportunities to jointly produce Chinese/American film co-productions. The company was formerly known as Cinedigm Digital Cinema Corp. and changed its name to Cinedigm Corp. in September 2013. Cinedigm Corp. was founded in 2000 and is based in New York, New York. Cinedigm Corp. operates as a subsidiary of Bison Capital Holding Company Limited", "industry_name": "Entertainment", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 87317159, "total_enterprise": 126881159, "number_of_employees": 101, "outstanding_shares": 102726070, "eps": -0.420649, "diluted_eps": -0.420649, "earnings_from_cont_operations": -16512000, "gross_profit": 26367000, "cash": 14474000, "total_debt": 51758000, "total_revenue": 43625000, "cash_from_operations": 10073000, "net_income": -16526000, "ebitda": 3631000, "year_low_stock_price": 0.25, "year_high_stock_price": 2.63, "seekingalpha_follower_count": 1752, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CIDM.png"}