{"symbol": "CIEN", "name": "Ciena Corporation", "next_earnings_utc": 1591273800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 890182430.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.5185, "eps_up_revisions": 2, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 13, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 9, "analysts_outperform": 7, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "ciena.com", "year_founded": 1992, "street_address": "7035 Ridge Road", "city": "Hanover", "state": "MD", "zipcode": "21076", "country": "United States", "phone_number": "410-694-5700", "short_description": "Ciena Corporation provides network hardware, software, and services that support the transport, switching, aggregation, service delivery, and management of video, data, and voice traffic on communications networks worldwide.", "long_description": "Ciena Corporation provides network hardware, software, and services that support the transport, switching, aggregation, service delivery, and management of video, data, and voice traffic on communications networks worldwide. The company's Networking Platforms segment offers hardware networking solutions optimized for the convergence of coherent optical transport, optical transport network switching, and packet switching. Its products include 6500 Packet-Optical Platform, 5430 Reconfigurable Switching System, Waveserver stackable interconnect system, CoreDirector Multiservice Optical Switches, and OTN configuration for the 5410 Reconfigurable Switching System, as well as Z-Series Packet-Optical Platform; 3000 family of service delivery switches and service aggregation switches, and the 5000 family of service aggregation switches, as well as 8700 Packetwave Platform and the Ethernet packet configuration for the 5410 Service Aggregation Switch; and 6500 Packet Transport System. This segment also sells operating system software and enhanced software features embedded in each of its products. The company's Blue Planet Automation Software and Services segment provides multi-domain service orchestration, inventory, route optimization and analysis, network function virtualization orchestration, analytics, and related services. Its Platform Software and Service segment offers OneControl unified management system and platform software services, as well as manage, control, and plan software. The company's Global Services segment provides consulting and network design, installation and deployment, maintenance support, and training services. The company sells its products through direct and indirect sales channels to network operators. Ciena Corporation has collaboration with Infoblox Inc. The company was founded in 1992 and is headquartered in Hanover, Maryland.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 8482600923, "total_enterprise": 8384045923, "number_of_employees": 6383, "outstanding_shares": 153503455, "eps": 1.817658, "diluted_eps": 1.801455, "earnings_from_cont_operations": 282146000, "gross_profit": 1589260000, "cash": 947353000, "total_debt": 848798000, "total_revenue": 3626516000, "cash_from_operations": 467009000, "net_income": 282146000, "ebitda": 534819000, "year_low_stock_price": 30.58, "year_high_stock_price": 56.76, "seekingalpha_follower_count": 17682, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CIEN.png"}