{"symbol": "CIHKY", "name": "China Merchants Bank Co.", "next_earnings_utc": 1592575200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 10353217505.58178, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "cmbchina.com", "year_founded": 1987, "street_address": "China Merchants Bank Tower", "city": "Shenzhen", "state": null, "zipcode": "518040", "country": "China", "phone_number": "86 755 8319 8888", "short_description": "China Merchants Bank Co., Ltd. provides various banking products and services.", "long_description": "China Merchants Bank Co., Ltd. provides various banking products and services. It operates in Wholesale Finance Business, Retail Finance Business, and Other Business segments. The company accepts demand, time, call, savings, checking, notice, and RMB accounts. Its loan products include personal commercial real estate, consumption, housing, and car loans; loans to finance for studying abroad; micro-business loans; mortgage loans for equipment; bank acceptance, discount, liquid capital, and fixed asset loans; and loans for vessels. The company also offers credit cards; insurance products; open-ended funds; discount and guarantee for commercial bills, redemption of commercial bills, and guaranteed discount for commercial acceptance bills; and financial consultation, debt financing underwriting, merger and acquisition financing, and equity financing and enterprise listing services. In addition, it provides forfeiting and risk participation, escrow, cross border RMB clearing, and interbank services; and risk and financial management, cross border RMB and oversea financing, international factoring and settlement, and trade finance services. Further, the company offers financial leasing and guarantee, third-party payment, cash management, investment and wealth management, forex option and gold trading, forex express trading, settlement, trade chain financing, international, offshore and private banking, custody, pension, and internet banking services. It operates 141 branches; 1,681 sub-branches; one branch-level operation center; one representative office; 16,750 visual counters in Mainland China. The company also operates a branch in Hong Kong; a branch and representative office in New York, the United States; a branch in London, the United Kingdom; a branch in Singapore; a branch in Luxembourg; a representative office in Taipei; and a branch in Sydney, Australia. The company was founded in 1987 and is headquartered in Shenzhen, China.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 119260288928, "total_enterprise": null, "number_of_employees": 84683, "outstanding_shares": 3533226000, "eps": 0.524719802329686, "diluted_eps": 0.524719802329686, "earnings_from_cont_operations": 13537592658, "gross_profit": 30068196258, "cash": 263719166961, "total_debt": 174207412637, "total_revenue": 30068196258, "cash_from_operations": 37303353336, "net_income": 13472926227, "ebitda": null, "year_low_stock_price": 19.38, "year_high_stock_price": 27.49, "seekingalpha_follower_count": 214, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CIHKY.png"}