{"symbol": "CMCO", "name": "Columbus McKinnon Corporation", "next_earnings_utc": 1590575400, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 186595000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.465, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 6, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 2, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "cmworks.com", "year_founded": 1875, "street_address": "205 Crosspoint Parkway", "city": "Getzville", "state": "NY", "zipcode": "14068", "country": "United States", "phone_number": "716-689-5400", "short_description": "Columbus McKinnon Corporation designs, manufactures, and markets hoists, actuators, rigging tools, digital power control systems, motion control products, and other technologies and systems for commercial and industrial applications worldwide.", "long_description": "Columbus McKinnon Corporation designs, manufactures, and markets hoists, actuators, rigging tools, digital power control systems, motion control products, and other technologies and systems for commercial and industrial applications worldwide. It offers various electric chain hoists, electric wire rope hoists, hand-operated hoists, winches, lever tools, and air-powered hoists under the Budgit, Chester, CM, Coffing, Little Mule, Pfaff, Shaw-Box, Yale, STAHL, and other brands; below-the-hook tooling, clamps, and textile strappings; and explosion-protected hoists, as well as supplies hoist trolleys. The company also provides alloy and carbon steel chains; alloy chains under the Herc-Alloy brand; load chains and carbon steel welded-link chains; alloy and carbon steel closed-die forged chain attachments, including hooks, shackles, Hammerloks, and master links; and carbon steel forged and stamped products, such as load binders, logging tools, and other securing devices. In addition, it offers power and motion control systems, which comprise AC and DC drive systems, radio remote controls, push button pendant stations, brakes, collision avoidance, and power delivery subsystems, as well as AC and DC digital motion control systems for underground coal mining equipment; industrial components, including mechanical and electromechanical actuators and rotary unions; and DC high-performance elevator drives, AC drives, and regenerative controls. Further, the company offers automated workstation crane under the ProPath brand. The company sells its products through its sales force and independent distributors. Columbus McKinnon Corporation was founded in 1875 and is headquartered in Getzville, New York.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 619043059, "total_enterprise": 838113059, "number_of_employees": 3128, "outstanding_shares": 23699964, "eps": 2.982361, "diluted_eps": 2.938272, "earnings_from_cont_operations": 70169000, "gross_profit": 296075000, "cash": 84014000, "total_debt": 303084000, "total_revenue": 836409000, "cash_from_operations": 95955000, "net_income": 70169000, "ebitda": 130397000, "year_low_stock_price": 19.2, "year_high_stock_price": 43.09, "stocktwits_watchlist_count": 62, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CMCO.png"}