{"symbol": "CMTL", "name": "Comtech Telecommunications Corp.", "next_earnings_utc": 1591216200, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 146050000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.38, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "comtechtel.com", "year_founded": 1967, "street_address": "68 South Service Road", "city": "Melville", "state": "NY", "zipcode": "11747", "country": "United States", "phone_number": "631-962-7000", "short_description": "Comtech Telecommunications Corp. designs, develops, produces, and markets products, systems, and services for communications solutions in the United States and internationally.", "long_description": "Comtech Telecommunications Corp. designs, develops, produces, and markets products, systems, and services for communications solutions in the United States and internationally. It operates through Commercial Solutions and Government Solutions segments. The Commercial Solutions segment offers satellite ground station technologies, including modems, amplifiers, converters, and network software to modulate, demodulate, and amplify signals, as well as to carry voice, video, and/or data over networks; and public safety and location technologies that enable 911 call routing via cellular and over the Internet. The Government Solutions segment offers mission-critical technologies tactical satellite-based networks, such as satellite modems, ruggedized routers, and solid-state drives; very small aperture terminals; and sustainment services for the secret Internet protocol router and non-classified Internet protocol router access point. This segment also offers high-performance transmission technologies that are used in communication systems comprising electronic warfare, radar, and identification friend or foe (IFF); troposcatter technologies for satellite communication; and high-power amplifiers and related switching technologies used in electronic warfare, communications, radar, IFF, and medical applications consisting of oncology cancer treatment systems. The company serves satellite systems integrators, wireless and other communication service providers, broadcasters, prime contractors and system suppliers, Medical equipment companies, aviation industry system integrators, oil companies, and domestic and international defense and government customers. Comtech Telecommunications Corp. was founded in 1967 and is headquartered in Melville, New York.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 440253297, "total_enterprise": 587936297, "number_of_employees": 2013, "outstanding_shares": 24719444, "eps": 0.967689, "diluted_eps": 0.958021, "earnings_from_cont_operations": 23630000, "gross_profit": 252595000, "cash": 46471000, "total_debt": 194154000, "total_revenue": 678741000, "cash_from_operations": 86260000, "net_income": 23630000, "ebitda": 76463000, "year_low_stock_price": 11.48, "year_high_stock_price": 38.0, "seekingalpha_follower_count": 2401, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CMTL.png"}