{"symbol": "CNPOF", "name": "Canopy Rivers Inc.", "next_earnings_utc": 1590746400, "next_earnings_period_start_date_utc": 1569801600, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2859323.404287474, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "canopyrivers.com", "year_founded": null, "street_address": "40 King Street West", "city": "Toronto", "state": "ON", "zipcode": "M5H 3Y2", "country": "Canada", "phone_number": "855-227-8639", "short_description": "Canopy Rivers Inc. is a venture capital firm.", "long_description": "Canopy Rivers Inc. is a venture capital firm. The firm is a stage agnostic, with seed to sale, although it prefers to invest in series A to C rounds. It prefers to make investments in cannabis sector with focus on burgeoning marijuana companies and sectors like agriculture and food sciences, production, processing, pharmaceuticals and biotechnology, software and data, hardware, consumer products and accessories, wellness products, retail and distribution, and media and content. The firm also focuses on beverages, capsules and concentrates, edibles, dry flower / pre-rolls, vaporizers and hardware, pet products, and topicals. In agriculture and food sciences firm focuses in invest plant science, soil science, food science, animal science and environmental science. In production firm focuses in Indoor cultivation, greenhouse cultivation, outdoor cultivation, nursery cultivation and fermentation. In processing firm focuses in harvesting, extraction and purification, packaging, food and beverage processing and laboratory testing services. In pharmaceuticals and biotechnology firm focuses in pharmaceutical discovery and development, delivery method (ex: pill, soft gel, tincture), biosynthetic derived cannabinoids and other molecules, medical devices (ex: inhalers) and lab equipment. In consumer products and accessories firm focuses in edibles, beverages, inhalable, cosmetics and cannabis consumption accessories. In retail and distribution firm focuses in licensed brick and mortar retailers, pharmacies, online consumer marketplaces, delivery services, and others. The firm invests in opportunities globally. The firm prefers to invest in check sizes have ranged from CA$1 million ($0.71 million) to $40 million ($28.45 million), but more typical investment range is between CA$5 million ($3.6 million) to CA$10 million ($7.1 million). The firm is focused on making minority stake investments. Firm employ diverse investment structures including debt, preferred and common equity, and production-linked royalties. Canopy Rivers Inc. is based in Toronto, Canada.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 126787924, "total_enterprise": 91689949, "number_of_employees": 15, "outstanding_shares": 155676025, "eps": -0.0495675746443946, "diluted_eps": -0.0517739836271361, "earnings_from_cont_operations": -9146778, "gross_profit": 8864142, "cash": 38258285, "total_debt": 572203, "total_revenue": 8864142, "cash_from_operations": -4836387, "net_income": -9146778, "ebitda": null, "year_low_stock_price": 0.3715, "year_high_stock_price": 3.53, "stocktwits_watchlist_count": -1, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CNPOF.png"}