{"symbol": "CPAH", "name": "CounterPath", "next_earnings_utc": 1594326600, "next_earnings_period_start_date_utc": 1588204800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "counterpath.com", "year_founded": 2002, "street_address": "One Bentall Centre", "city": "Vancouver", "state": "BC", "zipcode": "V7X 1M3", "country": "Canada", "phone_number": "604-320-3344", "short_description": "CounterPath Corporation designs, develops, and sells software and services that enable enterprises and telecommunication service providers to deliver unified communications services over Internet protocol based networks in North America and internationally.", "long_description": "CounterPath Corporation designs, develops, and sells software and services that enable enterprises and telecommunication service providers to deliver unified communications services over Internet protocol based networks in North America and internationally. Its products include Bria softphone suite, which enables consumers and business users to make voice over Internet protocol (VoIP) audio and video calls, send instant messages, manage their presence, share their screen, and collaborate with other users using desktop computers and laptops, smartphones, and tablets; and X-Lite, a standards-based VoIP softphone application that runs on desktop computers. The company also offers software development kits that deliver voice, video, and messaging capabilities for desktop, tablet, and mobile devices; Stretto Platform, a carrier-grade software platform for enterprises and service providers; Bria Teams, which delivers centralized provisioning, messaging, and screen sharing from the cloud; and Brio Stretto for enterprises, operators, and telecommunication channel partners to leverage the Stretto Platform to procure, distribute, provide, and manage Bria Stretto clients from the cloud, as well as to offer hosted messaging and collaboration solutions. In addition, it provides subscription, support, and maintenance services; and professional and other services, such as product configuration and customization, implementation, engineering, and training. The company sells its products and services through its own and third-party online stores; and directly using its in-house sales team, as well as through its channel partners. It serves small, medium, and large sized businesses; telecommunications service providers and Internet telephony service providers; original equipment manufacturers, value added distributors, and value added resellers serving the telecommunication market; and end users. CounterPath Corporation was founded in 2002 and is headquartered in Vancouver, Canada.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 20714872, "total_enterprise": 24262379, "number_of_employees": 91, "outstanding_shares": 6102927, "eps": -0.481595, "diluted_eps": -0.481595, "earnings_from_cont_operations": -2876102, "gross_profit": 8785666, "cash": 1764846, "total_debt": 5384404, "total_revenue": 10907513, "cash_from_operations": -1918379, "net_income": -2876102, "ebitda": -2588599, "year_low_stock_price": 0.83, "year_high_stock_price": 6.0, "seekingalpha_follower_count": 1281, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CPAH.png"}