{"symbol": "CPF", "name": "Central Pacific Financial", "next_earnings_utc": 1595413800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 65800000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.31, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 2, "revenue_down_revisions": 0, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "cpb.bank", "year_founded": 1954, "street_address": "220 South King Street", "city": "Honolulu", "state": "HI", "zipcode": "96813", "country": "United States", "phone_number": "808-544-0500", "short_description": "Central Pacific Financial Corp. operates as the holding company for Central Pacific Bank that provides commercial banking products and services to businesses, professionals, and individuals in the United States.", "long_description": "Central Pacific Financial Corp. operates as the holding company for Central Pacific Bank that provides commercial banking products and services to businesses, professionals, and individuals in the United States. The company operates in three segments: Banking Operations, Treasury, and All Others. It offers various deposit products and services, including personal and business checking and savings accounts, money market accounts, and time certificates of deposit. The company's lending activities comprise commercial loans, financial and agricultural loans, commercial mortgages, construction loans, and leases to small and medium-sized companies, business professionals, and real estate investors and developers, as well as residential mortgages, home equity, and consumer loans to local homebuyers and individuals. Central Pacific Financial Corp. also provides debit cards, internet and mobile banking, cash management services, traveler's checks, safe deposit boxes, international banking services, night depository facilities, foreign exchange and wire transfers, trust services, retail brokerage, and wholesale funding services. In addition, the company offers wealth management products and services, including non-deposit investment products, annuities, insurance, investment management, asset custody, and general consultation and planning services. As of December 31, 2019, it operated 35 branches and 77 automated teller machines in the state of Hawaii. The company was founded in 1954 and is headquartered in Honolulu, Hawaii.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 452938336, "total_enterprise": null, "number_of_employees": 822, "outstanding_shares": 28115353, "eps": 1.785993, "diluted_eps": 1.770994, "earnings_from_cont_operations": 50611000, "gross_profit": 210761000, "cash": 93108000, "total_debt": 375125000, "total_revenue": 210761000, "cash_from_operations": 77554000, "net_income": 50611000, "ebitda": null, "year_low_stock_price": 12.4, "year_high_stock_price": 30.56, "seekingalpha_follower_count": 877, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CPF.png"}