{"symbol": "CPRI", "name": "Capri Holdings", "next_earnings_utc": 1592389800, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1172219980.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.29396, "eps_up_revisions": 0, "eps_down_revisions": 20, "revenue_up_revisions": 0, "revenue_down_revisions": 19, "total_analysts": 28, "analysts_sell": 1, "analysts_buy": 7, "analysts_outperform": 1, "analysts_hold": 19, "analysts_underperform": 0, "webpage": "capriholdings.com", "year_founded": 1981, "street_address": "33 Kingsway", "city": "London", "state": null, "zipcode": "WC2B 6UF", "country": "United Kingdom", "phone_number": "44 20 7632 8600", "short_description": "Capri Holdings Limited designs, markets, distributes, and retails branded women’s and men’s apparel and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia.", "long_description": "Capri Holdings Limited designs, markets, distributes, and retails branded women’s and men’s apparel and accessories in the United States, Canada, Latin America, Europe, the Middle East, Africa, and Asia. The company’s Versace segment offers ready-to-wear, accessories, footwear, and home furnishings through a distribution network, including boutiques; and department and specialty stores, as well as through Versace e-commerce sites in the United States, Europe, and China. It also licenses Versace brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of jeans, fragrances, watches, and eyewear. As of March 30, 2019, this segment operated 188 retail stores, including concessions; and 1,028 wholesale doors. Its Jimmy Choo segment sells luxury footwear, handbags, and small leather goods through directly operated Jimmy Choo stores; and Jimmy Choo e-commerce sites. It also licenses Jimmy Choo brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of fragrances, sunglasses, and eyewear. This segment operated 208 retail stores, including concessions; and 596 wholesale doors. The company’s Michael Kors segment offers accessories, footwear and apparel through retail stores, department stores, specialty stores, and select licensing partners, as well as through Michael Kors e-commerce sites. It also licenses Michael Kors brand name and trademarks to third parties to retail and/or wholesale its products; and has licensing agreements to the manufacture and sale of watches, jewelry, fragrances, and beauty and eyewear. This segment operated 853 retail stores, including concessions; and 3,202 wholesale doors. The company was formerly known as Michael Kors Holdings Limited and changed its name to Capri Holdings Limited in December 2018. The company was founded in 1981 and is based in London, the United Kingdom.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2672146952, "total_enterprise": 6710146952, "number_of_employees": 14447, "outstanding_shares": 149365397, "eps": 2.296948, "diluted_eps": 2.273981, "earnings_from_cont_operations": 346000000, "gross_profit": 3433000000, "cash": 237000000, "total_debt": 4273000000, "total_revenue": 5703000000, "cash_from_operations": 670000000, "net_income": 347000000, "ebitda": 973000000, "year_low_stock_price": 5.42, "year_high_stock_price": 39.9, "seekingalpha_follower_count": 38316, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CPRI.png"}