{"symbol": "CS", "name": "Credit Suisse Group AG", "next_earnings_utc": 1595498400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5414131520.675627, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "credit-suisse.com", "year_founded": 1856, "street_address": "Paradeplatz 8", "city": "Zurich", "state": null, "zipcode": "8001", "country": "Switzerland", "phone_number": "41 44 333 11 11", "short_description": "Credit Suisse Group AG, through its subsidiaries, provides various financial services in Switzerland, Europe, the Middle East, Africa, the Americas, and Asia Pacific.", "long_description": "Credit Suisse Group AG, through its subsidiaries, provides various financial services in Switzerland, Europe, the Middle East, Africa, the Americas, and Asia Pacific. It operates through Swiss Universal Bank, International Wealth Management, Asia Pacific, Global Markets, and Investment Banking & Capital Markets segments. The company offers private banking and wealth management solutions, including advisory, investment, financial planning, succession planning, and trust services; and financing and lending, and multi-shore platform solutions. It also provides traditional and structured lending, payment, foreign exchange, capital goods leasing, merger and acquisition, syndication, structured finance, commodity trade finance, trade finance, structured trade finance, export finance, factoring, fund management and administration, fund design, custody, ship and aviation finance, securities, cash, and treasury services. In addition, the company offers asset management products; equity and debt underwriting, and advisory services; cash equities, equity derivatives, and convertibles, as well as prime services; and fixed income products, such as credit, securitized, macro, emerging markets, financing, structured credit, and other products. Further, it provides HOLT, a framework for assessing the performance of approximately 20,000 companies; and equity and fixed income research services. The company serves private and institutional clients; ultra-high-net-worth individuals, high-net-worth individuals, and affluent and retail clients; corporate clients, small and medium-sized enterprises, external asset managers, financial institutions, and commodity traders; and pension funds, governments, foundations and endowments, corporations, entrepreneurs, private individuals, financial sponsors, and sovereign clients. As of December 31, 2019, it operated through a network of 344 offices and branches. The company was founded in 1856 and is based in Zurich, Switzerland.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 21868830649, "total_enterprise": null, "number_of_employees": 47860, "outstanding_shares": 2399011720, "eps": 1.65761861219061, "diluted_eps": 1.60879382364555, "earnings_from_cont_operations": 4142854174, "gross_profit": 22924416551, "cash": 381508343897, "total_debt": 251464078638, "total_revenue": 22924416551, "cash_from_operations": -20672707247, "net_income": 4139736902, "ebitda": null, "year_low_stock_price": 6.47, "year_high_stock_price": 14.12, "seekingalpha_follower_count": 20473, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CS.png"}