{"symbol": "CSFL", "name": "CenterState Bank", "next_earnings_utc": 1595538000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 201685500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.3075, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 3, "revenue_down_revisions": 1, "total_analysts": 7, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 2, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "centerstatebank.com", "year_founded": 1989, "street_address": "1101 First Street South", "city": "Winter Haven", "state": "FL", "zipcode": "33880", "country": "United States", "phone_number": "863-293-4710", "short_description": "CenterState Bank Corporation operates as the holding company for CenterState Bank, N.A. that provides various consumer and commercial banking services to individuals, businesses, and industries.", "long_description": "CenterState Bank Corporation operates as the holding company for CenterState Bank, N.A. that provides various consumer and commercial banking services to individuals, businesses, and industries. The company accepts various deposit products, such as savings, demand, negotiable order of withdrawal, and money market deposit accounts, as well as certificates of deposit and time deposits. Its loan products include real estate loans to individuals and businesses for the purchase, improvement of, or investment in real estate; construction of single-family residential and commercial units; and development of single-family residential building lots. The company's loan products also comprise commercial loans to small-to-medium sized businesses for working capital, equipment purchases, and various other business purposes; and consumer loans consisting of loans to individuals for various consumer purposes, as well as business purpose loans. It also offers mutual funds, annuities, and other investment products. In addition, the company sells fixed income securities; and provides hedging, loan brokerage, correspondent bank deposits, safe-keeping, bond accounting, asset/liability consulting, international wires, clearing and corporate checking accounts, and other correspondent banking related services. As of December 31, 2019, it operated 149 full service banking offices in 47 counties throughout Florida, Georgia, and Alabama; 1 loan production office in Florida; and 1 loan production office in Georgia. The company was formerly known as CenterState Banks, Inc. and changed its name to CenterState Bank Corporation in September 2017. CenterState Bank Corporation was founded in 1989 and is headquartered in Winter Haven, Florida.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1961291935, "total_enterprise": null, "number_of_employees": 2756, "outstanding_shares": 124132401, "eps": 1.701516, "diluted_eps": 1.691789, "earnings_from_cont_operations": 217387000, "gross_profit": 761386000, "cash": 1436913000, "total_debt": 1497144000, "total_revenue": 761386000, "cash_from_operations": 128919000, "net_income": 216185000, "ebitda": null, "year_low_stock_price": 12.1, "year_high_stock_price": 26.79, "seekingalpha_follower_count": 903, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CSFL.png"}