{"symbol": "CSL", "name": "Carlisle Companies Incorporated", "next_earnings_utc": 1595361600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 991966710.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.08225, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 1, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "carlisle.com", "year_founded": 1917, "street_address": "16430 North Scottsdale Road", "city": "Scottsdale", "state": "AZ", "zipcode": "85254", "country": "United States", "phone_number": "480 781 5000", "short_description": "Carlisle Companies Incorporated operates as a diversified manufacturer of engineered products in the United States, Europe, Asia, Canada, Mexico, the Middle East, Africa, and internationally.", "long_description": "Carlisle Companies Incorporated operates as a diversified manufacturer of engineered products in the United States, Europe, Asia, Canada, Mexico, the Middle East, Africa, and internationally. The company's Carlisle Construction Materials segment offers thermoplastic polyolefin, ethylene propylene diene monomer rubber, and polyvinyl chloride roofing membranes that are used on non-residential low-sloped roofs; roofing accessories, such as flashings, fasteners, sealing tapes, coatings, and waterproofing products; rigid foam insulation panels for roofing applications; specialty polyurethane products; vapor and air barriers, HVAC duct sealants, and hardware; and block molded polystyrene. Its Carlisle Interconnect Technologies segment engineers, manufactures, and sells wires, cables, connectors, contacts and cable assemblies, and satellite communication equipment to transfer power and data for the aerospace, medical, defense electronics, test and measurement equipment, and other industrial markets; and thermoforming, medical device contract manufacturing, precision machining and metals, and medical injection molding to medical device markets. The company's Carlisle Fluid Technologies segment offers liquid and powder finishing equipment and system components in the automotive, automotive refinishing, aerospace, agriculture, construction, marine, and rail industries. Its Carlisle Brake & Friction segment provides braking products and systems, and clutch transmission friction products for off-highway, on-highway, aircraft, and other industrial applications; and motorsport braking products. The company sells its product under the Binks, DeVilbiss, Ransburg, BGK, MS Powder, Hawk, Wellman, and Velvetouch brand names. It also distributes architectural metal roof panels, steel and aluminum flat sheets and coils, wall panels, perimeter roof edge systems, and related accessories. Carlisle Companies Incorporated was founded in 1917 and is headquartered in Scottsdale, Arizona.", "industry_name": "Industrial Conglomerates", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 6561122376, "total_enterprise": 7950722376, "number_of_employees": 13000, "outstanding_shares": 54739883, "eps": 8.037105, "diluted_eps": 7.939907, "earnings_from_cont_operations": 458100000, "gross_profit": 1368000000, "cash": 1187700000, "total_debt": 2577300000, "total_revenue": 4769900000, "cash_from_operations": 646500000, "net_income": 455200000, "ebitda": 864200000, "year_low_stock_price": 97.55, "year_high_stock_price": 169.86, "seekingalpha_follower_count": 4099, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CSL.png"}