{"symbol": "CVGW", "name": "Calavo Growers", "next_earnings_utc": 1591658700, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 315800000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.5, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 2, "revenue_down_revisions": 0, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "calavo.com", "year_founded": 1924, "street_address": "1141-A Cummings Road", "city": "Santa Paula", "state": "CA", "zipcode": "93060", "country": "United States", "phone_number": "805-525-1245", "short_description": "Calavo Growers, Inc. markets and distributes avocados, prepared avocados, and other perishable foods to retail grocery and foodservice customers, club stores, mass merchandisers, food distributors, and wholesale customers worldwide.", "long_description": "Calavo Growers, Inc. markets and distributes avocados, prepared avocados, and other perishable foods to retail grocery and foodservice customers, club stores, mass merchandisers, food distributors, and wholesale customers worldwide. It operates in three segments: Fresh Products, Calavo Foods, and Renaissance Food Group (RFG). The Fresh products segment distributes avocados and other fresh produce products; and procures avocados grown in California, Mexico, and Peru, as well as various other commodities, including tomatoes and papayas. The Calavo Foods segment is involved in purchasing, manufacturing, and distributing prepared avocado products, including guacamole and salsa. The RFG segment manufactures and distributes fresh-cut fruits and vegetables, fresh prepared entree salads, wraps, sandwiches, and fresh snacking products, as well as ready-to-heat entrees, other hot bar and various deli items, meals kits and related components, and salad kits. The company offers its products under the Calavo and RFG brands, and related logos; and Avo Fresco, Bueno, Calavo Gold, Calavo Salsa Lisa, Salsa Lisa, Celebrate the Taste, El Dorado, Fresh Ripe, Select, Taste of Paradise, The First Name in Avocados, Tico, Mfresh, Maui Fresh International, Triggered Avocados, ProRipeVIP, RIPE NOW!, Garden Highway Fresh Cut, Garden Highway, and Garden Highway Chef Essentials trademarks. Calavo Growers, Inc. was founded in 1924 and is headquartered in Santa Paula, California.", "industry_name": "Food Products", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1052450421, "total_enterprise": 1150924421, "number_of_employees": 3657, "outstanding_shares": 17614233, "eps": 1.781207, "diluted_eps": 1.771232, "earnings_from_cont_operations": 31104000, "gross_profit": 113053000, "cash": 4937000, "total_debt": 101786000, "total_revenue": 1211093000, "cash_from_operations": 55207000, "net_income": 31221000, "ebitda": 66026000, "year_low_stock_price": 48.31, "year_high_stock_price": 100.58, "seekingalpha_follower_count": 2724, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CVGW.png"}