{"symbol": "CWYCY", "name": "China Railway Construction", "next_earnings_utc": 1593180000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 31572094713.34914, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 1, "revenue_down_revisions": 0, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "crcc.cn", "year_founded": 2007, "street_address": "East, No.40 Fuxing Road", "city": "Beijing", "state": null, "zipcode": "100855", "country": "China", "phone_number": "86 10 5268 8600", "short_description": "China Railway Construction Corporation Limited, together with its subsidiaries, operates as an integrated construction company in Mainland China and internationally.", "long_description": "China Railway Construction Corporation Limited, together with its subsidiaries, operates as an integrated construction company in Mainland China and internationally. It operates through five segments: Construction Operations; Survey, Design and Consultancy Operations; Manufacturing Operations; Real Estate Development Operations; and Other Business Operations. The Construction Operations segment engages in the construction of infrastructure, such as railways, highways, metropolitan railways, bridges, tunnels, and real estate projects, as well as housing, municipal engineering, water conservancy and hydropower, and airport and wharf projects. The Survey, Design and Consultancy Operations segment offers survey, design, and consultancy services for civil engineering and infrastructure construction, such as railways, highways and urban rail transport, etc. The Manufacturing Operations segment is involved in the research and development, production, and sale of mechanical equipment comprising railway track maintenance machinery and tunnel boring machinery, as well as manufactures track system, etc. The Real Estate Development Operations segment engages in the development, construction, and sale of residential and commercial properties. The Other Business Operations segment includes trade and logistics, finance and insurance, and highway operations. The company also provides investment services; and purchases and sells goods and materials. China Railway Construction Corporation Limited was founded in 2007 and is headquartered in Beijing, the People's Republic of China. China Railway Construction Corporation Limited is a subsidiary of China Railway Construction Group Co., Ltd.", "industry_name": "Construction and Engineering", "sector_name": "Industrials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 13808443264, "total_enterprise": 33942157852, "number_of_employees": 293884, "outstanding_shares": 1026125000, "eps": 0.179647582068479, "diluted_eps": 0.175300388280974, "earnings_from_cont_operations": 3076777833, "gross_profit": 10863163572, "cash": 19458778256, "total_debt": 32265943382, "total_revenue": 115561668479, "cash_from_operations": 5257678503, "net_income": 2722512107, "ebitda": 6558651182, "year_low_stock_price": 8.75, "year_high_stock_price": 12.78, "seekingalpha_follower_count": 88, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CWYCY.png"}