{"symbol": "CZBS", "name": "Citizens Bancshares", "next_earnings_utc": 1592820000, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "ctbconnect.com", "year_founded": 1921, "street_address": "230 Peachtree Street, NW", "city": "Atlanta", "state": "GA", "zipcode": "30303", "country": "United States", "phone_number": "678-406-4000", "short_description": "Citizens Bancshares Corporation operates as the holding company for Citizens Trust Bank that provides various commercial banking services to individual and corporate customers.", "long_description": "Citizens Bancshares Corporation operates as the holding company for Citizens Trust Bank that provides various commercial banking services to individual and corporate customers. The company offers checking and savings accounts; and demand and money market deposits. It also provides personal loans, including auto loans, personal line of credit, secured line of credit, and home equity lines; residential mortgage loans; commercial loans, such as lines of credit, vehicle/equipment loans, commercial mortgages, and refinance services; and financial and agricultural loans, installment loans, commercial real estate loans, single-family residential loans, and construction and development loans, as well as residential and commercial bank owned assets. In addition, the company offers investment accounts, such as sweep and commercial money market accounts; certificates of deposit; and certificate of deposit account registry services. Further, it provides term life, whole life, finance expense, and disability insurance; merchant services comprising point of sale terminal, credit card and debit card processing, electronic benefits transfer, gift card, and Internet shopping cart services; cash management services; and credit cards. Additionally, the company offers mobile banking, online banking/bill pay, and check recorder services. It operates five full-service branches in metropolitan Atlanta; one full-service branch in Columbus, Georgia; one full-service branch in Birmingham, Alabama; and one full-service branch in Eutaw, Alabama. The company was founded in 1921 and is headquartered in Atlanta, Georgia.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 19701755, "total_enterprise": null, "number_of_employees": 97, "outstanding_shares": 2079997, "eps": 1.789126, "diluted_eps": 1.789126, "earnings_from_cont_operations": 3748419, "gross_profit": 20170712, "cash": 39995735, "total_debt": 4303205, "total_revenue": 20170712, "cash_from_operations": 6403686, "net_income": 3748419, "ebitda": null, "year_low_stock_price": 8.25, "year_high_stock_price": 11.99, "seekingalpha_follower_count": 152, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/CZBS.png"}