{"symbol": "DG", "name": "Dollar General Corporation", "next_earnings_utc": 1590663300, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7616920030.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.75647, "eps_up_revisions": 6, "eps_down_revisions": 0, "revenue_up_revisions": 6, "revenue_down_revisions": 0, "total_analysts": 29, "analysts_sell": 0, "analysts_buy": 12, "analysts_outperform": 8, "analysts_hold": 8, "analysts_underperform": 1, "webpage": "dollargeneral.com", "year_founded": 1939, "street_address": "100 Mission Ridge", "city": "Goodlettsville", "state": "TN", "zipcode": "37072", "country": "United States", "phone_number": "615 855 4000", "short_description": "Dollar General Corporation, a discount retailer, provides various merchandise products in the southern, southwestern, Midwestern, and eastern United States.", "long_description": "Dollar General Corporation, a discount retailer, provides various merchandise products in the southern, southwestern, Midwestern, and eastern United States. The company offers consumable products, including paper and cleaning products, such as paper towels, bath tissues, paper dinnerware, trash and storage bags, and laundry products; packaged food comprising cereals, canned soups and vegetables, condiments, spices, sugar, and flour; and perishables that include milk, eggs, bread, refrigerated and frozen food, beer, and wine. Its consumable products also comprise snacks, such as candies, cookies, crackers, salty snacks, and carbonated beverages; health and beauty products, including over-the-counter medicines and personal care products, such as soaps, body washes, shampoos, cosmetics, and dental hygiene and foot care products; pet supplies and pet food; and tobacco products. In addition, the company offers seasonal products comprising holiday items, toys, batteries, small electronics, greeting cards, stationery, prepaid phones and accessories, gardening supplies, hardware, and automotive and home office supplies; and home products that include kitchen supplies, cookware, small appliances, light bulbs, storage containers, frames, candles, craft supplies and kitchen, and bed and bath soft goods. Further, it provides apparel, which comprise casual everyday apparel for infants, toddlers, girls, boys, women, and men, as well as socks, underwear, disposable diapers, shoes, and accessories. As of February 28, 2020, Dollar General Corporation operated 16,368 stores in 45 states in the United States. The company was formerly known as J.L. Turner & Son, Inc. and changed its name to Dollar General Corporation in 1968. Dollar General Corporation was founded in 1939 and is based in Goodlettsville, Tennessee.", "industry_name": "Multiline Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 44872799713, "total_enterprise": 56328960713, "number_of_employees": 143000, "outstanding_shares": 251515048, "eps": 6.675248, "diluted_eps": 6.64, "earnings_from_cont_operations": 1712555000, "gross_profit": 8489061000, "cash": 240320000, "total_debt": 11696481000, "total_revenue": 27753973000, "cash_from_operations": 2237998000, "net_income": 1712555000, "ebitda": 2841708000, "year_low_stock_price": 118.2, "year_high_stock_price": 185.01, "stocktwits_watchlist_count": 5517, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DG.png"}