{"symbol": "DGRLY", "name": "Delek Group", "next_earnings_utc": 1592488800, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "delek-group.com", "year_founded": 1951, "street_address": "19 Abba Eban Boulevard", "city": "Herzliya", "state": null, "zipcode": "4612001", "country": "Israel", "phone_number": "972 9 863 8444", "short_description": "Delek Group Ltd., an energy company, develops, produces, and sells natural gas in Israel and internationally.", "long_description": "Delek Group Ltd., an energy company, develops, produces, and sells natural gas in Israel and internationally. The company operates through three segments: Energy in Israel, Energy Abroad, and Fuel Products. It holds interests in Tamar, Leviathan, and Aphrodite projects in the Mediterranean; holds rights to oil assets in the Gulf of Mexico and Canada, as well as oil and gas reserves in the North Sea off the coast of England; and owns production, treatment, and storage facilities. The company also operates gas stations with on-site convenience stores; and provides fuel storage and distribution services in Israel. In addition, it provides fuel products and other services, such as white products, comprising gasoline, diesel fuel, LPG, kerosene, jet fuel, and natural gas/CNG; black products, including fuel oil and bitumen; and industrial products, such as engine oils, lubricants, and greases. Further, the company offers services, such as restaurants, cafes, car wash services, etc.; ship services to refueling services at Israeli ports; and retail products comprising food products, beverages, cigarettes, and other products through Menta convenience stores, as well as sells car accessories. Additionally, it engages in the construction and operation of power plants; orchard management activities; processing, packaging, and marketing of fruits; and leasing activities. The company also supplies water for irrigation; cooling storage systems; and provides drinking water pumping services. As of December 31, 2019, it operated 160 convenience stores, including 25 franchised convenience stores, which have coffee and food sales points under the Cup O' Joe brand name. Delek Group Ltd. was founded in 1951 and is headquartered in Herzliya, Israel.", "industry_name": "Oil, Gas and Consumable Fuels", "sector_name": "Energy", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 289416143, "total_enterprise": 8971930244, "number_of_employees": 2083, "outstanding_shares": 117406880, "eps": 5.8274227550459, "diluted_eps": 5.82051950308401, "earnings_from_cont_operations": 116410390, "gross_profit": 662265080, "cash": 571916717, "total_debt": 8311180610, "total_revenue": 2547418411, "cash_from_operations": 1396635103, "net_income": 67761272, "ebitda": 801841717, "year_low_stock_price": 1.56, "year_high_stock_price": 18.1, "seekingalpha_follower_count": 499, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DGRLY.png"}