{"symbol": "DLTR", "name": "Dollar Tree, Inc.", "next_earnings_utc": 1590665400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 6120145960.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.89821, "eps_up_revisions": 0, "eps_down_revisions": 10, "revenue_up_revisions": 7, "revenue_down_revisions": 1, "total_analysts": 28, "analysts_sell": 0, "analysts_buy": 9, "analysts_outperform": 4, "analysts_hold": 15, "analysts_underperform": 0, "webpage": "dollartree.com", "year_founded": 1986, "street_address": "500 Volvo Parkway", "city": "Chesapeake", "state": "VA", "zipcode": "23320", "country": "United States", "phone_number": "757 321 5000", "short_description": "Dollar Tree, Inc. operates discount variety retail stores.", "long_description": "Dollar Tree, Inc. operates discount variety retail stores. It operates through two segments, Dollar Tree and Family Dollar. The Dollar Tree segment offers merchandise at the fixed price of $1.00. It provides consumable merchandise, including candy and food, and health and beauty care, as well as everyday consumables, such as household paper and chemicals, and frozen and refrigerated food; variety merchandise comprising toys, durable housewares, gifts, stationery, party goods, greeting cards, softlines, and other items; and seasonal goods that include Valentine's Day, Easter, Halloween, and Christmas merchandise. This segment operates 7,505 stores under the Dollar Tree and Dollar Tree Canada brands, as well as 13 distribution centers in the United States and 2 in Canada; and a store support center in Chesapeake, Virginia. The Family Dollar segment operates general merchandise discount retail stores that offer consumable merchandise, which comprise food and beverages, tobacco, health and beauty aids, household chemicals, paper products, hardware and automotive supplies, diapers, batteries, and pet food and supplies; and home products, including housewares, home decor, and giftware, as well as domestics, such as comforters, sheets, and towels. Its stores also provides apparel and accessories merchandise comprising clothing, fashion accessories, and shoes; and seasonal and electronics merchandise that include Valentine's Day, Easter, Halloween, and Christmas merchandise, as well as personal electronics, which comprise pre-paid cellular phones and services, stationery and school supplies, and toys. This segment operates 7,783 stores under the Family Dollar brand; and 11 distribution centers. The company was founded in 1986 and is headquartered in Chesapeake, Virginia.", "industry_name": "Multiline Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 19267894347, "total_enterprise": 28759694347, "number_of_employees": 125000, "outstanding_shares": 237230908, "eps": 3.486509, "diluted_eps": 3.47, "earnings_from_cont_operations": 827000000, "gross_profit": 8951900000, "cash": 539200000, "total_debt": 10031000000, "total_revenue": 23610800000, "cash_from_operations": 1869800000, "net_income": 827000000, "ebitda": 2229700000, "year_low_stock_price": 60.2, "year_high_stock_price": 119.71, "stocktwits_watchlist_count": 5978, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DLTR.png"}