{"symbol": "DOV", "name": "Dover", "next_earnings_utc": 1595327400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1463177670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.91804, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 11, "total_analysts": 17, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 4, "analysts_hold": 8, "analysts_underperform": 0, "webpage": "dovercorporation.com", "year_founded": 1947, "street_address": "3005 Highland Parkway", "city": "Downers Grove", "state": "IL", "zipcode": "60515", "country": "United States", "phone_number": "630-541-1540", "short_description": "Dover Corporation provides equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services worldwide.", "long_description": "Dover Corporation provides equipment and components, consumable supplies, aftermarket parts, software and digital solutions, and support services worldwide. The Engineered Products segment provides aftermarket vehicle services, solid waste handling, industrial automation, aerospace and defense, industrial winch and hoist, bearings, drives, electric monitoring, and fluid dispensing systems. This segment also offers manual and power clamps, rotary and linear mechanical indexers, conveyors, pick and place units, glove ports, and manipulators, as well as end-of-arm robotic grippers and slides and end effectors. The Fueling Solutions segment transports fuels and other hazardous fluids, as well as operates retail fueling and vehicle wash establishments. The Imaging and Identification segment provides precision marking and coding; product traceability; and digital textile printing equipment, as well as related consumables. The Pumps and Process Solutions segment manufactures specialty pumps, fluid handling components, plastics and polymer processing equipment, and highly engineered components for rotating and reciprocating machines. This segment also manufactures pumps that are used to transfer liquid and bulk products in various markets, including plastics and polymers processing, chemicals production, food/sanitary, biopharma, medical, transportation, petroleum refining, power generation and general industrial applications. The Refrigeration & Food Equipment segment manufactures refrigeration systems, refrigeration display cases, commercial glass refrigerators and freezer doors, and brazed heat exchangers for industrial heating and cooling, and residential climate control applications; and commercial food service equipment and can-shaping machinery. The company sells its products directly and through a network of distributors. Dover Corporation was incorporated in 1947 and is headquartered in Downers Grove, Illinois.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 13998846528, "total_enterprise": 16952957528, "number_of_employees": 24000, "outstanding_shares": 143947008, "eps": 5.162334, "diluted_eps": 5.100229, "earnings_from_cont_operations": 748492000, "gross_profit": 2618912000, "cash": 508907000, "total_debt": 3463018000, "total_revenue": 7067579000, "cash_from_operations": 996645000, "net_income": 748492000, "ebitda": 1344665000, "year_low_stock_price": 62.95, "year_high_stock_price": 120.26, "seekingalpha_follower_count": 14220, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/DOV.png"}