{"symbol": "EBF", "name": "Ennis", "next_earnings_utc": 1595239200, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 88425000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.12, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "ennis.com", "year_founded": 1909, "street_address": "2441 Presidential Parkway", "city": "Midlothian", "state": "TX", "zipcode": "76065", "country": "United States", "phone_number": "972 775 9801", "short_description": "Ennis, Inc. designs, manufactures, and sells business forms and other business products in the United States.", "long_description": "Ennis, Inc. designs, manufactures, and sells business forms and other business products in the United States. The company offers snap sets, continuous forms, laser cut sheets, tags, labels, envelopes, integrated products, jumbo rolls, and pressure sensitive products under the Ennis, Royal Business Forms, Block Graphics, Specialized Printed Forms, 360ร\u0082ยบ Custom Labels, ColorWorx, Enfusion, Uncompromised Check Solutions, VersaSeal, Ad Concepts, FormSource Limited, Star Award Ribbon Company, Witt Printing, B&D Litho, Genforms, PrintGraphics, Calibrated Forms, PrintXcel, Printegra, Falcon Business Forms, Forms Manufacturers, Mutual Graphics, TRI-C Business Forms, Major Business Systems, Independent Printing, Hoosier Data Forms, Hayes Graphics, Wright Business Graphics, Wright 360, Integrated Print & Graphics, the Flesh Company, Impressions Direct, and Ace Forms brands. It also provides point of purchase advertising for large franchise and fast food chains, as well as kitting and fulfillment under the Adams McClure brand; and presentation folders and document folders under the Admore, Folder Express, and Independent Folders brands. In addition, the company offers custom printed, high performance labels, and custom and stock tags under the Ennis Tag & Label brands; custom and stock tags and labels under the Allen-Bailey Tag & Label, Atlas Tag & Label, Kay Toledo Tag, and Special Service Partners brands; custom and imprinted envelopes under the Trade Envelopes, Block Graphics, Wisco, and National Imprint Corporation brands; and financial and security documents under the Northstar and General Financial Supply brands. It distributes business products and forms through independent distributors. The company was formerly known as Ennis Business Forms, Inc. Ennis, Inc. was founded in 1909 and is headquartered in Midlothian, Texas.", "industry_name": "Commercial Services and Supplies", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 464572773, "total_enterprise": 416179773, "number_of_employees": 2505, "outstanding_shares": 26099594, "eps": 1.47071, "diluted_eps": 1.47, "earnings_from_cont_operations": 38292000, "gross_profit": 128924000, "cash": 68258000, "total_debt": 19865000, "total_revenue": 438412000, "cash_from_operations": 57219000, "net_income": 38292000, "ebitda": 68853000, "year_low_stock_price": 13.98, "year_high_stock_price": 22.21, "seekingalpha_follower_count": 1904, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EBF.png"}