{"symbol": "EBSB", "name": "Meridian Bancorp", "next_earnings_utc": 1595361900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 49245670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.26, "eps_up_revisions": 1, "eps_down_revisions": 3, "revenue_up_revisions": 3, "revenue_down_revisions": 0, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "ebsb.com", "year_founded": 1848, "street_address": "67 Prospect Street", "city": "Peabody", "state": "MA", "zipcode": "01960", "country": "United States", "phone_number": "617-567-1500", "short_description": "Meridian Bancorp, Inc. operates as the holding company for East Boston Savings Bank that provides various financial products and services for individuals and businesses primarily in Suffolk, Norfolk, Middlesex and Essex Counties, Massachusetts.", "long_description": "Meridian Bancorp, Inc. operates as the holding company for East Boston Savings Bank that provides various financial products and services for individuals and businesses primarily in Suffolk, Norfolk, Middlesex and Essex Counties, Massachusetts. The company accepts various deposit products, including non-interest-bearing demand deposits, such as checking accounts; interest-bearing demand accounts comprising NOW and money market accounts; savings accounts; and certificates of deposit, as well as commercial checking accounts. Its loan portfolio includes commercial real estate loans, which are secured by properties used for business purposes, such as office buildings, industrial facilities, and retail facilities; one- to four-family residential loans comprising mortgage loans that enable borrowers to purchase or refinance existing homes; multi-family real estate loans; construction loans; commercial and industrial loans; home equity lines of credit; and consumer loans that include automobile loans, loans secured by savings or certificate accounts, credit builders, and annuity and overdraft loans. In addition, the company offers non-deposit financial products, which comprise mutual funds, annuities, stocks, and bonds through a third-party broker-dealer; and long-term care insurance products. Further, it is also involved in the securities transactions business; and holding foreclosed real estate properties. The company operates 37 full-service locations, as well as 1 mobile branch and 3 loan centers. Meridian Bancorp, Inc. was founded in 1848 and is headquartered in Peabody, Massachusetts.", "industry_name": "Thrifts and Mortgage Finance", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 577370776, "total_enterprise": null, "number_of_employees": 505, "outstanding_shares": 50118991, "eps": 1.274865, "diluted_eps": 1.260712, "earnings_from_cont_operations": 64902000, "gross_profit": 186720000, "cash": 469658000, "total_debt": 758236000, "total_revenue": 186720000, "cash_from_operations": 63028000, "net_income": 64902000, "ebitda": null, "year_low_stock_price": 8.88, "year_high_stock_price": 20.86, "seekingalpha_follower_count": 443, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EBSB.png"}