{"symbol": "EFX", "name": "Equifax", "next_earnings_utc": 1595280300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 807220270.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.88949, "eps_up_revisions": 0, "eps_down_revisions": 16, "revenue_up_revisions": 0, "revenue_down_revisions": 13, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 3, "analysts_hold": 10, "analysts_underperform": 2, "webpage": "equifax.com", "year_founded": 1899, "street_address": "1550 Peachtree Street, NW", "city": "Atlanta", "state": "GA", "zipcode": "30309", "country": "United States", "phone_number": "404-885-8000", "short_description": "Equifax Inc. provides information solutions and human resources business process outsourcing services for businesses, governments, and consumers.", "long_description": "Equifax Inc. provides information solutions and human resources business process outsourcing services for businesses, governments, and consumers. The company operates through four segments: U.S. Information Solutions (USIS), Workforce Solutions, International, and Global Consumer Solutions. The USIS segment offers consumer and commercial information services, such as credit information and credit scoring, credit modeling and portfolio analytics, locate, fraud detection and prevention, identity verification, and other consulting; mortgage services; financial marketing; and identity management services. The Workforce Solutions segment provides employment, income, and social security number verification services, as well as payroll-based transaction and employment tax management services. The International segment provides information service products, which include consumer and commercial services, such as credit and financial information, and credit scoring and modeling; and credit and other marketing products and services, as well as offers information, technology, and other services to support debt collections and recovery management. The Global Consumer Solutions segment offers credit information, credit monitoring, and identity theft protection products directly to consumers through Internet. The company serves customers in financial service, mortgage, employers, consumer, commercial, telecommunication, retail, automotive, utility, brokerage, healthcare, and insurance industries, as well as state and federal governments. It operates in the United States, Canada, Australia, New Zealand, India, the United Kingdom, Spain, Portugal, Argentina, Chile, Costa Rica, Ecuador, El Salvador, Honduras, Mexico, Paraguay, Peru, Uruguay, Brazil, the Republic of Ireland, Russia, Cambodia, Malaysia, Singapore, and the United Arab Emirates. Equifax Inc. was founded in 1899 and is headquartered in Atlanta, Georgia.", "industry_name": "Professional Services", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 18639901637, "total_enterprise": 21821501637, "number_of_employees": 10900, "outstanding_shares": 121385137, "eps": 2.228004, "diluted_eps": 2.223621, "earnings_from_cont_operations": 276100000, "gross_profit": 2071100000, "cash": 369900000, "total_debt": 3508200000, "total_revenue": 3619400000, "cash_from_operations": 313600000, "net_income": 269700000, "ebitda": 885000000, "year_low_stock_price": 103.01, "year_high_stock_price": 164.77, "seekingalpha_follower_count": 9864, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EFX.png"}