{"symbol": "EGBN", "name": "Eagle Bancorp", "next_earnings_utc": 1595448900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 81783000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.74, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 3, "revenue_down_revisions": 1, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "eaglebankcorp.com", "year_founded": 1997, "street_address": "7830 Old Georgetown Road", "city": "Bethesda", "state": "MD", "zipcode": "20814", "country": "United States", "phone_number": "301-986-1800", "short_description": "Eagle Bancorp, Inc. operates as the bank holding company for EagleBank that provides commercial and consumer banking services primarily in the United States.", "long_description": "Eagle Bancorp, Inc. operates as the bank holding company for EagleBank that provides commercial and consumer banking services primarily in the United States. It accepts business and personal checking, NOW, tiered savings, and money market accounts, as well as individual retirement, certificate of deposit, and investment sweep accounts; and time deposits. The company also offers various commercial and consumer lending products comprising commercial loans for working capital, equipment purchases, real estate lines of credit, and government contract financing; asset based lending and accounts receivable financing; construction and commercial real estate loans; business equipment financing; consumer home equity lines of credit, personal lines of credit, and term loans; consumer installment loans, such as auto and personal loans; personal credit cards; and residential mortgage loans. In addition, it provides online and mobile banking services; and other services, including cash management services, business sweep accounts, lock boxes, remote deposit captures, account reconciliation services, merchant card services, safety deposit boxes, and automated clearing house origination, as well as after-hours depositories and ATM services. Further, it provides insurance products and services through a referral program. The company serves sole proprietors, small and medium-sized businesses, partnerships, corporations, non-profit organizations and associations, and individuals, as well as investors. As of December 31, 2018, it operated 20 banking offices comprising 6 in Suburban Maryland, 5 in the District of Columbia, and 9 in Northern Virginia. Eagle Bancorp, Inc. was founded in 1997 and is headquartered in Bethesda, Maryland.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1046028401, "total_enterprise": null, "number_of_employees": 492, "outstanding_shares": 32225151, "eps": 3.918059, "diluted_eps": 3.91082, "earnings_from_cont_operations": 132317000, "gross_profit": 321497000, "cash": 942779000, "total_debt": 633861000, "total_revenue": 321497000, "cash_from_operations": 140766000, "net_income": 132317000, "ebitda": null, "year_low_stock_price": 23.08, "year_high_stock_price": 55.94, "seekingalpha_follower_count": 1058, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EGBN.png"}