{"symbol": "EKTAY", "name": "Elekta AB (publ)", "next_earnings_utc": 1592474400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 395206156.5484868, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "elekta.com", "year_founded": 1972, "street_address": "Box 7593", "city": "Stockholm", "state": null, "zipcode": "103 93", "country": "Sweden", "phone_number": "46 8 58 72 54 00", "short_description": "Elekta AB (publ) provides equipment and software for cancer and brain disorders worldwide.", "long_description": "Elekta AB (publ) provides equipment and software for cancer and brain disorders worldwide. The company offers radiotherapy systems under the Versa HD, Precise Treatment System, and Elekta Compact names; Elekta Infinity, an image-guided radiation therapy (IGRT) system; and Elekta Synergy, a digital accelerator for advanced IGRT. It also provides personalized imaging tools; automation and integration systems; beam shaping solutions; patient positioning and immobilization solutions; and radiotherapy treatment planning systems. In addition, the company offers radiosurgery systems under the Leksell Gamma Knife Icon, Leksell Gamma Knife Perfexion, and Elekta Axesse names; Leksell GammaPlan, a treatment planning software; and Elekta Unity, a magnetic resonance radiation therapy solution. Further, it provides care management software, such as MOSAIQ Radiation Oncology and MOSAIQ Medical Oncology; MOSAIQ IQ Scripts, a workflow automation and customization tool; Patient Engagement, a patient communication tool; MOSAIQ Evaluate, a plan management and dose review solution; MOSAIQ Locate, a stereotactic localization solution; and METRIQ, a cancer registry data management solution. Additionally, the company offers Flexitron, a remote after loading platform; microSelectron, a digital pulsed dose rate platform; Esteya, an electronic brachytherapy for treating skin cancer; Oncentra Brachy, a treatment planning software; real-time prostate solutions; and gynecological brachytherapy, bronchus and esophagus, breast, prostate, rectum and bladder, and skin applicators, as well as brachytherapy needles and flexible implant tubes. It also provides Leksell Vantage Stereotactic System for neuroimaging and treatment; Elekta Neuromag TRIUX, a magnetoencephalography system; Leksell Stereotactic System for minimally invasive stereotactic neurosurgery; and proton therapy components. The company was founded in 1972 and is headquartered in Stockholm, Sweden.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 3821127795, "total_enterprise": 4132708685, "number_of_employees": 3897, "outstanding_shares": 368557300, "eps": 0.290782101151366, "diluted_eps": 0.290782101151366, "earnings_from_cont_operations": 111078776, "gross_profit": 628865726, "cash": 662886163, "total_debt": 958925446, "total_revenue": 1496181923, "cash_from_operations": 103905792, "net_income": 111078776, "ebitda": 330879490, "year_low_stock_price": 6.25, "year_high_stock_price": 14.76, "seekingalpha_follower_count": 456, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EKTAY.png"}