{"symbol": "ELRNF", "name": "Elron Electronic Industries", "next_earnings_utc": 1592906400, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "elron.com", "year_founded": 1961, "street_address": "The Triangular Tower", "city": "Tel Aviv", "state": null, "zipcode": "6702301", "country": "Israel", "phone_number": "972 3 607 5555", "short_description": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields.", "long_description": "Elron Electronic Industries Ltd., through its subsidiaries, provides technology products in the medical devices and cyber fields. The company offers BrainsGate, a minimally invasive treatment for ischemic stroke; Pocared, an automated microbiology lab system for infectious diseases diagnosis; CartiHeal implants for cartilage and bone repair in weight bearing joints; Coramaze, a transfemoral mitral valve repair system with atraumatic anchoring; Notal Vision, a remote monitoring of patients at risk of vision loss from age-related macular degeneration; cyber intelligence platform that detects and defuses threats before they become cyberattacks; Alcide, a dev-to-production security tool for workloads running on kubernetes platforms; and SecuredTouch a behavioral biometrics for mobile transactions. It also provides Ironscales, an automated phishing prevention, detection, and response platform; Cynerio, a connected medical device; Kindite, a cloud encryption solution; KZen, a non-custodial digital currency wallet; Naval Dome, a maritime cyber detection and prevention system; Sayata Labs, an AI-based cyber risk assessment solution; OpenLegacy, a platform that enables the digital transformation process; OzCode, which provides root cause analysis, collaboration, and real-time bug triage solutions; PLYmedia, a platform for ad networks; Audioburst, an AI-powered audio search platform; Aqwise, a biological water and wastewater treatment solutions for the industrial and municipal markets; Atlantium, a water disinfection solution; SECDO, a platform that automatically detects suspicious activity, while accelerating incident investigation and response; Kyma, a remote patient monitoring device; and Jordan Valley, an X-ray based metrology solutions for semiconductors process control. In addition, the company offers Cloudyn, Given Imaging, Sync-Rx, Wavion, Safend, Medingo, Teledata, and 3DV Systems. Elron Electronic Industries Ltd. was founded in 1961 and is based in Tel Aviv, Israel.", "industry_name": "Diversified Financial Services", "sector_name": "Financials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 72780639, "total_enterprise": 52804639, "number_of_employees": 12, "outstanding_shares": 29743767, "eps": -0.629367, "diluted_eps": -0.645921, "earnings_from_cont_operations": -32521000, "gross_profit": 1276000, "cash": 45618000, "total_debt": 2510000, "total_revenue": 1276000, "cash_from_operations": -13764000, "net_income": -25526000, "ebitda": -13013000, "year_low_stock_price": 1.15, "year_high_stock_price": 2.2, "seekingalpha_follower_count": 131, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ELRNF.png"}