{"symbol": "ELTP", "name": "Elite Pharmaceuticals", "next_earnings_utc": 1591648200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "elitepharma.com", "year_founded": 1984, "street_address": "165 Ludlow Avenue", "city": "Northvale", "state": "NJ", "zipcode": "07647", "country": "United States", "phone_number": "201-750-2646", "short_description": "Elite Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the research, development, manufacture, and licensing of proprietary orally administered controlled-release drug delivery systems and products.", "long_description": "Elite Pharmaceuticals, Inc., a specialty pharmaceutical company, engages in the research, development, manufacture, and licensing of proprietary orally administered controlled-release drug delivery systems and products. The company operates in Abbreviated New Drug Applications for Generic Products and New Drug Applications for Branded Products segments. It owns, licenses, and contract manufactures various generic and oral dose pharmaceuticals products, such as Phentermine HCl 37.5mg tablets for the treatment of bariatrics under Adipex-P brand; Hydromorphone HCl 8mg tablets for pains under the Dilaudid brand; Phendimetrazine Tartrate 35mg tablets for bariatrics under the Bontril brand; Naltrexone HCl 50mg tablets for the treatment of pains under the Revia brand; and Isradipine 2.5mg and 5mg capsules for cardiovascular diseases. The company also provides Oxycodone HCl immediate release 5mg, 10mg, 15mg, 20mg, and 30mg tablets for pains under Roxycodone brand; Trimipramine Maleate Immediate Release 25mg, 50mg, and 100mg antidepressant capsules under the Surmontil brand; Methadone HCl 5mg and 10mg tablets for pains under the Dolophine brand; and Dextroamphetamine Saccharate, Amphetamine Aspartate, Dextroamphetamine Sulfate, and Amphetamine Sulfate Immediate Release 5mg, 7.5mg, 10mg, 12.5mg, 15mg, 20mg, and 30mg tablets for central nervous system diseases under the Adderall brand, as well as SequestOX, an immediate release Oxycodone with Naltrexone. In addition, it manufactures controlled-release products on a contract basis for third parties in the areas of pain, allergy, bariatric, and infection. Further, the company is developing a range of abuse deterrent opioid products. It has a manufacturing and license agreement with Epic Pharma LLC; development and license agreement with SunGen Pharma, LLC; and strategic marketing alliance with Glenmark Pharmaceuticals, Inc. USA. The company was founded in 1984 and is headquartered in Northvale, New Jersey.", "industry_name": "Pharmaceuticals", "sector_name": "Health Care", "is_defunct": false, "exchange": "OTCQB", "equity_type": "stocks", "market_cap": 62505074, "total_enterprise": 78474488, "number_of_employees": 35, "outstanding_shares": 840404367, "eps": -0.007063, "diluted_eps": -0.007063, "earnings_from_cont_operations": -5840424, "gross_profit": 6052325, "cash": 1870080, "total_debt": 3935534, "total_revenue": 14393135, "cash_from_operations": -2723682, "net_income": -5840424, "ebitda": -1627229, "year_low_stock_price": 0.0333, "year_high_stock_price": 0.141, "seekingalpha_follower_count": 5355, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ELTP.png"}