{"symbol": "EMR", "name": "Emerson Electric Co.", "next_earnings_utc": 1595328900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 3865167340.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.59016, "eps_up_revisions": 0, "eps_down_revisions": 16, "revenue_up_revisions": 0, "revenue_down_revisions": 17, "total_analysts": 25, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 2, "analysts_hold": 17, "analysts_underperform": 0, "webpage": "emerson.com", "year_founded": 1890, "street_address": "8000 West Florissant Avenue", "city": "St. Louis", "state": "MO", "zipcode": "63136", "country": "United States", "phone_number": "314-553-2000", "short_description": "Emerson Electric Co., a technology and engineering company, provides solutions to industrial, commercial, and consumer markets worldwide.", "long_description": "Emerson Electric Co., a technology and engineering company, provides solutions to industrial, commercial, and consumer markets worldwide. It operates through Automation Solutions and Commercial & Residential Solutions segments. The Automation Solutions segment offers measurement and analytical instrumentation, industrial valves and equipment, and process control software and systems. It serves the oil and gas, refining, chemicals and power generation, pharmaceuticals, food and beverage, automotive, pulp and paper, metals and mining, and municipal water supplies markets. The Commercial & Residential Solutions segment offers residential and commercial heating and air conditioning products, such as residential and variable speed scroll compressors; system protector and flow control devices; standard, programmable, and Wi-Fi thermostats; monitoring equipment and electronic controls for gas and electric heating systems; gas valves for furnaces and water heaters; ignition systems for furnaces; sensors and thermistors for home appliances; and temperature sensors and controls. It also provides reciprocating, scroll, and screw compressors; precision flow controls; system diagnostics and controls; and environmental control systems for use in medical, food processing, and cold storage applications. In addition, this segment offers air conditioning, refrigeration, and lighting control technologies, as well as facility design and product management, site commissioning, facility monitoring, and energy modeling services; temperature management and monitoring products for the foodservice markets; and professional and homeowner tools, and appliance solutions. The company was formerly known as The Emerson Electric Manufacturing Company and changed its name to Emerson Electric Co. in 2000. Emerson Electric Co. was founded in 1890 and is headquartered in St. Louis, Missouri.", "industry_name": "Electrical Equipment", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 36457942806, "total_enterprise": 42122942806, "number_of_employees": 88000, "outstanding_shares": 597475300, "eps": 3.541445, "diluted_eps": 3.505574, "earnings_from_cont_operations": 2189000000, "gross_profit": 7647000000, "cash": 2583000000, "total_debt": 8202000000, "total_revenue": 17968000000, "cash_from_operations": 3162000000, "net_income": 2164000000, "ebitda": 3740000000, "year_low_stock_price": 37.75, "year_high_stock_price": 78.38, "seekingalpha_follower_count": 48273, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EMR.png"}