{"symbol": "ENTG", "name": "Entegris", "next_earnings_utc": 1595325600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 415281710.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.48528, "eps_up_revisions": 0, "eps_down_revisions": 9, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 2, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "entegris.com", "year_founded": 1966, "street_address": "129 Concord Road", "city": "Billerica", "state": "MA", "zipcode": "01821", "country": "United States", "phone_number": "978 436 6500", "short_description": "Entegris, Inc. develops, manufactures, and supplies microcontamination control products, specialty chemicals, and advanced materials handling solutions for manufacturing processes in the semiconductor and other high-technology industries in North America, Taiwan, South Korea, Japan, China, Europe, and Southeast Asia.", "long_description": "Entegris, Inc. develops, manufactures, and supplies microcontamination control products, specialty chemicals, and advanced materials handling solutions for manufacturing processes in the semiconductor and other high-technology industries in North America, Taiwan, South Korea, Japan, China, Europe, and Southeast Asia. It operates through three segments: Specialty Chemicals and Engineered Materials (SCEM); Microcontamination Control (MC); and Advanced Materials Handling (AMH). The SCEM segment offers high-performance and high-purity process chemistries, gases, and materials, as well as delivery systems to support semiconductor and other advanced manufacturing processes. The MC segment provides solutions to filter and purify critical liquid chemistries and gases used in semiconductor manufacturing processes and other high-technology industries. The AMH segment develops solutions to monitor, protect, transport, and deliver critical liquid chemistries, wafers, and other substrates for application in the semiconductor and other high-technology industries. The company's customers include semiconductor device manufacturers, semiconductor equipment makers, gas and chemical manufacturing companies, wafer grower companies, and manufacturers of high-precision electronics; and flat panel display equipment makers, materials suppliers and panel manufacturers, and manufacturers of hard disk drive components and devices. It also serves manufacturers and suppliers in the solar and life science industries, electrical discharge machining customers, glass and glass container manufacturers, aerospace manufacturers, and manufacturers of biomedical implantation devices. The company was founded in 1966 and is headquartered in Billerica, Massachusetts.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 8060239016, "total_enterprise": 8857771016, "number_of_employees": 5300, "outstanding_shares": 134606530, "eps": 2.09786, "diluted_eps": 2.080356, "earnings_from_cont_operations": 283208000, "gross_profit": 726788000, "cash": 335077000, "total_debt": 1132609000, "total_revenue": 1612346000, "cash_from_operations": 396239000, "net_income": 283208000, "ebitda": 443673000, "year_low_stock_price": 33.75, "year_high_stock_price": 60.5, "seekingalpha_follower_count": 3814, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ENTG.png"}