{"symbol": "EVR", "name": "Evercore", "next_earnings_utc": 1595412000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 319498800.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.3953, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 9, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 4, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "evercore.com", "year_founded": 1995, "street_address": "55 East 52nd Street", "city": "New York", "state": "NY", "zipcode": "10055", "country": "United States", "phone_number": "212-857-3100", "short_description": "Evercore Inc., together with its subsidiaries, operates as an independent investment banking advisory firm in the United States, Europe, Latin America, and internationally.", "long_description": "Evercore Inc., together with its subsidiaries, operates as an independent investment banking advisory firm in the United States, Europe, Latin America, and internationally. It operates through two segments, Investment Banking and Investment Management. The Investment Banking segment offers advisory services on mergers, acquisitions, divestitures, leveraged buyouts, restructurings, shareholder activism and defense, and related corporate finance matters; and services related to securities underwriting, private placement services, and commissions for agency-based equity trading services and equity research. This segment also provides restructuring advice to companies in financial transition, as well as to creditors, shareholders, and potential acquirers; and macroeconomic, policy, and fundamental equity research and agency-based equity securities trading for institutional investors. In addition, it engages in the provision of capital markets advisory services and advisory services focused on secondary transactions for private funds interests; and raising funds for financial sponsors. The Investment Management segment offers investment advisory, wealth management, and fiduciary services for high net-worth individuals and related entities; and institutional asset management services, including financial assets management services for institutional investors. It also holds interests in private equity funds; and provides trust services. The company was formerly known as Evercore Partners Inc. and changed its name to Evercore Inc. in August 2017. Evercore Inc. was founded in 1995 and is headquartered in New York, New York.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2233918955, "total_enterprise": null, "number_of_employees": 1900, "outstanding_shares": 40535637, "eps": 6.556151, "diluted_eps": 6.126329, "earnings_from_cont_operations": 314341000, "gross_profit": 1883626000, "cash": 605020000, "total_debt": 717687000, "total_revenue": 2020378000, "cash_from_operations": 743139000, "net_income": 261379000, "ebitda": null, "year_low_stock_price": 33.25, "year_high_stock_price": 91.59, "seekingalpha_follower_count": 4245, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EVR.png"}