{"symbol": "EVRI", "name": "Everi Holdings Inc.", "next_earnings_utc": 1591131600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 111976400.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.01, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 7, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "everi.com", "year_founded": 1998, "street_address": "7250 South Tenaya Way", "city": "Las Vegas", "state": "NV", "zipcode": "89113", "country": "United States", "phone_number": "702-855-3000", "short_description": "Everi Holdings Inc. provides technology solutions for the casino gaming industry in the United States, Europe, Canada, the Caribbean, Central America, and Asia.", "long_description": "Everi Holdings Inc. provides technology solutions for the casino gaming industry in the United States, Europe, Canada, the Caribbean, Central America, and Asia. The company operates in two segments, Games and FinTech. It offers gaming products, such as classic mechanical reel games, video reel games, core HDX, Empire MPX and the Texan HDX, wide area progressive games, and slot tournament systems; and sells player terminals, licenses, back office systems, and other related equipment. The company also provides Cash access services; Casino Cash Plus 3-in-1 ATM, a cash-dispensing machine that enables ATM cash withdrawals, POS debit card cash access transactions, and credit card cash access transactions; check verification and warranty services; CashClub that provides gaming establishments with a single dashboard interface to streamline credit and debit card cash access transaction processing and check warranty transactions; fully integrated kiosks that provide multiple functions to the casino floor; and other integrated kiosk solutions. In addition, it offers Everi Compliance, a suite of compliance software to assist with anti-money laundering regulations; Central Credit, a gaming patron credit bureau service; non-ATM terminals that perform authorizations for credit card cash access and POS debit card transactions; database services; and an online payment processing solution for gaming operators in states that offer intra-state, and Internet-based gaming and lottery activities. The company was formerly known as Global Cash Access Holdings, Inc. and changed its name to Everi Holdings Inc. in August 2015. Everi Holdings Inc. was founded in 1998 and is headquartered in Las Vegas, Nevada.", "industry_name": "Hotels, Restaurants and Leisure", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 528196604, "total_enterprise": 1353355604, "number_of_employees": 1400, "outstanding_shares": 85055814, "eps": 0.228211, "diluted_eps": 0.21, "earnings_from_cont_operations": 16517000, "gross_profit": 420841000, "cash": 298371000, "total_debt": 1123530000, "total_revenue": 533227000, "cash_from_operations": 84890000, "net_income": 16517000, "ebitda": 241162000, "year_low_stock_price": 1.55, "year_high_stock_price": 14.88, "seekingalpha_follower_count": 3048, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/EVRI.png"}