{"symbol": "FBIZ", "name": "First Business Financial Services", "next_earnings_utc": 1595534400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 24245750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.306, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 2, "revenue_down_revisions": 1, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "firstbusiness.com", "year_founded": 1986, "street_address": "401 Charmany Drive", "city": "Madison", "state": "WI", "zipcode": "53719", "country": "United States", "phone_number": "608-238-8008", "short_description": "First Business Financial Services, Inc. operates as the bank holding company for First Business Bank that provides commercial banking products and services for small and medium-sized businesses, business owners, executives, professionals, and high net worth individuals.", "long_description": "First Business Financial Services, Inc. operates as the bank holding company for First Business Bank that provides commercial banking products and services for small and medium-sized businesses, business owners, executives, professionals, and high net worth individuals. The company offers deposit products, such as non-interest-bearing transaction accounts, interest-bearing transaction accounts, money market accounts, time deposits, and certificates of deposit. It also provides loan products, including commercial real estate loans, commercial and industrial loans, small business administration loans, and direct financing leases, as well as consumer and other loans comprising home equity, second mortgage, credit card, and other personal loans for professional and executive clients. In addition, the company offers commercial lending, asset-based financing, equipment financing, treasury management, and trust and investment. Further, it provides lines of credit and factored receivable financing, and term loans secured by accounts receivable, inventory, equipment, and real estate assets primarily to manufacturers and wholesale distribution companies; and new and replacement equipment loan and lease, debt restructuring, consolidation, and sale-lease-back transaction services. The company holds an equity investment in a Madison, Wisconsin community development project; and invests in marketable securities and tax-exempt loans. First Business Financial Services, Inc. was incorporated in 1986 and is headquartered in Madison, Wisconsin.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 141069932, "total_enterprise": null, "number_of_employees": 288, "outstanding_shares": 8523863, "eps": 2.392152, "diluted_eps": 2.392152, "earnings_from_cont_operations": 20703000, "gross_profit": 86940000, "cash": 74782000, "total_debt": 489414000, "total_revenue": 86940000, "cash_from_operations": 19549000, "net_income": 20703000, "ebitda": null, "year_low_stock_price": 12.86, "year_high_stock_price": 27.35, "seekingalpha_follower_count": 388, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FBIZ.png"}