{"symbol": "FFWM", "name": "First Foundation", "next_earnings_utc": 1595451600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 56475000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.358, "eps_up_revisions": 3, "eps_down_revisions": 0, "revenue_up_revisions": 2, "revenue_down_revisions": 1, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 2, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "firstfoundationinc.com", "year_founded": 1990, "street_address": "18101 Von Karman Avenue", "city": "Irvine", "state": "CA", "zipcode": "92612", "country": "United States", "phone_number": "949-202-4160", "short_description": "First Foundation Inc., through its subsidiaries, provides financial services to individuals, businesses, and other organizations in the United States.", "long_description": "First Foundation Inc., through its subsidiaries, provides financial services to individuals, businesses, and other organizations in the United States. It operates in two segments, Banking; and Investment Management and Wealth Planning. The company offers a range of bank deposit products, including personal and business checking accounts, savings accounts, interest-bearing negotiable order of withdrawal accounts, money market accounts, and time certificates of deposit; and loan products consisting of multifamily and single family residential real estate loans, commercial real estate loans, and commercial term loans and lines of credit, as well as consumer loans, such as personal installment loans and lines of credit, and home equity lines of credit. It also provides various specialized services comprising trust services, online banking, remote deposit capture services, merchant credit card services, ATM cards, Visa debit cards, and business sweep accounts, as well as insurance brokerage services and equipment financing solutions. In addition, the company offers investment management and financial planning services; treasury management services; advisory and coordination services in the areas of estate planning, retirement planning, and charitable and business ownership issues; and financial, investment, and economic advisory and related services. Further, it provides support services, including the processing and transmission of financial and economic data for charitable organizations. The company operates through a network of 20 branch offices and 2 loan production offices in California, Nevada, and Hawaii. The company was founded in 1990 and is headquartered in Irvine, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 664770443, "total_enterprise": null, "number_of_employees": 485, "outstanding_shares": 44615466, "eps": 1.303282, "diluted_eps": 1.289787, "earnings_from_cont_operations": 58191000, "gross_profit": 211585000, "cash": 40359000, "total_debt": 810648000, "total_revenue": 211585000, "cash_from_operations": 50129000, "net_income": 58191000, "ebitda": null, "year_low_stock_price": 8.01, "year_high_stock_price": 17.64, "seekingalpha_follower_count": 270, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FFWM.png"}