{"symbol": "FITB", "name": "Fifth Third Bancorp", "next_earnings_utc": 1595327400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1870237920.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.35363, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 1, "revenue_down_revisions": 9, "total_analysts": 25, "analysts_sell": 2, "analysts_buy": 9, "analysts_outperform": 5, "analysts_hold": 9, "analysts_underperform": 0, "webpage": "53.com", "year_founded": 1858, "street_address": "38 Fountain Square Plaza", "city": "Cincinnati", "state": "OH", "zipcode": "45263", "country": "United States", "phone_number": "866-670-0468", "short_description": "Fifth Third Bancorp operates as a diversified financial services company in the United States.", "long_description": "Fifth Third Bancorp operates as a diversified financial services company in the United States. The company's Commercial Banking segment offers credit intermediation, cash management, and financial services; lending and depository products; and cash management, foreign exchange and international trade finance, derivatives and capital markets services, asset-based lending, real estate finance, public finance, commercial leasing, and syndicated finance for business, government, and professional customers. Its Branch Banking segment provides a range of deposit and loan products to individuals and small businesses. This segment offers checking and savings accounts, home equity loans and lines of credit, credit cards, and loans for automobiles and personal financing needs, as well as cash management services for small businesses. The company's Consumer Lending segment engages in direct lending activities that include origination, retention, and servicing of residential mortgage and home equity loans or lines of credit; and indirect lending activities, including loans to consumers through correspondent lenders and automobile dealers. Fifth Third Bancorp's Wealth & Asset Management segment provides various investment alternatives for individuals, companies, and not-for-profit organizations. It offers retail brokerage services to individual clients; and broker dealer services to the institutional marketplace. This segment also provides asset management services; wealth planning, investment management, banking, insurance, and trust and estate services; and advisory services for institutional clients comprising middle market businesses, non-profits, states, and municipalities. As of April 14, 2020, the company operated 1,149 full-service banking centers and 2,481 ATMs in Ohio, Kentucky, Indiana, Michigan, Illinois, Florida, Tennessee, West Virginia, Georgia, and North Carolina. Fifth Third Bancorp was founded in 1858 and is headquartered in Cincinnati, Ohio.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 13803969666, "total_enterprise": null, "number_of_employees": 19869, "outstanding_shares": 711911793, "eps": 2.313566, "diluted_eps": 2.287371, "earnings_from_cont_operations": 1783000000, "gross_profit": 7043000000, "cash": 7815000000, "total_debt": 24868000000, "total_revenue": 7043000000, "cash_from_operations": 1723000000, "net_income": 1783000000, "ebitda": null, "year_low_stock_price": 11.1, "year_high_stock_price": 31.64, "seekingalpha_follower_count": 14901, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FITB.png"}