{"symbol": "FIVE", "name": "Five Below", "next_earnings_utc": 1591732800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 243264340.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.24245, "eps_up_revisions": 0, "eps_down_revisions": 10, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 23, "analysts_sell": 1, "analysts_buy": 11, "analysts_outperform": 4, "analysts_hold": 6, "analysts_underperform": 1, "webpage": "fivebelow.com", "year_founded": 2002, "street_address": "701 Market Street", "city": "Philadelphia", "state": "PA", "zipcode": "19106", "country": "United States", "phone_number": "215 546 7909", "short_description": "Five Below, Inc. operates as a specialty value retailer in the United States.", "long_description": "Five Below, Inc. operates as a specialty value retailer in the United States. It offers accessories, including novelty socks, sunglasses, jewelry, scarves, gloves, hair accessories, athletic tops and bottoms, and T-shirts, as well as nail polishes, lip glosses, fragrances, and branded cosmetics; and items used to complete and personalize living space, including glitter lamps, posters, frames, fleece blankets, plush items, pillows, candles, incense, lighting, novelty decor, and related items, as well as provides storage options for the customers room. The company also provides sport balls; team sports merchandise and fitness accessories, such as hand weights, jump ropes, and gym balls; games, including name brand board games, puzzles, collectibles, and toys covering remote control; and pool, beach, and outdoor toys, as well as games and accessories. In addition, it offers accessories, such as cases, chargers, headphones, and other related items for cell phones, tablets, audio, and computers; books, video games, and DVDs; craft activity kits; arts and crafts supplies that consist of crayons, markers, and stickers; and trend-right items for school comprising backpacks, fashion notebooks and journals, novelty pens and pencils, locker accessories, and everyday name brand items. Further, the company provides party goods, decorations, gag gifts, and greeting cards, as well as every day and special occasion merchandise products; assortment of classic and novelty candy bars, movie-size box candy, seasonal-related candy, and gum and snack food; chilled drinks through coolers; and seasonally-specific items used to celebrate and decorate for events. It primarily serves tween and teen customers. As of March 18, 2020, Five Below, Inc. operated 900 stores in 36 states. The company was formerly known as Cheap Holdings, Inc. and changed its name to Five Below, Inc. in August 2002. Five Below, Inc. was founded in 2002 and is headquartered in Philadelphia, Pennsylvania.", "industry_name": "Specialty Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5832589785, "total_enterprise": 6518963785, "number_of_employees": 10500, "outstanding_shares": 55734255, "eps": 3.135881, "diluted_eps": 3.119999, "earnings_from_cont_operations": 175056000, "gross_profit": 673966000, "cash": 261719000, "total_debt": 948093000, "total_revenue": 1846730000, "cash_from_operations": 187029000, "net_income": 175056000, "ebitda": 272263000, "year_low_stock_price": 47.53, "year_high_stock_price": 137.97, "seekingalpha_follower_count": 13579, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FIVE.png"}