{"symbol": "FNLC", "name": "The First Bancorp", "next_earnings_utc": 1595448900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "thefirst.com", "year_founded": 1864, "street_address": "223 Main Street", "city": "Damariscotta", "state": "ME", "zipcode": "04543", "country": "United States", "phone_number": "207-563-3195", "short_description": "The First Bancorp, Inc. operates as the holding company for First National Bank that provides a range of banking products and services to individual and corporate customers.", "long_description": "The First Bancorp, Inc. operates as the holding company for First National Bank that provides a range of banking products and services to individual and corporate customers. The company offers various deposit products, including demand, NOW, savings, money market, and certificates of deposit accounts. It also provides commercial loan products, such as mortgage loans to finance investments in real property comprising multi-family residential, commercial/retail, office, industrial, hotel, educational, and other specific or mixed use properties; loans to finance construction of owner- and non-owner occupied commercial real estate properties; and revolving and term loan obligations to business and corporate enterprises for the purpose of financing working capital or capital investment. In addition, the company offers municipal loans for capitalized expenditures, construction projects, or tax-anticipation notes; residential term loans that include amortizing home mortgages and construction loans, which include loans for owner-occupied residential construction; home equity loans and lines of credit; and consumer loans, which are amortizing loans to individuals collateralized by automobiles, pleasure crafts, and recreation vehicles, as well as unsecured short-term time notes. Further, it provides private banking, financial planning, investment management, and trust services to individuals, businesses, non-profit organizations, and municipalities, as well as ATM processing services. The company operates through 16 full-service banking offices in Lincoln, Knox, Hancock, Washington, and Penobscot counties in the Mid-Coast, Eastern, and Down East regions of Maine. The company was formerly known as First National Lincoln Corporation and changed its name to The First Bancorp, Inc. in April 2008. The First Bancorp, Inc. was founded in 1864 and is based in Damariscotta, Maine.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 225185024, "total_enterprise": null, "number_of_employees": 240, "outstanding_shares": 10926008, "eps": 2.389025, "diluted_eps": 2.369991, "earnings_from_cont_operations": 25864000, "gross_profit": 68503000, "cash": 30444000, "total_debt": 257362000, "total_revenue": 68503000, "cash_from_operations": 28175000, "net_income": 25864000, "ebitda": null, "year_low_stock_price": 17.62, "year_high_stock_price": 30.64, "seekingalpha_follower_count": 563, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FNLC.png"}