{"symbol": "FRC", "name": "First Republic Bank", "next_earnings_utc": 1594723800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 933690790.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.1576, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 5, "revenue_down_revisions": 2, "total_analysts": 23, "analysts_sell": 1, "analysts_buy": 4, "analysts_outperform": 3, "analysts_hold": 15, "analysts_underperform": 0, "webpage": "firstrepublic.com", "year_founded": 1985, "street_address": "111 Pine Street", "city": "San Francisco", "state": "CA", "zipcode": "94111", "country": "United States", "phone_number": "415-392-1400", "short_description": "First Republic Bank, together with its subsidiaries, provides private banking, private business banking, real estate lending, and wealth management services to clients in metropolitan areas in the United States.", "long_description": "First Republic Bank, together with its subsidiaries, provides private banking, private business banking, real estate lending, and wealth management services to clients in metropolitan areas in the United States. It operates through two segments, Commercial Banking and Wealth Management. The company accepts deposit products, such as checking, money market checking, savings, passbook deposits, and individual retirement accounts, as well as certificates of deposit. It also offers a range of lending products that comprise residential mortgage loans, home equity lines of credit, multifamily loans, commercial real estate loans, personal loans, business loans, construction loans, and smaller loans and lines of credit to businesses and individuals. The company's loans are secured by single family residences, multifamily buildings, and commercial real estate properties. In addition, it provides wealth management services, which include various investment strategies and products, online investment management services, trust and custody services, online brokerage, financial and estate planning, and access to alternative investments, as well as investing, insurance, and foreign exchange services; and treasury services. Additionally, the company offers online and mobile banking services; student loan refinancing services; and ATM and debit cards. As of December 31, 2019, the company offered its services through 89 offices, including 78 licensed deposit-taking offices in San Francisco, Palo Alto, Los Angeles, Santa Barbara, Newport Beach, and San Diego, California; Portland, Oregon; Boston, Massachusetts; Palm Beach, Florida; Greenwich, Connecticut; New York, New York; Jackson; and Wyoming, as well as 11 offices that provided lending, wealth management, and trust services. First Republic Bank was founded in 1985 and is headquartered in San Francisco, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 18547794807, "total_enterprise": null, "number_of_employees": 4812, "outstanding_shares": 171468936, "eps": 5.17133, "diluted_eps": 5.138736, "earnings_from_cont_operations": 922424000, "gross_profit": 3354620000, "cash": 3979762000, "total_debt": 18969036000, "total_revenue": 3354620000, "cash_from_operations": 929822000, "net_income": 922424000, "ebitda": null, "year_low_stock_price": 70.06, "year_high_stock_price": 122.34, "seekingalpha_follower_count": 4478, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FRC.png"}