{"symbol": "FSV", "name": "FirstService", "next_earnings_utc": 1595503800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 555664500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.48167, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 8, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 2, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "firstservice.com", "year_founded": 1988, "street_address": "1140 Bay Street", "city": "Toronto", "state": "ON", "zipcode": "M5S 2B4", "country": "Canada", "phone_number": "416-960-9500", "short_description": "FirstService Corporation, together with its subsidiaries, provides residential property services to residential and commercial customers in the United States and Canada.", "long_description": "FirstService Corporation, together with its subsidiaries, provides residential property services to residential and commercial customers in the United States and Canada. The company operates through two segments, FirstService Residential and FirstService Brands. The FirstService Residential segment provides property management services for private residential communities, such as condominiums, co-operatives, homeowner associations, master-planned communities, active adult and lifestyle communities, and various other residential developments. This segment also offers a range of ancillary services, including on-site staffing for building engineering and maintenance, full-service amenity management, security and concierge/front desk, and landscaping; and financial services comprising cash management, other banking transaction-related services, and specialized property insurance brokerage. In addition, this segment provides energy management solutions and advisory services, and resale processing services. The FirstService Brands segment offers property services through 6 franchise networks; and company-owned locations, including 18 California Closets locations and 9 Paul Davis Restoration locations. It offers residential and commercial restoration, painting, and floor coverings design and installation services; custom-designed and installed closet, and home storage solutions; home inspection services; exterior residential painting and window cleaning services; fire protection services; and heating, ventilation, and air conditioning services, as well as related services. This segment provides its services primarily under the Paul Davis Restoration, CertaPro Painters, California Closets, Pillar to Post Home Inspectors, Floor Coverings International, College Pro Painters, and Century Fire Protection brand names. FirstService Corporation was founded in 1988 and is headquartered in Toronto, Canada.", "industry_name": "Real Estate Management and Development", "sector_name": "Real Estate", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 4036283850, "total_enterprise": 5006162146, "number_of_employees": 24000, "outstanding_shares": 43423716, "eps": -6.278027, "diluted_eps": -6.278027, "earnings_from_cont_operations": -229996000, "gross_profit": 827038000, "cash": 118225000, "total_debt": 889413000, "total_revenue": 2555586000, "cash_from_operations": 122069000, "net_income": -248654000, "ebitda": 240657000, "year_low_stock_price": 57.38, "year_high_stock_price": 114.87, "seekingalpha_follower_count": 811, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FSV.png"}