{"symbol": "FUL", "name": "H.B. Fuller Company", "next_earnings_utc": 1593029100, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 665958610.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.56069, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 8, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 1, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "hbfuller.com", "year_founded": 1887, "street_address": "1200 Willow Lake Boulevard", "city": "Saint Paul", "state": "MN", "zipcode": "55164", "country": "United States", "phone_number": "651-236-5900", "short_description": "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, and other specialty chemical products worldwide.", "long_description": "H.B. Fuller Company, together with its subsidiaries, formulates, manufactures, and markets adhesives, sealants, coatings, polymers, tapes, encapsulants, and other specialty chemical products worldwide. The company operates through five segments: Americas Adhesives, EIMEA, Asia Pacific, Construction Adhesives, and Engineering Adhesives. It produces and supplies industrial adhesives products for applications in various markets, including appliances, filters, and insulating glass; food and beverage containers, flexible packaging, consumer goods, package integrity and re-enforcement, and durable and non-durable goods; corrugation, folding carton, tape and label, paper converting, envelopes, books, multi-wall bags, sacks, and tissue and towel; nonwoven and hygiene, such as disposable diapers, feminine care, and medical garments; windows, doors, and wood flooring; and insulating glass and textile. The company also provides specialty adhesives, including thermoplastic, thermoset, reactive, water-based, and solvent-based products; and products used for tile setting, commercial roofing, heating, ventilation, and air conditioning and insulation applications, as well as caulks and sealants for the consumer market and professional trade. In addition, it produces and supplies high performance industrial adhesives to the transportation, electronics, medical, clean energy, aerospace and defense, appliance, and heavy machinery markets. The company sells its products directly through distributors and retailers. H.B. Fuller Company was founded in 1887 and is headquartered in Saint Paul, Minnesota.", "industry_name": "Chemicals", "sector_name": "Materials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2056958631, "total_enterprise": 4008226631, "number_of_employees": 6369, "outstanding_shares": 51411113, "eps": 2.516229, "diluted_eps": 2.464512, "earnings_from_cont_operations": 128502000, "gross_profit": 799025000, "cash": 78738000, "total_debt": 2029554000, "total_revenue": 2870629000, "cash_from_operations": 303111000, "net_income": 128468000, "ebitda": 388083000, "year_low_stock_price": 23.68, "year_high_stock_price": 52.4, "seekingalpha_follower_count": 2257, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/FUL.png"}