{"symbol": "GBCI", "name": "Glacier Bancorp", "next_earnings_utc": 1595536200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 187839200.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.59286, "eps_up_revisions": 3, "eps_down_revisions": 4, "revenue_up_revisions": 4, "revenue_down_revisions": 1, "total_analysts": 7, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "glacierbancorp.com", "year_founded": 2004, "street_address": "49 Commons Loop", "city": "Kalispell", "state": "MT", "zipcode": "59901", "country": "United States", "phone_number": "406-756-4200", "short_description": "Glacier Bancorp, Inc. operates as the holding company for Glacier Bank that provides commercial banking services to individuals, small to medium-sized businesses, community organizations, and public entities in the United States.", "long_description": "Glacier Bancorp, Inc. operates as the holding company for Glacier Bank that provides commercial banking services to individuals, small to medium-sized businesses, community organizations, and public entities in the United States. It offers non-interest bearing deposit and interest bearing deposit accounts, such as negotiable order of withdrawal and demand deposit accounts, savings accounts, money market deposit accounts, fixed rate certificates of deposits, negotiated-rate jumbo certificates, and individual retirement accounts. The company also provides construction and permanent loans on residential real estate; consumer land or lot acquisition loans; unimproved land and land development loans; and residential builder guidance lines comprising pre-sold and spec-home construction, and lot acquisition loans. In addition, it offers commercial real estate loans to purchase, construct, and finance commercial real estate properties; consumer loans secured by real estate, automobiles, or other assets; second mortgage loans; municipal loans; home equity loans consisting of 1-4 family junior lien mortgages, and first and junior lien lines of credit secured by residential real estate; and agriculture loans. Further, the company provides mortgage origination services. Glacier Bancorp, Inc. has 181 locations, including 164 branches and 17 loan or administration offices in 66 counties within 8 states comprising Montana, Idaho, Utah, Washington, Wyoming, Colorado, Arizona, and Nevada. The company was incorporated in 2004 and is headquartered in Kalispell, Montana.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 3929579258, "total_enterprise": null, "number_of_employees": 2924, "outstanding_shares": 95401293, "eps": 2.26395, "diluted_eps": 2.254858, "earnings_from_cont_operations": 204751000, "gross_profit": 634919000, "cash": 274240000, "total_debt": 1311772000, "total_revenue": 634919000, "cash_from_operations": 206104000, "net_income": 204751000, "ebitda": null, "year_low_stock_price": 26.66, "year_high_stock_price": 46.51, "seekingalpha_follower_count": 1398, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GBCI.png"}