{"symbol": "GILT", "name": "Gilat Satellite Networks", "next_earnings_utc": 1591703700, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "gilat.com", "year_founded": 1987, "street_address": "Gilat House", "city": "Petah Tikva", "state": null, "zipcode": "4913020", "country": "Israel", "phone_number": "972 3 925 2000", "short_description": "Gilat Satellite Networks Ltd., together with its subsidiaries, provides satellite-based broadband communication solutions and services in Latin America, the Asia Pacific, North America, Europe, the Middle East, and Africa.", "long_description": "Gilat Satellite Networks Ltd., together with its subsidiaries, provides satellite-based broadband communication solutions and services in Latin America, the Asia Pacific, North America, Europe, the Middle East, and Africa. It operates through three segments: Fixed Networks, Mobility Solutions, and Terrestrial Infrastructure Projects. The company designs and manufactures ground-based satellite communications equipment; and provides solutions and end-to-end services. Its portfolio consists of a cloud-based satellite network platform, very small aperture terminals, amplifiers, modems, on-the-move antennas, solid state amplifiers, block upconverters, transceivers, low-profile antennas, and on-the-move/on-the-pause terminals. In addition, the company offers various solutions, including managed satellite network services, network planning and optimization, satellite capacity, remote network operation, call center support, hub and field operations, and communication networks construction and installation services. Further, it provides connectivity services, internet access, and telephony services to enterprise, government, and residential customers; and builds telecommunication infrastructure using fiber-optic and wireless technologies for broadband connectivity. Gilat Satellite Networks Ltd. sells its products and solutions to communication service providers and operators, mobile network operators, telecommunication companies, and system integrators, as well as to defense and homeland security organizations, and directly to end-users. The company was founded in 1987 and is headquartered in Petah Tikva, Israel.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 463923636, "total_enterprise": 402476636, "number_of_employees": 864, "outstanding_shares": 55493258, "eps": 0.659903, "diluted_eps": 0.649999, "earnings_from_cont_operations": 36538000, "gross_profit": 95877000, "cash": 74778000, "total_debt": 13331000, "total_revenue": 263492000, "cash_from_operations": 34782000, "net_income": 36538000, "ebitda": 36550000, "year_low_stock_price": 4.7, "year_high_stock_price": 10.76, "seekingalpha_follower_count": 1913, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GILT.png"}