{"symbol": "GIS", "name": "General Mills", "next_earnings_utc": 1593601200, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 4891631750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.04558, "eps_up_revisions": 12, "eps_down_revisions": 5, "revenue_up_revisions": 16, "revenue_down_revisions": 0, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 15, "analysts_underperform": 2, "webpage": "generalmills.com", "year_founded": 1866, "street_address": "Number One General Mills Boulevard", "city": "Minneapolis", "state": "MN", "zipcode": "55426", "country": "United States", "phone_number": "763-764-7600", "short_description": "General Mills, Inc. manufactures and markets branded consumer foods worldwide.", "long_description": "General Mills, Inc. manufactures and markets branded consumer foods worldwide. The company operates in five segments: North America Retail; Convenience Stores & Foodservice; Europe & Australia; Asia & Latin America; and Pet. It offers ready-to-eat cereals, refrigerated yogurt, soup, meal kits, refrigerated and frozen dough products, dessert and baking mixes, frozen pizza and pizza snacks, grain, fruit, and savory snacks, as well as organic products, including refrigerated yogurt, nutrition bars, meal kits, salty snacks, ready-to-eat cereal, and grain snacks. It also supplies branded and unbranded food products to the North American foodservice and commercial baking industries; and manufactures and markets pet food products, including dog and cat food. The company markets its products under the Annie’s, Betty Crocker, Bisquick, Blue Buffalo, BLUE Basics, BLUE Freedom, BLUE Wilderness, Bugles, Cascadian Farm, Cheerios, Chex, Cinnamon Toast Crunch, Cocoa Puffs, Cookie Crisp, EPIC, Fiber One, Food Should Taste Good, Fruit by the Foot, Fruit Gushers, Fruit Roll-Ups, Gardetto’s, Go-Gurt, Gold Medal, Golden Grahams, Häagen-Dazs, Helpers, Jeno’s, Jus-Rol, Kitano, Kix, Lärabar, Latina, Liberté, Lucky Charms, Muir Glen, Nature Valley, Oatmeal Crisp, Old El Paso, Pillsbury, Progresso, Raisin Nut Bran, Total, Totino’s, Trix, Wanchai Ferry, Wheaties, Yoki, and Yoplait trademarks. General Mills, Inc. sells its products directly, as well as through broker and distribution arrangements to grocery stores, mass merchandisers, membership stores, natural food chains, e-commerce retailers, commercial and noncommercial foodservice distributors and operators, restaurants, convenience stores, and pet specialty stores, as well as drug, dollar, and discount chains. It operates 525 leased and 365 franchise branded ice cream parlors. General Mills, Inc. was founded in 1866 and is headquartered in Minneapolis, Minnesota.", "industry_name": "Food Products", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 37259359289, "total_enterprise": 51514559289, "number_of_employees": 40000, "outstanding_shares": 606138918, "eps": 3.506309, "diluted_eps": 3.477744, "earnings_from_cont_operations": 2165000000, "gross_profit": 5858100000, "cash": 606900000, "total_debt": 14038500000, "total_revenue": 16765300000, "cash_from_operations": 2939200000, "net_income": 2125700000, "ebitda": 3643200000, "year_low_stock_price": 46.59, "year_high_stock_price": 64.31, "seekingalpha_follower_count": 61366, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GIS.png"}