{"symbol": "GMAB", "name": "Genmab A/S", "next_earnings_utc": 1591070400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 157040213.0599748, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.1625, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 1, "revenue_down_revisions": 0, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 3, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "genmab.com", "year_founded": 1999, "street_address": "Kalvebod Brygge 43", "city": "Copenhagen", "state": null, "zipcode": "1560", "country": "Denmark", "phone_number": "45 70 20 27 28", "short_description": "Genmab A/S, a biotechnology company, develops antibody therapeutics for the treatment of cancer primarily in Denmark.", "long_description": "Genmab A/S, a biotechnology company, develops antibody therapeutics for the treatment of cancer primarily in Denmark. The company markets DARZALEX, a human IgG1k monoclonal antibody for the treatment of patients with multiple myeloma (MM); and Arzerra, a human IgG1k monoclonal antibody for the treatment of chronic lymphocytic leukemia (CLL). Its products under development include Ofatumumab to treat CLL and multiple sclerosis; Daratumumab to treat MM, natural killer/T-cell lymphoma, and amyloidosis; Tisotumab vedotin for treating cervical, ovarian, and solid cancers; HuMax-AXL-ADC, and HexaBody-DR5/DR5 for treating solid cancers; and DuoBody-CD3xCD20 for the treatment of B-cell malignancies. The company's products under development also comprise Teprotumumab for the treatment of Graves' orbitopathy; Camidanlumab tesirine (ADCT-301) to treat lymphoma, solid tumors, and acute myeloid leukemia (AML); HuMax-IL8 (BMS-986253) for treating advanced cancers; JNJ-61186372 for the treatment of non-small-cell lung cancer; JNJ-63709178 to treat AML; JNJ-64007957 and JNJ-64407564 for MM; and Lu AF82422 for treating Parkinson's disease. In addition, it has approximately 20 active pre-clinical programs, including naked, bispecific, and immune effector function enhanced antibodies. The company has a commercial license and collaboration agreement with Seattle Genetics, Inc. to co-develop tisotumab vedotin, an antibody-drug conjugate; and a strategic collaboration agreement with Tempus to advance various disease targets and biomarkers, as well as Rentschler Biopharma SE. It also has a research collaboration and license agreement with Immatics Biotechnologies GmbH to research and develop next-generation bispecific immunotherapies for treating multiple cancer indications; CureVac AG for the research and development of differentiated mRNA-based antibody products; and a research agreement with Tavotek Biotherapeutics. Genmab A/S was founded in 1999 and is based in Copenhagen, Denmark.", "industry_name": "Biotechnology", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 20024926227, "total_enterprise": 18120967017, "number_of_employees": 548, "outstanding_shares": 65280093, "eps": 5.45602064999616, "diluted_eps": 5.39574071666243, "earnings_from_cont_operations": 349140963, "gross_profit": 837317746, "cash": 1914882300, "total_debt": 25709068, "total_revenue": 837317746, "cash_from_operations": 424051867, "net_income": 349140963, "ebitda": 426526734, "year_low_stock_price": 24.13, "year_high_stock_price": 31.3, "seekingalpha_follower_count": 3347, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GMAB.png"}