{"symbol": "GNBT", "name": "Generex Biotechnology", "next_earnings_utc": 1593007200, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "generex.com", "year_founded": 1983, "street_address": "10102 USA Today Way", "city": "Miramar", "state": "FL", "zipcode": "33025", "country": "United States", "phone_number": "416-364-2551", "short_description": "Generex Biotechnology Corporation, through its subsidiaries, engages in the administration of formulations of large molecule drugs to the oral cavity using a hand-held aerosol applicator in Canada and the United States.", "long_description": "Generex Biotechnology Corporation, through its subsidiaries, engages in the administration of formulations of large molecule drugs to the oral cavity using a hand-held aerosol applicator in Canada and the United States. It offers Generex Oral-lyn, an oral insulin product. The company is also developing AE37, a synthetic peptide vaccine, which has completed Phase IIb clinical trial to stimulate a potent and specific immune response against tumors expressing the HER-2/neu oncogene in patients with breast cancer and prostate cancer. In addition, it develops, manufactures, and distributes rapid point-of-care in-vitro medical diagnostics for infectious diseases, such as human immunodeficiency virus, tuberculosis, malaria, hepatitis B, hepatitis C, syphilis, and others; and test kits and cassettes for testing infectious diseases, as well as Excellagen, a wound conforming gel. Further, the company is developing immunotherapeutic products and vaccines; and extracellular matrix hydrogel solution, a tissue engineered therapy for the treatment of Ulcerative Colitis. Additionally, it manufactures and sells foot and ankle kits with surgical plates, screws, and tools; and distributes surgical supplies, orthopedic implants, and biologics, including human placental derived tissue products for regenerative medicine applications. It also serves as the general partner of the Management Services Organization. Generex Biotechnology Corporation was founded in 1983 and is headquartered in Miramar, Florida.", "industry_name": "Biotechnology", "sector_name": "Health Care", "is_defunct": false, "exchange": "OTCQB", "equity_type": "stocks", "market_cap": 49280057, "total_enterprise": 79525036, "number_of_employees": 17, "outstanding_shares": 78222313, "eps": -0.401801, "diluted_eps": -0.401801, "earnings_from_cont_operations": -32997367, "gross_profit": 1066006, "cash": 269069, "total_debt": 12010230, "total_revenue": 2621436, "cash_from_operations": -10201870, "net_income": -31135254, "ebitda": -25513873, "year_low_stock_price": 0.2982, "year_high_stock_price": 2.34, "seekingalpha_follower_count": 1146, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GNBT.png"}