{"symbol": "GS", "name": "The Goldman Sachs Group", "next_earnings_utc": 1594812000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 8446711720.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 3.03649, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 1, "revenue_down_revisions": 12, "total_analysts": 26, "analysts_sell": 0, "analysts_buy": 9, "analysts_outperform": 6, "analysts_hold": 11, "analysts_underperform": 0, "webpage": "goldmansachs.com", "year_founded": 1869, "street_address": "200 West Street", "city": "New York", "state": "NY", "zipcode": "10282", "country": "United States", "phone_number": "212-902-1000", "short_description": "The Goldman Sachs Group, Inc. operates as an investment banking, securities, and investment management company worldwide.", "long_description": "The Goldman Sachs Group, Inc. operates as an investment banking, securities, and investment management company worldwide. It operates in four segments: Investment Banking, Global Markets, Asset Management, and Consumer & Wealth Management. The company's Investment Banking segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and middle-market lending, relationship lending, and acquisition financing, as well as transaction banking services. This segment also offers underwriting services, such as equity underwriting for common and preferred stock and convertible and exchangeable securities; and debt underwriting for various types of debt instruments, including investment-grade and high-yield debt, bank and bridge loans, and emerging- and growth-market debt. Its Global Markets segment is involved in client execution activities for cash and derivative instruments; credit products; mortgages; currencies; commodities; and equities; and provision of equity intermediation, and equity financing services, as well as offers clearing, settlement and custody services. The company's Asset Management segment manages assets across various asset classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, and financing services, as well as invests in corporate, real estate, and infrastructure entities. Its Consumer & Wealth Management segment offers wealth advisory and banking services, including financial planning, investment management, and lending; private banking and lending services; unsecured loans; and saving and time deposits. The company serves corporations, financial institutions, governments, and individuals. The Goldman Sachs Group, Inc. was founded in 1869 and is headquartered in New York, New York.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 70458453891, "total_enterprise": null, "number_of_employees": 38300, "outstanding_shares": 358585444, "eps": 18.607128, "diluted_eps": 18.472344, "earnings_from_cont_operations": 7428000000, "gross_profit": 30037000000, "cash": 675835000000, "total_debt": 473881000000, "total_revenue": 34704000000, "cash_from_operations": 15205000000, "net_income": 7428000000, "ebitda": null, "year_low_stock_price": 130.85, "year_high_stock_price": 250.46, "seekingalpha_follower_count": 163686, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GS.png"}