{"symbol": "GSM", "name": "Ferroglobe", "next_earnings_utc": 1591651200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "ferroglobe.com", "year_founded": 2015, "street_address": "Lansdowne House", "city": "London", "state": null, "zipcode": "W1J 6ER", "country": "United Kingdom", "phone_number": "44 20 3129 2420", "short_description": "Ferroglobe PLC operates in the silicon and specialty metals industry in the United States, Europe, and internationally.", "long_description": "Ferroglobe PLC operates in the silicon and specialty metals industry in the United States, Europe, and internationally. The company offers silicone chemicals used in a range of applications, including personal care items, construction-related products, health care products, and electronics, as well as silicon metal for primary and secondary aluminum producers; silicomanganese, which is used as deoxidizing agent in the steel manufacturing process; and ferromanganese that is used as a deoxidizing, desulphurizing, and degassing agent in the removal of nitrogen and other harmful elements from steel. It also provides ferrosilicon products that are used to produce stainless steel, carbon steel, and various other steel alloys, as well as to manufacture electrodes and aluminum; calcium silicon, which is used in the deoxidation and desulfurization of liquid steel, and production of coatings for cast iron pipes, as well as in the welding process of powder metal; nodularizers and inoculants, which are used in the production of iron; and silica fume, a by-product of the electrometallurgical process of silicon metal and ferrosilicon. In addition, the company operates quartz mines in Spain, the United States, Canada, South Africa, and Mauritania; and low-ash metallurgical coal mines in the United States, as well as holds interests in hydroelectric power in Spain and France. It serves silicone chemical, aluminum, and steel manufacturers; auto companies and their suppliers; ductile iron foundries; manufacturers of photovoltaic solar cells and computer chips; and concrete producers. The company was formerly known as VeloNewco Limited and changed its name to Ferroglobe PLC in December 2015. The company was founded in 2015 and is headquartered in London, the United Kingdom. Ferroglobe PLC is a subsidiary of Grupo Villar Mir, S.A.U.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 120330788, "total_enterprise": 621912788, "number_of_employees": 4368, "outstanding_shares": 169122682, "eps": -1.671167, "diluted_eps": -1.671167, "earnings_from_cont_operations": -369454000, "gross_profit": 402943000, "cash": 104779000, "total_debt": 606361000, "total_revenue": 1603046000, "cash_from_operations": -65492000, "net_income": -282683000, "ebitda": -64407000, "year_low_stock_price": 0.35, "year_high_stock_price": 2.0, "seekingalpha_follower_count": 2504, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GSM.png"}