{"symbol": "GSUM", "name": "Gridsum Holding", "next_earnings_utc": 1592857800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "gridsum.com", "year_founded": 2005, "street_address": "High Technology Building", "city": "Beijing", "state": null, "zipcode": "100083", "country": "China", "phone_number": "86 10 8261 9988", "short_description": "Gridsum Holding Inc. provides data analysis software for enterprises and government agencies in China.", "long_description": "Gridsum Holding Inc. provides data analysis software for enterprises and government agencies in China. Its proprietary distributed data architecture allows its customers to collect and analyze information; and Gridsum Big Data platform and Gridsum Prophet performs multi-dimensional correlation analysis and analyzes complex real-time events. The company offers Web Dissector to analyze customer Websites by monitoring and analyzing key performance indicators; Mobile Dissector to understand mobile app user activity; SEM Dissector for search engine marketing; SEO Dissector, a search engine optimization tool; Ad Dissector, an advertisement performance monitoring and optimization product; Contribution Dissector to track and analyze user behavior; Audience Dissector, an audience analysis product; and Recommendation Engine, a data driven content recommendation solution. It also provides Government Web Dissector, a digital intelligence solution; Government Website Group Integrated Management Platform, an integrated management platform; Streaming Dissector, a real-time viewership analysis for digital online video; Video Dissector, an online video content analytics tool; TV Dissector, an analytics tool; Rating Plus, a television viewing data analytics tool; and Media Dissector, a mass, social, and user-generated content media monitoring and analytics tool. In addition, the company offers Law Dissector and Smart Push, a search and statistical analysis tool; Smart Push, a legal research tool; voice recognition and transcription system; Information Dissector, an analytical system; Social Listening, a cloud-based social listening solution; Gridsum Dashboard, a data visualization tool; and Gridsum Report Center, an automated report generation and distribution tool. Further, it develops media analytics and information discovery solutions. Gridsum Holding Inc. has a strategic alliance with ShineWing. The company was founded in 2005 and is headquartered in Beijing, China.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 29473418, "total_enterprise": 104666059, "number_of_employees": 1192, "outstanding_shares": 34540511, "eps": -2.37129997341281, "diluted_eps": -2.37134153338091, "earnings_from_cont_operations": -77936555, "gross_profit": 27008242, "cash": 5977499, "total_debt": 79873921, "total_revenue": 40589816, "cash_from_operations": null, "net_income": -77954606, "ebitda": -76136707, "year_low_stock_price": 0.24, "year_high_stock_price": 3.55, "seekingalpha_follower_count": 1061, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GSUM.png"}