{"symbol": "GVA", "name": "Granite Construction Incorporated", "next_earnings_utc": 1591959300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 827491000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.32, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 1, "webpage": "graniteconstruction.com", "year_founded": 1922, "street_address": "585 West Beach Street", "city": "Watsonville", "state": "CA", "zipcode": "95076", "country": "United States", "phone_number": "831-724-1011", "short_description": "Granite Construction Incorporated operates as an infrastructure contractor and a construction materials producer in the United States.", "long_description": "Granite Construction Incorporated operates as an infrastructure contractor and a construction materials producer in the United States. The company operates through Transportation, Water, Specialty, and Materials segments. The Transportation segment engages in the construction and rehabilitation of roads, pavement preservation, bridges, rail lines, airports, and marine ports. The Water segment focuses on water-related construction and water management solutions, as well as provides trenchless cured-in-place pipe rehabilitation services. The Specialty segment constructs various complex projects, including infrastructure/site development, mining, public safety, tunnel, and power projects; and undertakes bid-build, design-build, and construction management/general contractor contracts. The Materials segment focuses on production of aggregates, asphalt, and construction related materials, as well as sanitary and storm water rehabilitation products, such as cured-in-place pipe felt and fiberglass-based lining tubes. The company also engages in the construction of streets, highways, mass transit facilities, trenchless and underground utilities, tunnels, dams, and other infrastructure-related projects. In addition, it performs site preparation and infrastructure services for residential development, energy development, commercial and industrial sites, and other facilities; and provides construction management professional services. The company serves federal agencies, state departments of transportation, local transit authorities, county and city public works departments, school districts and developers, utilities, contractors, landscapers, manufacturers of products requiring aggregate materials, retailers, homeowners, farmers, brokers, and private owners of industrial, commercial, and residential sites. Granite Construction Incorporated was founded in 1922 and is headquartered in Watsonville, California.", "industry_name": "Construction and Engineering", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 800471073, "total_enterprise": 892046073, "number_of_employees": 2700, "outstanding_shares": 45481311, "eps": -2.251142, "diluted_eps": -2.255139, "earnings_from_cont_operations": -92742000, "gross_profit": 187555000, "cash": 432356000, "total_debt": 481371000, "total_revenue": 3389776000, "cash_from_operations": 45149000, "net_income": -105376000, "ebitda": 9967000, "year_low_stock_price": 8.9, "year_high_stock_price": 48.8, "seekingalpha_follower_count": 2794, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GVA.png"}