{"symbol": "GWRE", "name": "Guidewire Software, Inc.", "next_earnings_utc": 1591218000, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 152064120.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.05229, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 6, "total_analysts": 15, "analysts_sell": 1, "analysts_buy": 3, "analysts_outperform": 3, "analysts_hold": 8, "analysts_underperform": 0, "webpage": "guidewire.com", "year_founded": 2001, "street_address": "2850 South Delaware Street", "city": "San Mateo", "state": "CA", "zipcode": "94403", "country": "United States", "phone_number": "650-357-9100", "short_description": "Guidewire Software, Inc. provides software products for property and casualty insurers worldwide.", "long_description": "Guidewire Software, Inc. provides software products for property and casualty insurers worldwide. The company offers Guidewire InsuranceSuite comprising Guidewire PolicyCenter, BillingCenter, and ClaimCenter applications. It also provides Guidewire InsuranceNow, a cloud-based platform, which offers policy, billing, and claims management functionality to insurers that prefer to subscribe to a cloud-based solution. In addition, the company offers Guidewire Underwriting Management, a cloud-based integrated business application; Guidewire Rating Management to manage the pricing of insurance products; Guidewire Reinsurance Management to use rules-based logic to execute reinsurance strategy through underwriting and claims processes; and Guidewire Client Data Management to enable customer information management. Further, it provides Guidewire Product Content Management that offers software tools and standards-based line-of-business templates to introduce and modify products; Guidewire AppReader, a submission intake management solution; and Guidewire London Market Messaging that provides a message-processing and action framework. Additionally, the company offers data management and analytics products, such as Guidewire DataHub, an operational data store; Guidewire InfoCenter, a business intelligence warehouse; Guidewire Live Analytics, a cloud analytics platform; Guidewire Predictive Analytics, a cloud-based tool; and Guidewire Cyence Risk Analytics, a cloud-native economic cyber risk modeling solution, as well as Digital Engagement Applications, which enable insurers to provide digital experiences to customers, agents, vendors, and field personnel through their device of choice. It also provides implementation and integration, maintenance support, and professional services, as well as Guidewire Production Services. The company was founded in 2001 and is headquartered in San Mateo, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 8502419722, "total_enterprise": 7873316722, "number_of_employees": 2355, "outstanding_shares": 82885745, "eps": -0.249554, "diluted_eps": -0.250407, "earnings_from_cont_operations": -20511000, "gross_profit": 373679000, "cash": 1064686000, "total_debt": 435583000, "total_revenue": 701193000, "cash_from_operations": 130421000, "net_income": -20511000, "ebitda": 3944000, "year_low_stock_price": 71.64, "year_high_stock_price": 124.16, "seekingalpha_follower_count": 5586, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/GWRE.png"}