{"symbol": "HAL", "name": "Halliburton Company", "next_earnings_utc": 1595241900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 3531666020.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.11222, "eps_up_revisions": 0, "eps_down_revisions": 23, "revenue_up_revisions": 0, "revenue_down_revisions": 20, "total_analysts": 31, "analysts_sell": 2, "analysts_buy": 7, "analysts_outperform": 3, "analysts_hold": 19, "analysts_underperform": 0, "webpage": "halliburton.com", "year_founded": 1919, "street_address": "3000 North Sam Houston Parkway East", "city": "Houston", "state": "TX", "zipcode": "77032", "country": "United States", "phone_number": "281 871 2699", "short_description": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide.", "long_description": "Halliburton Company provides a range of services and products to oil and natural gas companies worldwide. The company's Completion and Production segment offers production enhancement services, including stimulation and sand control services; and cementing services, such as well bonding and casing, as well as provides casing equipment. It also provides completion tools that offer downhole solutions and services, including well completion products and services, intelligent well completions, liner hanger and sand control systems, and service tools; production solutions comprising coiled tubing, hydraulic workover units, and downhole tools; and pipeline and process services, such as pre-commissioning, commissioning, maintenance, and decommissioning. In addition, this segment offers oilfield completion, production, and downstream water and process treatment chemicals and services; and electrical submersible pumps, as well as artificial lift services. The company's Drilling and Evaluation segment provides drilling fluid systems, performance additives, completion fluids, solids control, specialized testing equipment, and waste management services; and drilling systems and services. It also offers wireline and perforating services, including open-hole logging, and cased-hole and slickline; and drill bits and services comprising roller cone rock bits, fixed cutter bits, hole enlargement, and related downhole tools and services, as well as coring equipment and services. In addition, this segment provides integrated exploration, drilling, and production software, as well as related professional and data management services; testing and subsea services, such as acquisition and analysis of reservoir information and optimization solutions; and project management and integrated asset management services. Halliburton Company was founded in 1919 and is based in Houston, Texas.", "industry_name": "Energy Equipment and Services", "sector_name": "Energy", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 10308012622, "total_enterprise": 19787012622, "number_of_employees": 55000, "outstanding_shares": 877277670, "eps": -2.624821, "diluted_eps": -2.624821, "earnings_from_cont_operations": -2296000000, "gross_profit": 2356000000, "cash": 1385000000, "total_debt": 10851000000, "total_revenue": 21708000000, "cash_from_operations": 2714000000, "net_income": -2300000000, "ebitda": 3089000000, "year_low_stock_price": 4.25, "year_high_stock_price": 25.47, "seekingalpha_follower_count": 99659, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HAL.png"}