{"symbol": "HBAN", "name": "Huntington Bancshares Incorporated", "next_earnings_utc": 1595503800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1126295890.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.06813, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 22, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 3, "analysts_hold": 17, "analysts_underperform": 0, "webpage": "huntington.com", "year_founded": 1866, "street_address": "Huntington Center", "city": "Columbus", "state": "OH", "zipcode": "43287", "country": "United States", "phone_number": "614-480-2265", "short_description": "Huntington Bancshares Incorporated operates as a holding company for The Huntington National Bank that provides commercial, small business, consumer, and mortgage banking services.", "long_description": "Huntington Bancshares Incorporated operates as a holding company for The Huntington National Bank that provides commercial, small business, consumer, and mortgage banking services. The company operates through four business segments: Consumer and Business Banking, Commercial Banking, Vehicle Finance, and Regional Banking and The Huntington Private Client Group (RBHPCG). The Consumer and Business Banking segment offers financial products and services, such as checking accounts, savings accounts, money market accounts, certificates of deposit, consumer loans, mortgage loans, credit cards, and small business loans, as well as investment products. It also provides insurance, interest rate risk protection, foreign exchange, and treasury management services, as well as online, mobile, and telephone banking services. The Commercial Banking segment offers banking solutions and asset finance services; corporate risk management services; institutional sales, trading, and underwriting services; institutional corporate banking services; treasury management services; and other financing solutions, as well as lends real estate developers, REITs, and other customers. The Vehicle Finance segment provides financing to consumers for the purchase of automobiles, light-duty trucks, recreational vehicles, and marine craft at franchised and other select dealerships, as well as to franchised dealerships for the acquisition of new and used inventory. The RBHPCG segment provides deposits, lending, banking, wealth management, investment and portfolio management, fiduciary administration, trust, retirement plan, and institutional and mutual fund custody services. As of December 31, 2018, the company operated through 944 branches located in Ohio, Michigan, Pennsylvania, Indiana, Illinois, Wisconsin, West Virginia, and Kentucky; and 10 private client group offices. Huntington Bancshares Incorporated was founded in 1866 and is headquartered in Columbus, Ohio.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 9016398855, "total_enterprise": null, "number_of_employees": 15664, "outstanding_shares": 1014218094, "eps": 0.996604, "diluted_eps": 0.983726, "earnings_from_cont_operations": 1101000000, "gross_profit": 4025000000, "cash": 3086000000, "total_debt": 12928000000, "total_revenue": 4025000000, "cash_from_operations": 1575000000, "net_income": 1101000000, "ebitda": null, "year_low_stock_price": 6.82, "year_high_stock_price": 15.63, "seekingalpha_follower_count": 18251, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HBAN.png"}