{"symbol": "HDB", "name": "HDFC Bank", "next_earnings_utc": 1595239200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2749304736.005595, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.373, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "hdfcbank.com", "year_founded": 1994, "street_address": "HDFC Bank House", "city": "Mumbai", "state": null, "zipcode": "400013", "country": "India", "phone_number": "91 22 6652 1000", "short_description": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai.", "long_description": "HDFC Bank Limited provides various banking and financial services to individuals and businesses in India, Bahrain, Hong Kong, and Dubai. It operates in Treasury, Retail Banking, Wholesale Banking, and Other Banking Business segments. The company accepts savings, salary, current, and Demat accounts; fixed and recurring deposits; and safe deposit lockers, and rural and pension accounts, as well as offshore accounts and deposits, overdrafts against fixed deposits and salaries, and sweep-in facilities. It also provides personal, home, car, two wheeler, three wheeler, business, educational, gold, rural, and term loans; loans against properties, assets, and securities; loans for professionals; government sponsored programs; and loans on credit card, as well as working capital and commercial/construction equipment finance, term and professional loans, healthcare/medical equipment and commercial vehicle finance, and dealer finance. In addition, the company offers credit, debit, prepaid, and forex cards; forex, premier and private banking, payment and collection, export, import, remittance, bank guarantee, letter of credit, trade, hedging, loan syndication, and merchant and cash management services; and insurance and investment products. Further, it provides short term finance, bill discounting, structured finance, export credit, documents collection, Internet and wholesale banking, mobile banking, real time gross settlement, channel financing, vendor financing, reimbursement account, money market, derivatives, employee trusts, cash surplus corporates, tax payment, and bankers to rights/public issue services, as well as financial solutions for supply chain partners and agricultural customers. As of June 30, 2019, it had 5,130 branches and 13,395 automated teller machines in 2,764 cities/towns. HDFC Bank Limited was founded in 1994 and is based in Mumbai, India.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 69164990357, "total_enterprise": null, "number_of_employees": 66076, "outstanding_shares": 5486321260, "eps": 0.660171008152714, "diluted_eps": 0.656194074368662, "earnings_from_cont_operations": 3618515278, "gross_profit": 9442687082, "cash": 11657731822, "total_debt": 24767589315, "total_revenue": 9442687082, "cash_from_operations": -2236241798, "net_income": 3612906476, "ebitda": null, "year_low_stock_price": 29.5, "year_high_stock_price": 65.89, "seekingalpha_follower_count": 10279, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HDB.png"}