{"symbol": "HDS", "name": "HD Supply Holdings", "next_earnings_utc": 1591696800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1375278750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.56158, "eps_up_revisions": 2, "eps_down_revisions": 11, "revenue_up_revisions": 0, "revenue_down_revisions": 9, "total_analysts": 15, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 2, "analysts_hold": 8, "analysts_underperform": 0, "webpage": "hdsupply.com", "year_founded": 2007, "street_address": "3400 Cumberland Boulevard SE", "city": "Atlanta", "state": "GA", "zipcode": "30339", "country": "United States", "phone_number": "770-852-9000", "short_description": "HD Supply Holdings, Inc. operates as an industrial distributor in North America.", "long_description": "HD Supply Holdings, Inc. operates as an industrial distributor in North America. It operates through two segments, Facilities Maintenance, and Construction & Industrial. The Facilities Maintenance segment offers electrical and lighting items, plumbing supplies, appliances, janitorial supplies, hardware products, kitchen and bath cabinets, window coverings, textiles and guest amenities, healthcare maintenance products, and water and wastewater treatment products, as well as heating, ventilating, and air conditioning products. The Construction & Industrial segment provides tilt-up brace systems, forming and shoring systems, concrete chemicals, hand and power tools, cutting tools, rebars, ladders, safety and fall arrest equipment, specialty screws and fasteners, sealants and adhesives, drainage pipes, geo-synthetics, erosion and sediment control equipment, and other engineered materials used in non-residential and residential construction. This segment also offers home improvement solutions, such as light remodeling and construction supplies, kitchen and bath cabinets, windows, plumbing materials, electrical equipment, and other products primarily to small remodeling contractors and trade professionals through local retail outlets. In addition, it provides pre-bid assistance, product submittals, engineering, and tool repair services. The company serves contractors, maintenance professionals, home builders, industrial businesses, and government entities through a network of branches and professional sales force, as well as through print catalogs and e-commerce. The company was formerly known as HDS Investment Holding, Inc. and changed its name to HD Supply Holdings, Inc. in April 2013. HD Supply Holdings, Inc. was founded in 2007 and is headquartered in Atlanta, Georgia.", "industry_name": "Trading Companies and Distributors", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5136585002, "total_enterprise": 7691585002, "number_of_employees": 11500, "outstanding_shares": 161986282, "eps": 2.716264, "diluted_eps": 2.705988, "earnings_from_cont_operations": 451000000, "gross_profit": 2403000000, "cash": 34000000, "total_debt": 2589000000, "total_revenue": 6146000000, "cash_from_operations": 677000000, "net_income": 452000000, "ebitda": 825000000, "year_low_stock_price": 21.69, "year_high_stock_price": 43.29, "seekingalpha_follower_count": 4213, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HDS.png"}