{"symbol": "HNP", "name": "Huaneng Power International", "next_earnings_utc": 1593525600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 1, "webpage": "hpi.com.cn", "year_founded": 1994, "street_address": "Huaneng Building", "city": "Beijing", "state": null, "zipcode": "100031", "country": "China", "phone_number": "86 10 6322 6999", "short_description": "Huaneng Power International, Inc., through its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China, Singapore, and Pakistan.", "long_description": "Huaneng Power International, Inc., through its subsidiaries, generates and sells electricity and heat to the regional or provincial grid companies in the People's Republic of China, Singapore, and Pakistan. It is involved in the development, investment, construction, operation, and management of power plants and related projects; and generation, wholesale, and retail of power and other relating utilities. The company generates power from coal, wind, solar, gas, oil, biomass, and hydro resources. It is also involved in the sale of coal ash and lime; provision of cargo loading and storage, port, warehousing, and conveying services; photovoltaic power generation projects development and construction; and provision of thermal energy and cold energy services, as well as thermal heating services. In addition, the company engages in the repair of power equipment; provision of water supply and transportation services; construction and operation of electricity distribution networks and heating pipe networks; energy supply, energy transmission, and substation project contracting activities; cargo transportation; and port management, investment, and development activities. Further, it is involved in the management of industrial water and waste, as well as provides environment engineering, and information technology and management consulting services. Additionally, it sells raw and processed coal; and provides central heat, and plumbing and pipe installation services, as well as desalinated water. As of December 31, 2019, the company had controlled generating capacity of 106,924 megawatts and a total generating capacity of 93,676 megawatts. Huaneng Power International, Inc. was founded in 1994 and is headquartered in Beijing, the People's Republic of China.", "industry_name": "Independent Power and Renewable Electricity Producers", "sector_name": "Utilities", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 8264625605, "total_enterprise": 43665042641, "number_of_employees": 58263, "outstanding_shares": 15698093359, "eps": 0.00352304977056124, "diluted_eps": 0.00301277797387928, "earnings_from_cont_operations": 228969972, "gross_profit": 3466032253, "cash": 2103138845, "total_debt": 34749209244, "total_revenue": 23746476387, "cash_from_operations": 4896394037, "net_income": 154029413, "ebitda": 5450995431, "year_low_stock_price": 11.69, "year_high_stock_price": 25.1, "seekingalpha_follower_count": 1829, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HNP.png"}