{"symbol": "HOFT", "name": "Hooker Furniture", "next_earnings_utc": 1591963200, "next_earnings_period_start_date_utc": 1588204800, "next_earnings_period_end_date_utc": 1596153600, "next_earnings_has_time": true, "next_earnings_name": "2021 Q2", "next_earnings_year": 2021, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 146964000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.29, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "hookerfurniture.com", "year_founded": 1924, "street_address": "440 East Commonwealth Boulevard", "city": "Martinsville", "state": "VA", "zipcode": "24112", "country": "United States", "phone_number": "276 632 2133", "short_description": "Hooker Furniture Corporation, together with its subsidiaries, designs, manufactures, imports, and markets residential household, hospitality, and contract furniture.", "long_description": "Hooker Furniture Corporation, together with its subsidiaries, designs, manufactures, imports, and markets residential household, hospitality, and contract furniture. The company operates through three segments: Hooker Branded, Home Meridian, and Domestic Upholstery. The Hooker Branded segment offers a range of design categories, including home entertainment, home office, accent, dining, and bedroom furniture under the Hooker Furniture brand name; and imported upholstered furniture under the Hooker Upholstery brand. The Home Meridian segment provides home furnishings under the Accentrics Home brand; a range of bedroom, dining room, accent, display cabinet, home office, and youth furnishings under the Pulaski Furniture and Samuel Lawrence Furniture brands; and imported leather motion upholstery under the Prime Resources International brand. This segment also designs and supplies hotel furnishings for four and five-star hotels under the Samuel Lawrence Hospitality brand name; and ready-to-assemble furniture to mass marketers and e-commerce customers under the HMidea brand. The Domestic Upholstery segment offers motion and stationary leather furniture under the Bradington-Young brand; occasional chairs, settees, sofas, and sectional seating under the Sam Moore Furniture brand; and upholstered furniture, such as private label sectionals, modulars, sofas, chairs, ottomans, benches, beds, and dining chairs for lifestyle specialty retailers under the Shenandoah Furniture brand. The company also supplies upholstered seating and casegoods to upscale senior living and assisted living facilities through designers, design firms, industry dealers, and distributors under the H Contract brand; and interior designer products under the Lifestyle Brands name. It sells home furnishing products through retailers comprising independent furniture stores, department stores, mass merchants, national chains, warehouse clubs, catalog merchants, interior designers, and e-commerce retailers principally in North America. Hooker Furniture Corporation was founded in 1924 and is headquartered in Martinsville, Virginia.", "industry_name": "Household Durables", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 221601511, "total_enterprise": 237274511, "number_of_employees": 1251, "outstanding_shares": 11825054, "eps": 1.181723, "diluted_eps": 1.180952, "earnings_from_cont_operations": 14019000, "gross_profit": 107094000, "cash": 51240000, "total_debt": 66913000, "total_revenue": 579903000, "cash_from_operations": 40068000, "net_income": 14019000, "ebitda": 24147000, "year_low_stock_price": 12.3, "year_high_stock_price": 26.07, "seekingalpha_follower_count": 1607, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HOFT.png"}