{"symbol": "HZO", "name": "MarineMax", "next_earnings_utc": 1595501100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 330312860.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.32143, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 7, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "marinemax.com", "year_founded": 1998, "street_address": "2600 McCormick Drive", "city": "Clearwater", "state": "FL", "zipcode": "33759", "country": "United States", "phone_number": "727-531-1700", "short_description": "MarineMax, Inc. operates as a recreational boat and yacht retailer in the United States.", "long_description": "MarineMax, Inc. operates as a recreational boat and yacht retailer in the United States. The company sells new and used recreational boats, including pleasure boats, such as sport boats, sport cruisers, sport yachts, and other yachts; fishing boats; motor and convertible yachts; pontoon boats; fishing boats; ski boats; and jet boats. It also provides marine parts and accessories comprising marine electronics; dock and anchoring products that include boat fenders, lines, and anchors; boat covers; trailer parts; water sport accessories, which comprise tubes, lines, wakeboards, and skis; engine parts; oils; lubricants; steering and control systems; corrosion control products and service products; high-performance accessories, including propellers and instruments; and a line of boating accessories, such as life jackets, inflatables, and water sports equipment. In addition, the company offers novelty items, such as shirts, caps, and license plates; marine engines and equipment; maintenance, repair, and slip and storage accommodation services; and boat or yacht brokerage services, as well as charters power yachts. Further, it provides new or used boat finance services; and arranges insurance coverage, including boat property, disability, undercoating, gel sealant, fabric protection, and casualty insurance coverage. As of November 11, 2019, the company had 59 retail locations in Alabama, Connecticut, Florida, Georgia, Maryland, Massachusetts, Minnesota, Missouri, New Jersey, New York, North Carolina, Ohio, Oklahoma, Rhode Island, South Carolina, and Texas. Additionally, operates vacations in Tortola, British Virgin Islands. The company also markets and sells its products through offsite locations, print catalog, and Internet. MarineMax, Inc. was founded in 1998 and is headquartered in Clearwater, Florida.", "industry_name": "Specialty Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 408669421, "total_enterprise": 749650421, "number_of_employees": 1754, "outstanding_shares": 21475009, "eps": 1.844156, "diluted_eps": 1.791187, "earnings_from_cont_operations": 39896000, "gross_profit": 343946000, "cash": 64406000, "total_debt": 405387000, "total_revenue": 1304277000, "cash_from_operations": 31167000, "net_income": 39896000, "ebitda": 81939000, "year_low_stock_price": 7.25, "year_high_stock_price": 23.15, "seekingalpha_follower_count": 1364, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/HZO.png"}