{"symbol": "IEX", "name": "IDEX", "next_earnings_utc": 1595534400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 525383830.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.98648, "eps_up_revisions": 0, "eps_down_revisions": 13, "revenue_up_revisions": 0, "revenue_down_revisions": 12, "total_analysts": 16, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 1, "analysts_hold": 7, "analysts_underperform": 1, "webpage": "idexcorp.com", "year_founded": 1987, "street_address": "1925 West Field Court", "city": "Lake Forest", "state": "IL", "zipcode": "60045-4824", "country": "United States", "phone_number": "847 498 7070", "short_description": "IDEX Corporation, together with its subsidiaries, operates as an applied solutions company worldwide.", "long_description": "IDEX Corporation, together with its subsidiaries, operates as an applied solutions company worldwide. The company operates through three segments: Fluid & Metering Technologies (FMT), Health & Science Technologies (HST), and Fire & Safety/Diversified Products (FSDP). The FMT segment designs, produces, and distributes positive displacement pumps, flow meters, injectors, and other fluid-handling pump modules and systems, as well as offers flow monitoring and other services for the food, chemical, general industrial, water and wastewater, agricultural, and energy industries. The HST segment designs, produces, and distributes precision fluidics, rotary lobe pumps, centrifugal and positive displacement pumps, roll compaction, and drying systems for use in beverage, food processing, pharmaceutical, and cosmetics; pneumatic components and sealing solutions, such as pumping solutions for analytical instrumentation, clinical diagnostics, and drug discovery; sealing components; custom mechanical and shaft seals; engineered hygienic mixers and valves; biocompatible medical devices and implantables; and air compressors. This segment also provides optical components and coatings for scientific research, defense, biotechnology, aerospace, telecommunications, and electronics manufacturing applications; laboratory and commercial equipment for the production of micro and nano scale materials; precision photonic solutions; and precision gear and peristaltic pump technologies. The FSDP segment designs, produces, and distributes firefighting pumps, valves, rescue tools, lifting bags, and other components and systems for the fire and rescue industry; engineered stainless steel banding and clamping devices for various industrial and commercial applications; and precision equipment for dispensing, metering, and mixing colorants and paints used in retail and commercial businesses. The company was incorporated in 1987 and is headquartered in Lake Forest, Illinois.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 12015202800, "total_enterprise": 12542241800, "number_of_employees": 7439, "outstanding_shares": 75391873, "eps": 5.514196, "diluted_eps": 5.450173, "earnings_from_cont_operations": 417251000, "gross_profit": 1116496000, "cash": 569219000, "total_debt": 1096258000, "total_revenue": 2466804000, "cash_from_operations": 524159000, "net_income": 417251000, "ebitda": 671515000, "year_low_stock_price": 104.56, "year_high_stock_price": 178.14, "seekingalpha_follower_count": 2506, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/IEX.png"}