{"symbol": "INFO", "name": "IHS Markit", "next_earnings_utc": 1592906400, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1048601820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.66497, "eps_up_revisions": 2, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 15, "total_analysts": 20, "analysts_sell": 1, "analysts_buy": 8, "analysts_outperform": 4, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "ihsmarkit.com", "year_founded": 1959, "street_address": "Ropemaker Place", "city": "London", "state": null, "zipcode": "EC2Y 9LY", "country": "United Kingdom", "phone_number": "44 20 7260 2000", "short_description": "IHS Markit Ltd. provides critical information, analytics, and solutions for various industries and markets that drive economies worldwide.", "long_description": "IHS Markit Ltd. provides critical information, analytics, and solutions for various industries and markets that drive economies worldwide. The company's information, analytics, and solutions enhance operational efficiency and offer deep insights for customers in business, finance, and government. Its Financial Services segment offers pricing and reference data, indices, valuation and trading services, trade processing, enterprise software, and managed services to traders, portfolio managers, risk managers, research professionals, and other financial market participants, as well as operations, compliance, and enterprise data managers. The company's Transportation segment provides authoritative analysis, as well as sales and production forecasts for light vehicles, medium and heavy commercial vehicles, powertrains, components, and technology systems; and predictive analytics and marketing automation software. It also offers comprehensive data on ships, as well as monthly import and export statistics on approximately 100 countries. The company's Resources segment provides upstream services, including technical information, analytical tools, and market forecasting and consulting for the upstream industry; and downstream information, such as market forecasting, midstream market analysis and supply chain data, refining and marketing economics, and oil product pricing information for the chemical, refined products, agriculture, and power industries. It also offers data for manufacturing processes, as well as capital expenditure, cost, price, production, trade, demand, and capacity industry analysis and forecasts. The company's Consolidated Markets & Solutions segment provides discovery technologies, research tools, and software-based engineering decision engines; performance and analysis for technology, media, and telecom industries; and economic and risk data, forecast, and analytic tools. The company was founded in 1959 and is headquartered in London, the United Kingdom.", "industry_name": "Professional Services", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 27848354442, "total_enterprise": 33326154442, "number_of_employees": 15500, "outstanding_shares": 398916408, "eps": 2.200914, "diluted_eps": 2.15096, "earnings_from_cont_operations": 874400000, "gross_profit": 2754800000, "cash": 143900000, "total_debt": 5607600000, "total_revenue": 4449000000, "cash_from_operations": 1182800000, "net_income": 878000000, "ebitda": 1529200000, "year_low_stock_price": 44.81, "year_high_stock_price": 81.65, "seekingalpha_follower_count": 6335, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/INFO.png"}