{"symbol": "ISRG", "name": "Intuitive Surgical", "next_earnings_utc": 1594929900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 666733080.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.72103, "eps_up_revisions": 0, "eps_down_revisions": 12, "revenue_up_revisions": 0, "revenue_down_revisions": 13, "total_analysts": 19, "analysts_sell": 2, "analysts_buy": 6, "analysts_outperform": 4, "analysts_hold": 6, "analysts_underperform": 1, "webpage": "intuitive.com", "year_founded": 1995, "street_address": "1020 Kifer Road", "city": "Sunnyvale", "state": "CA", "zipcode": "94086", "country": "United States", "phone_number": "408 523 2100", "short_description": "Intuitive Surgical, Inc., together with its subsidiaries, designs, manufactures, and markets da Vinci surgical systems, and related instruments and accessories in the United States and internationally.", "long_description": "Intuitive Surgical, Inc., together with its subsidiaries, designs, manufactures, and markets da Vinci surgical systems, and related instruments and accessories in the United States and internationally. The company's da Vinci Surgical System include surgeon's consoles, patient-side carts, 3-D vision systems, da Vinci skills simulators, da Vinci Xi integrated table motions, and Firefly fluorescence imaging products that enable surgeons to perform various surgical procedures, including gynecologic, urologic, general, cardiothoracic, and head and neck surgical procedures. It also manufactures EndoWrist instruments, such as forceps, scissors, electrocautery tools, scalpels, and other surgical tools, which incorporate wrist joints for natural dexterity for various surgical procedures. In addition, the company offers EndoWrist Stapler, a wristed stapling instrument for resection, transection, and creation of anastomoses; and EndoWrist One Vessel Sealers that are wristed single-use instruments for bipolar coagulation and mechanical transection of vessels up to 7mm in diameter and tissue bundles that fit in the jaws of the instrument. Additionally, the company sells various accessories comprising sterile drapes for ensuring sterile field during surgery; and vision products that include replacement 3D stereo endoscopes, camera heads, light guides, and other items that facilitate use of the da Vinci Surgical System, as well as Ion endoluminal system for biopsies. Intuitive Surgical, Inc. was founded in 1995 and is headquartered in Sunnyvale, California.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 67641813253, "total_enterprise": 64412213253, "number_of_employees": 7326, "outstanding_shares": 116617784, "eps": 11.976673, "diluted_eps": 11.599581, "earnings_from_cont_operations": 1394000000, "gross_profit": 3178800000, "cash": 3253400000, "total_debt": 0, "total_revenue": 4604300000, "cash_from_operations": 1617800000, "net_income": 1386300000, "ebitda": 1627600000, "year_low_stock_price": 360.5, "year_high_stock_price": 619.0, "seekingalpha_follower_count": 54537, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ISRG.png"}