{"symbol": "ISTR", "name": "Investar Holding", "next_earnings_utc": 1595512800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 19373000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.294, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 1, "revenue_down_revisions": 3, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "investarbank.com", "year_founded": 2006, "street_address": "10500 Coursey Boulevard", "city": "Baton Rouge", "state": "LA", "zipcode": "70816", "country": "United States", "phone_number": "225-227-2222", "short_description": "Investar Holding Corporation operates as the bank holding company for Investar Bank that provides various commercial banking products to individuals and small to medium-sized businesses in South Louisiana.", "long_description": "Investar Holding Corporation operates as the bank holding company for Investar Bank that provides various commercial banking products to individuals and small to medium-sized businesses in South Louisiana. The company offers various deposit products and services, such as savings, checking, money market, and individual retirement accounts, as well as various certificates of deposit; debit cards; and mobile banking services. It also provides commercial real estate loans; commercial and industrial loans, including working capital lines of credit and equipment loans; loans for the construction of commercial projects, and single family residential and multifamily properties; one-to-four family residential real estate loans, such as second and other second mortgage loans; consumer loans, such as secured and unsecured installment and term loans, second mortgages, home equity loans and lines of credit, and auto loans, as well as loans for personal, family, and household purposes. In addition, the company offers cash management products, including remote deposit capture, virtual vault, electronic statements, positive pay, ACH origination and wire transfer, investment sweep accounts, and business Internet banking services. Further, it provides various other banking services, such as cashiers' checks, direct deposit of payroll and social security checks, night depository, bank-by-mail, automated teller machine, interactive teller machines, merchant card, and mobile wallet payment services. The company operates through a network of 30 full service branches. Investar Holding Corporation was founded in 2006 and is headquartered in Baton Rouge, Louisiana.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 139985183, "total_enterprise": null, "number_of_employees": 324, "outstanding_shares": 10726834, "eps": 1.302044, "diluted_eps": 1.282653, "earnings_from_cont_operations": 13530000, "gross_profit": 67618000, "cash": 38542000, "total_debt": 224495000, "total_revenue": 67618000, "cash_from_operations": 13484000, "net_income": 13530000, "ebitda": null, "year_low_stock_price": 8.49, "year_high_stock_price": 26.46, "seekingalpha_follower_count": 282, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ISTR.png"}