{"symbol": "IVZ", "name": "Invesco", "next_earnings_utc": 1595501700, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1009128030.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.37548, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 19, "analysts_sell": 5, "analysts_buy": 2, "analysts_outperform": 1, "analysts_hold": 11, "analysts_underperform": 0, "webpage": "invesco.com", "year_founded": 1935, "street_address": "Two Peachtree Pointe", "city": "Atlanta", "state": "GA", "zipcode": "30309", "country": "United States", "phone_number": "404-479-1095", "short_description": "Invesco Ltd. is a publicly owned investment manager.", "long_description": "Invesco Ltd. is a publicly owned investment manager. The firm provides its services to retail clients, institutional clients, high-net worth clients, public entities, corporations, unions, non-profit organizations, endowments, foundations, pension funds, financial institutions, and sovereign wealth funds. It manages separate client-focused equity and fixed income portfolios. The firm also launches equity, fixed income, commodity, multi-asset, and balanced mutual funds for its clients. It launches equity, fixed income, multi-asset, and balanced exchange-traded funds. The firm also launches and manages private funds. It invests in the public equity and fixed income markets across the globe. The firm also invests in alternative markets, such as commodities and currencies. For the equity portion of its portfolio, it invests in growth and value stocks of large-cap, mid-cap, and small-cap companies. For the fixed income portion of its portfolio, the firm invests in convertibles, government bonds, municipal bonds, treasury securities, and cash. It also invests in short term and intermediate term bonds, investment grade and high yield bonds, taxable and tax-free bonds, senior secured loans, and structured securities such as asset-backed securities, mortgage-backed securities, and commercial mortgage-backed securities. The firm employs absolute return, global macro, and long/short strategies. It employs quantitative analysis to make its investments. The firm was formerly known as Invesco Plc, AMVESCAP plc, Amvesco plc, Invesco PLC, Invesco MIM, and H. Lotery & Co. Ltd. Invesco Ltd. was founded in December 1935 and is based in Atlanta, Georgia with an additional office in Hamilton, Bermuda.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3657398298, "total_enterprise": 10263098298, "number_of_employees": 8821, "outstanding_shares": 458895646, "eps": 1.038054, "diluted_eps": 1.032668, "earnings_from_cont_operations": 667200000, "gross_profit": 2199600000, "cash": 966300000, "total_debt": 2941900000, "total_revenue": 6501700000, "cash_from_operations": 1160000000, "net_income": 651300000, "ebitda": 1822300000, "year_low_stock_price": 6.38, "year_high_stock_price": 21.1, "seekingalpha_follower_count": 13934, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/IVZ.png"}