{"symbol": "JBL", "name": "Jabil", "next_earnings_utc": 1592308800, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5674477520.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.46051, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 1, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "jabil.com", "year_founded": 1966, "street_address": "10560 Dr. Martin Luther King", "city": "Saint Petersburg", "state": "FL", "zipcode": "33716", "country": "United States", "phone_number": "727-577-9749", "short_description": "Jabil Inc. provides manufacturing services and solutions worldwide.", "long_description": "Jabil Inc. provides manufacturing services and solutions worldwide. The company operates in two segments, Electronics Manufacturing Services and Diversified Manufacturing Services. It offers electronics design, production, and product management services. The company provides electronic circuit design services, such as application-specific integrated circuit design, firmware development and rapid prototyping services; and designs plastic and metal enclosures that include the electro-mechanics, such as the printed circuit board assemblies (PCBA). It also specializes in the three-dimensional mechanical design comprising the analysis of electronic, electro-mechanical, and optical assemblies, as well as offers various industrial design, advance mechanism development, and tooling management services. In addition, the company provides computer-assisted design services consisting of PCBA design, and PCBA design validation and verification services; and other consulting services, including the generation of a bill of materials, approved vendor list, and assembly equipment configuration for various PCBA designs. Further, it offers product and process validation services, such as product system, product safety, regulatory compliance, and reliability tests, as well as manufacturing test solution manufacturing development services. Additionally, the company offers systems assembly, test, direct-order fulfillment, and configure-to-order services. It serves automotive and transportation, capital equipment, cloud, computing and storage, defense and aerospace, industrial and energy, networking and telecommunications, print and retail, and smart home and appliances, as well as edge devices and accessories, healthcare, mobility, and packaging industries. The company was formerly known as Jabil Circuit, Inc. and changed its name to Jabil Inc. in June 2017. Jabil Inc. was founded in 1966 and is headquartered in Saint Petersburg, Florida.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 4877215581, "total_enterprise": 7521267581, "number_of_employees": 200000, "outstanding_shares": 150717416, "eps": 0.872227, "diluted_eps": 0.85443, "earnings_from_cont_operations": 135926000, "gross_profit": 1922841000, "cash": 713397000, "total_debt": 3345140000, "total_revenue": 26339836000, "cash_from_operations": 1169467000, "net_income": 133296000, "ebitda": 1526161000, "year_low_stock_price": 17.63, "year_high_stock_price": 44.2, "seekingalpha_follower_count": 9067, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/JBL.png"}