{"symbol": "JNJ", "name": "Johnson & Johnson", "next_earnings_utc": 1594722600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 17475853870.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.48705, "eps_up_revisions": 0, "eps_down_revisions": 13, "revenue_up_revisions": 0, "revenue_down_revisions": 12, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 5, "analysts_hold": 7, "analysts_underperform": 1, "webpage": "jnj.com", "year_founded": 1886, "street_address": "One Johnson & Johnson Plaza", "city": "New Brunswick", "state": "NJ", "zipcode": "08933", "country": "United States", "phone_number": "732 524 0400", "short_description": "Johnson & Johnson researches and develops, manufactures, and sells various products in the health care field worldwide.", "long_description": "Johnson & Johnson researches and develops, manufactures, and sells various products in the health care field worldwide. It operates in three segments: Consumer, Pharmaceutical, and Medical Devices. The Consumer segment offers baby care products under the JOHNSON'S brand; oral care products under the LISTERINE brand; beauty products under the AVEENO, CLEAN & CLEAR, DABAO, JOHNSON'S Adult, LE PETITE MARSEILLAIS, NEUTROGENA, and OGX brands; over-the-counter medicines, including acetaminophen products under the TYLENOL brand; cold, flu, and allergy products under the SUDAFED brand; allergy products under the BENADRYL and ZYRTEC brands; ibuprofen products under the MOTRIN IB brand; and acid reflux products under the PEPCID brand. This segment also provides women's health products, such as sanitary pads and tampons under the STAYFREE, CAREFREE, and o.b. brands; wound care products comprising adhesive bandages under the BAND-AID brand; and first aid products under the NEOSPORIN brand. The Pharmaceutical segment offers products in various therapeutic areas, including immunology, infectious diseases, neuroscience, oncology, pulmonary hypertension, and cardiovascular and metabolic diseases. The Medical Devices segment provides orthopedic products; general surgery, biosurgical, endomechanical, and energy products; electrophysiology products to treat cardiovascular diseases; sterilization and disinfection products to reduce surgical infection; diabetes care products; and vision care products, such as disposable contact lenses and ophthalmic products related to cataract and laser refractive surgery. The company markets its products to general public, and retail outlets and distributors, as well as distributes directly to wholesalers, hospitals, and health care professionals for prescription use. It has collaboration agreements with Morphic Therapeutic; and Emergent BioSolutions, Inc. The company was founded in 1886 and is based in New Brunswick, New Jersey.", "industry_name": "Pharmaceuticals", "sector_name": "Health Care", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 391895937081, "total_enterprise": 401454937081, "number_of_employees": 132200, "outstanding_shares": 2634594535, "eps": 6.5064, "diluted_eps": 6.408331, "earnings_from_cont_operations": 17166000000, "gross_profit": 54818000000, "cash": 18024000000, "total_debt": 27583000000, "total_revenue": 82729000000, "cash_from_operations": 23231000000, "net_income": 17166000000, "ebitda": 28551000000, "year_low_stock_price": 109.16, "year_high_stock_price": 157.0, "seekingalpha_follower_count": 321663, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/JNJ.png"}