{"symbol": "JW.A", "name": "John Wiley & Sons", "next_earnings_utc": 1591876800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 453490000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.425, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 2, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "wiley.com", "year_founded": 1807, "street_address": "111 River Street", "city": "Hoboken", "state": "NJ", "zipcode": "07030", "country": "United States", "phone_number": "201-748-6000", "short_description": "John Wiley & Sons, Inc. operates as a research and learning company worldwide.", "long_description": "John Wiley & Sons, Inc. operates as a research and learning company worldwide. It operates in three segments: Research, Publishing, and Solutions. The Research segment offers scientific, technical, medical, and scholarly journals; and related content and services. It also publishes physical sciences and engineering, health sciences, social sciences, and humanities and life sciences journals; and provides a publishing software and service for scholarly and professional societies, and publishers to deliver, host, enhance, market, and manage their content on the Web through the Literatum platform. This segment serves academic, corporate, government, and public libraries; funders of research; researchers, scientists, clinicians, engineers, and technologists; and students and professors. It sells its products in digital and print formats through research libraries and library consortia, and independent subscription agents, as well as directly to professional society members, bookstores, online booksellers, and other customers. The Publishing segment acquires, develops, and publishes scientific, professional, and education books and related content, as well as provides test preparation services and course workflow tools to libraries, corporations, students, professionals, and researchers. It serves business, finance, accounting, workplace learning, management, leadership, technology, behavioral health, engineering/ architecture, science and medicine, and education communities. This segment distributes its products in digital and print formats through chain and online booksellers, libraries, colleges and universities, corporations, direct to consumer, Websites, distributor networks, and other online applications. The Solutions segment provides online program management services for higher education institutions; and learning, development, and assessment services for businesses and professionals. The company was founded in 1807 and is headquartered in Hoboken, New Jersey.", "industry_name": "Media", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2302904168, "total_enterprise": 3162738168, "number_of_employees": 5700, "outstanding_shares": 56079361, "eps": 2.605048, "diluted_eps": 2.589215, "earnings_from_cont_operations": 146999000, "gross_profit": 1310784000, "cash": 117355000, "total_debt": 977189000, "total_revenue": 1848045000, "cash_from_operations": 287574000, "net_income": 146999000, "ebitda": 307181000, "year_low_stock_price": 30.42, "year_high_stock_price": 50.05, "seekingalpha_follower_count": 1955, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/JW.A.png"}