{"symbol": "KAJMY", "name": "Kajima", "next_earnings_utc": 1592229600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "kajima.co.jp", "year_founded": 1840, "street_address": "3-1, Motoakasaka 1-chome", "city": "Tokyo", "state": null, "zipcode": "107-8388", "country": "Japan", "phone_number": "81 3 5544 1111", "short_description": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide.", "long_description": "Kajima Corporation engages in the construction, real estate development and management, architectural and engineering design, and other activities worldwide. It provides procurement and construction services comprising sale and rental of construction equipment and materials, and subcontracting for various construction projects; ground improvement, foundation construction, and soil remediation; paving of roads, bridges, airports, etc., as well as manufacture and sale of paving materials; ocean port and coastal protection work, and geological surveying; calculation and preparation of construction plans; environmental and consulting work focused on water and waste; construction machinery manufacturing; repair and reinforcement work for civil engineering structures, and sale of repair materials; and integrated facility construction, and renovation services. The company also offers building management services; leasing and operational management services of real estate, and hotel management; and brokerage and appraisal services of real estate. In addition, it provides travel agency, product sales, and business services; temporary staffing and human resources placement, and events planning services; planning of construction projects, and building and equipment leasing; design, operation, and management of information communication technology infrastructure and various computer systems; collection, transportation, and processing of waste; public relations and advertising planning and production, as well as video production services; and real estate asset management and consulting, as well as buying, selling, and brokerage of beneficial interests of a trust. Further, the company offers book publishing; hotel, golf course, and ski resort services; and greening landscaping, mountain forest management, and agency handling services of property, casualty, and life insurance. Kajima Corporation was founded in 1840 and is headquartered in Tokyo, Japan.", "industry_name": "Construction and Engineering", "sector_name": "Industrials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 5996167068, "total_enterprise": 6507511610, "number_of_employees": 18297, "outstanding_shares": 512578153, "eps": 1.86937509417115, "diluted_eps": 1.86937509417115, "earnings_from_cont_operations": 965298511, "gross_profit": 2307746682, "cash": 2561715822, "total_debt": 3040300604, "total_revenue": 18701702987, "cash_from_operations": 493512654, "net_income": 960238846, "ebitda": 1422212301, "year_low_stock_price": 8.12, "year_high_stock_price": 14.57, "seekingalpha_follower_count": 27, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/KAJMY.png"}