{"symbol": "KEP", "name": "Korea Electric Power", "next_earnings_utc": 1591696800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 10448456141.19884, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "kepco.co.kr", "year_founded": 1961, "street_address": "55 Jeollyeok-ro", "city": "Naju-Si", "state": null, "zipcode": "58322", "country": "South Korea", "phone_number": "82 6 1345 4213", "short_description": "Korea Electric Power Corporation, an integrated electric utility company, generates, transmits, and distributes electricity in South Korea and internationally.", "long_description": "Korea Electric Power Corporation, an integrated electric utility company, generates, transmits, and distributes electricity in South Korea and internationally. The company operates through Transmission and Distribution, Electric Power Generation (Nuclear), Electric Power Generation (Non-nuclear), Plant Maintenance & Engineering Service, and Others segments. It generates power from nuclear, coal, oil, liquefied natural gas, internal combustion, combined-cycle, integrated gasification combined cycle, hydro, wind, solar, fuel cell, biogas, and other sources. As of December 31, 2019, the company had a total of 671 generation units, including nuclear, thermal, hydroelectric, and internal combustion units with an installed generation capacity of 83,672 megawatts. Its transmission system consisted of 34,440 circuit kilometers of lines of 765 kilovolts and others, including high-voltage direct current lines, as well as 864 substations with an installed transformer capacity of 326,329 megavolt-amperes; and distribution system included 125,067 megavolt-amperes of transformer capacity and 9,641,891 units of support with a total line length of 504,402 circuit kilometers. The company provides electricity to residential, commercial, educational, industrial, agricultural, street lighting, and overnight power usage. It also offers utility plant maintenance and architectural engineering, information, communication line leasing, resources development, and fly ashes recycling services, as well as sells nuclear fuel. Korea Electric Power Corporation was founded in 1961 and is headquartered in Naju, South Korea.", "industry_name": "Electric Utilities", "sector_name": "Utilities", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 11251287345, "total_enterprise": 68785453180, "number_of_employees": 46377, "outstanding_shares": 641964077, "eps": -1.9620221159883, "diluted_eps": -1.9620221159883, "earnings_from_cont_operations": -1188993709, "gross_profit": 1880670669, "cash": 3856667091, "total_debt": 60897942937, "total_revenue": 48435239662, "cash_from_operations": 8139453502, "net_income": -1259547717, "ebitda": 8537272925, "year_low_stock_price": 6.28, "year_high_stock_price": 12.3, "seekingalpha_follower_count": 1889, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/KEP.png"}