{"symbol": "KEY", "name": "KeyCorp", "next_earnings_utc": 1595413800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1572261680.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.1149, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 1, "revenue_down_revisions": 8, "total_analysts": 23, "analysts_sell": 1, "analysts_buy": 5, "analysts_outperform": 4, "analysts_hold": 12, "analysts_underperform": 1, "webpage": "key.com", "year_founded": 1849, "street_address": "Key Tower", "city": "Cleveland", "state": "OH", "zipcode": "44114-1306", "country": "United States", "phone_number": "216-689-3000", "short_description": "KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking services in the United States.", "long_description": "KeyCorp operates as the holding company for KeyBank National Association that provides various retail and commercial banking services in the United States. It operates in two segments, Consumer Bank and Commercial Bank. The company offers various deposits, investment products and services; and personal finance and financial wellness, student loan refinancing, mortgage and home equity, lending, credit card, treasury, business advisory, wealth management, asset management, cash management, portfolio management, and trust and related services to individuals and small and medium-sized businesses. It also provides a suite of banking and capital market products, such as syndicated finance, debt and equity capital market products, commercial payments, equipment finance, commercial mortgage banking, derivatives, foreign exchange, financial advisory, and public finance, as well as commercial mortgage loans comprising consumer, energy, healthcare, industrial, public sector, real estate, and technology loans for middle market clients. In addition, the company offers community development financing, securities underwriting, brokerage, and investment banking services, as well as purchases retail auto sales contracts through a network of auto dealership. As of December 31, 2019, it operated through 1,098 retail banking branches and 1,420 ATMs in 15 states, as well as additional offices, online and mobile banking capabilities, and a telephone banking call center. The company was founded in 1849 and is headquartered in Cleveland, Ohio.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 11558556229, "total_enterprise": null, "number_of_employees": 17045, "outstanding_shares": 975405589, "eps": 1.376399, "diluted_eps": 1.364192, "earnings_from_cont_operations": 1447000000, "gross_profit": 5571000000, "cash": 3732000000, "total_debt": 21431000000, "total_revenue": 5571000000, "cash_from_operations": 2173000000, "net_income": 1456000000, "ebitda": null, "year_low_stock_price": 7.45, "year_high_stock_price": 20.53, "seekingalpha_follower_count": 21492, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/KEY.png"}