{"symbol": "KEYS", "name": "Keysight Technologies, Inc.", "next_earnings_utc": 1590523500, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1027152000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.03164, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 12, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 2, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "keysight.com", "year_founded": 2013, "street_address": "1400 Fountaingrove Parkway", "city": "Santa Rosa", "state": "CA", "zipcode": "95403", "country": "United States", "phone_number": "800-829-4444", "short_description": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific regions.", "long_description": "Keysight Technologies, Inc. provides electronic design and test solutions to commercial communications, networking, aerospace, defense and government, automotive, energy, semiconductor, electronic, and education industries in the Americas, Europe, and the Asia Pacific regions. Its Communications Solutions Group segment provides electronic design automation (EDA) software; and radio frequency and microwave test instruments; oscilloscopes, logic and serial protocol analyzers, logic-signal sources, arbitrary waveform generators, and bit error rate testers; optical modulation analyzers, optical component analyzers, optical power meters, and optical laser source solutions; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. The company's Electronic Industrial Solutions Group segment offers design tools; design verification solutions; digital multi-meters, function generators, frequency counters, data acquisition systems, audio analyzers, LCR meters, thermal imagers, precision source measure units, ultra-high precision device current analyzers, and test executive software platforms, as well as various power supplies comprising AC/DC modular supplies and electronically programmable loads. This segment also provides printed-circuit-board-assembly testers, integrated circuit parametric testers, and sub-nano-meter positioning sub-assemblies; test and measurement products and software; and repair, calibration, and consulting services, as well as resells refurbished used Keysight equipment. Its Ixia Solutions Group segment offers software applications and services, including warranty and maintenance offerings, and hardware platforms. The company sells its products through direct sales force, distributors, resellers, and manufacturer's representatives. It has partnership with Qualcomm Technologies, Inc. The company was incorporated in 2013 and is headquartered in Santa Rosa, California.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 18737661346, "total_enterprise": 18998661346, "number_of_employees": 13600, "outstanding_shares": 187395353, "eps": 3.559096, "diluted_eps": 3.508549, "earnings_from_cont_operations": 670000000, "gross_profit": 2611000000, "cash": 1691000000, "total_debt": 1952000000, "total_revenue": 4392000000, "cash_from_operations": 955000000, "net_income": 670000000, "ebitda": 1141000000, "year_low_stock_price": 71.03, "year_high_stock_price": 110.0, "stocktwits_watchlist_count": 1935, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/KEYS.png"}