{"symbol": "KPELY", "name": "Keppel", "next_earnings_utc": 1592488800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1456505871.770526, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "kepcorp.com", "year_founded": 1968, "street_address": "No. 02-01 Keppel Bay Tower", "city": "Singapore", "state": null, "zipcode": "098632", "country": "Singapore", "phone_number": "65 6270 6666", "short_description": "Keppel Corporation Limited, an investment holding company, engages in the offshore and marine, property, infrastructure, and investment businesses in Singapore, China, Hong Kong, Brazil, other Far East and ASEAN countries, and internationally.", "long_description": "Keppel Corporation Limited, an investment holding company, engages in the offshore and marine, property, infrastructure, and investment businesses in Singapore, China, Hong Kong, Brazil, other Far East and ASEAN countries, and internationally. It constructs, fabricates, and repairs offshore production facilities and drilling rigs, power barges, specialized vessels, and other offshore production facilities; engineers, constructs, and fabricates platforms for the oil and gas sector; undertakes shipyard works and other general business activities; and procures equipment and materials for the construction of offshore production facilities. The company is also involved in the provision of offshore and marine-related, as well as self-elevating platforms owning and leasing services; sourcing, fabricating, and supply of steel components; ship repairing, shipbuilding, and conversion activities; ship owning business; chartering of ships, barges, and boats with crew; property investment, management, and development activities; fund management business; golf and hotel ownership and operation; development of residential properties; procurement of equipment and materials for the construction of offshore production facilities; development of district heating and cooling systems; power generation and supply, and general wholesale trade businesses; purchase and sale of gaseous fuels; distribution of IT products and retail sale of telecommunication products; and provision of fixed and other telecommunications services. In addition, it offers jacking systems, and heavy-lift equipment and related services; project management and procurement, towage, financial, real estate investment trust management, logistics and warehousing, data center, and travel agency; and environmental infrastructure and solid waste treatment solutions. The company was incorporated in 1968 and is based in Singapore.", "industry_name": "Industrial Conglomerates", "sector_name": "Industrials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 8064608772, "total_enterprise": 15622336311, "number_of_employees": 19515, "outstanding_shares": 890853000, "eps": 0.257396553786402, "diluted_eps": 0.256105454980405, "earnings_from_cont_operations": 483599175, "gross_profit": 1636017083, "cash": 1673275310, "total_debt": 8795732690, "total_revenue": 5562958481, "cash_from_operations": -69392867, "net_income": 467568442, "ebitda": 695826268, "year_low_stock_price": 6.53, "year_high_stock_price": 10.8, "seekingalpha_follower_count": 441, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/KPELY.png"}