{"symbol": "LAKE", "name": "Lakeland Industries", "next_earnings_utc": 1594844400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 27765000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.155, "eps_up_revisions": 1, "eps_down_revisions": 0, "revenue_up_revisions": 1, "revenue_down_revisions": 0, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "lakeland.com", "year_founded": 1982, "street_address": "202 Pride Lane SW", "city": "Decatur", "state": "AL", "zipcode": "35603", "country": "United States", "phone_number": "256 350 3873", "short_description": "Lakeland Industries, Inc. manufactures and sells industrial protective clothing and accessories for the industrial and public protective clothing market worldwide.", "long_description": "Lakeland Industries, Inc. manufactures and sells industrial protective clothing and accessories for the industrial and public protective clothing market worldwide. It offers limited use/disposable protective clothing, such as coveralls, laboratory coats, shirts, pants, hoods, aprons, sleeves, arm guards, caps, and smocks; high-end chemical protective suits to provide protection from highly concentrated, toxic and/or lethal chemicals, and biological toxins; and firefighting and heat protective apparel to protect against fire, burns, and excessive heat. The company also provides reusable woven garments, including electrostatic dissipative apparel for electric and gas utilities; flame resistant meta aramid, para aramid, and FR cotton coveralls/pants/jackets used in petrochemical and refining operations; FR fabrics; and cotton and polycotton coveralls, lab coats, pants, and shirts. In addition, it provides high visibility clothing comprising reflective apparel, including vests, T-shirts, sweatshirts, jackets, coats, raingear, jumpsuits, hats, and gloves; and gloves and sleeves that are used in the automotive, glass, and metal fabrication industries. The company sells its products to a network of approximately 1,600 safety and industrial supply distributors through in-house sales teams, customer service group, and independent sales representatives. It serves end users, such as integrated oil, chemical/petrochemical, automobile, steel, glass, construction, smelting, cleanroom, janitorial, pharmaceutical, and high technology electronics manufacturers, as well as scientific, medical laboratories, and the utilities industry; and federal, state, and local governmental agencies and departments. The company was founded in 1982 and is headquartered in Decatur, Alabama.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 115600133, "total_enterprise": 104398133, "number_of_employees": 1829, "outstanding_shares": 7972423, "eps": 0.409821, "diluted_eps": 0.409821, "earnings_from_cont_operations": 3281000, "gross_profit": 37897000, "cash": 14606000, "total_debt": 3404000, "total_revenue": 107809000, "cash_from_operations": 3590000, "net_income": 3281000, "ebitda": 7521000, "year_low_stock_price": 9.7, "year_high_stock_price": 28.0, "seekingalpha_follower_count": 5628, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/LAKE.png"}