{"symbol": "LLY", "name": "Eli Lilly and Company", "next_earnings_utc": 1595499900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5835274820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.57923, "eps_up_revisions": 1, "eps_down_revisions": 9, "revenue_up_revisions": 1, "revenue_down_revisions": 7, "total_analysts": 18, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 3, "analysts_hold": 9, "analysts_underperform": 1, "webpage": "lilly.com", "year_founded": 1876, "street_address": "Lilly Corporate Center", "city": "Indianapolis", "state": "IN", "zipcode": "46285", "country": "United States", "phone_number": "317 276 2000", "short_description": "Eli Lilly and Company discovers, develops, manufactures, and markets pharmaceutical products worldwide.", "long_description": "Eli Lilly and Company discovers, develops, manufactures, and markets pharmaceutical products worldwide. It offers endocrinology products for diabetes; osteoporosis in postmenopausal women and men; and human growth hormone deficiency and paediatric growth conditions. The company also provides neuroscience products for treating depressive disorder, diabetic peripheral neuropathic pain, anxiety disorder, fibromyalgia, and chronic musculoskeletal pain; migraine and episodic cluster headache; attention-deficit hyperactivity disorder; and schizophrenia. In addition, it offers immunology products for the treatment of rheumatoid arthritis, plaque psoriasis, psoriatic arthritis, and ankylosing spondylitis; oncology products to treat non-small cell lung, colorectal, head and neck, pancreatic, metastatic breast, ovarian, bladder, and metastatic gastric cancers, as well as malignant pleural mesothelioma; and products to treat erectile dysfunction and benign prostatic hyperplasia. Eli Lilly and Company primarily has collaborations with Incyte Corporation; Pfizer Inc.; Dicerna Pharmaceuticals, Inc.; AC Immune SA; Centrexion Therapeutics Corporation; ImmuNext, Inc.; Avidity Biosciences, Inc.; Duke Clinical Research Institute for the prevention of chronic heart failure and mortality after an acute myocardial infarction; and AbCellera Biologics Inc., as well as an agreement with Junshi Biosciences to co-develop therapeutic antibodies for the potential prevention and treatment of COVID-19, the disease caused by the SARS-CoV-2 novel coronavirus. The company was founded in 1876 and is headquartered in Indianapolis, Indiana.", "industry_name": "Pharmaceuticals", "sector_name": "Health Care", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 138641596021, "total_enterprise": 154597796021, "number_of_employees": 33625, "outstanding_shares": 906450448, "eps": 6.05968, "diluted_eps": 6.036157, "earnings_from_cont_operations": 5533300000, "gross_profit": 18289500000, "cash": 1795400000, "total_debt": 17633200000, "total_revenue": 23087100000, "cash_from_operations": 4907700000, "net_income": 5533300000, "ebitda": 7634900000, "year_low_stock_price": 101.36, "year_high_stock_price": 164.9, "seekingalpha_follower_count": 59682, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/LLY.png"}