{"symbol": "LMT", "name": "Lockheed Martin", "next_earnings_utc": 1595331000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 15230909760.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 5.61443, "eps_up_revisions": 4, "eps_down_revisions": 9, "revenue_up_revisions": 3, "revenue_down_revisions": 8, "total_analysts": 21, "analysts_sell": 0, "analysts_buy": 10, "analysts_outperform": 2, "analysts_hold": 9, "analysts_underperform": 0, "webpage": "lockheedmartin.com", "year_founded": 1995, "street_address": "6801 Rockledge Drive", "city": "Bethesda", "state": "MD", "zipcode": "20817", "country": "United States", "phone_number": "301-897-6000", "short_description": "Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide.", "long_description": "Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. It operates through four segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space Systems. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters; ship and submarine mission and combat systems; mission systems and sensors for rotary and fixed-wing aircraft; sea and land-based missile defense systems; radar systems; the Littoral combat ship; simulation and training services; and unmanned systems and technologies. It also supports government customers in cybersecurity; and delivers communications, and command and control capabilities through mission solutions for defense applications. The Space Systems segment offers satellites; space transportation systems; strategic, advanced strike, and defensive missile systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground-based systems to help its customers gather, analyze, and securely distribute critical intelligence data. Lockheed Martin Corporation was founded in 1995 and is headquartered in Bethesda, Maryland.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 108932293370, "total_enterprise": 119674293370, "number_of_employees": 110000, "outstanding_shares": 280435314, "eps": 22.161874, "diluted_eps": 22.036739, "earnings_from_cont_operations": 6243000000, "gross_profit": 8270000000, "cash": 1988000000, "total_debt": 12689000000, "total_revenue": 61127000000, "cash_from_operations": 7962000000, "net_income": 6243000000, "ebitda": 8936000000, "year_low_stock_price": 266.11, "year_high_stock_price": 442.53, "seekingalpha_follower_count": 109862, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/LMT.png"}