{"symbol": "LNN", "name": "Lindsay", "next_earnings_utc": 1594118700, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 123520000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.882, "eps_up_revisions": 4, "eps_down_revisions": 0, "revenue_up_revisions": 1, "revenue_down_revisions": 3, "total_analysts": 7, "analysts_sell": 1, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "lindsay.com", "year_founded": 1954, "street_address": "18135 Burke Street", "city": "Omaha", "state": "NE", "zipcode": "68022", "country": "United States", "phone_number": "402-829-6800", "short_description": "Lindsay Corporation, together with its subsidiaries, provides water management and road infrastructure products and services in the United States and internationally.", "long_description": "Lindsay Corporation, together with its subsidiaries, provides water management and road infrastructure products and services in the United States and internationally. The company operates through two segments, Irrigation and Infrastructure. The Irrigation segment manufactures and markets center pivot, lateral move irrigation systems, and irrigation controls under the Zimmatic brand; hose reel travelers under the Perrot and Greenfield brands; and chemical injection systems, variable rate irrigation systems, flow meters, weather stations, soil moisture sensors, and remote monitoring and control systems under the GrowSmart brand. It also offers repair and replacement parts for irrigation systems and controls; and M2M communication technology solutions, data acquisition and management systems, and custom electronic equipment under the Elecsys brand. The Infrastructure segment provides Quickchange moveable barrier systems that help in highway reconstruction, paving and resurfacing, road widening, median and shoulder construction, and tunnels and bridge repairs; and re-directive and non-re-directive crash cushions, which are used to enhance highway safety at locations, such as toll booths, freeway off-ramps, medians and roadside barrier ends, bridge supports, utility poles, and other fixed roadway hazards. It also offers specialty barrier products; road marking and road safety equipment; and railroad signals and structures, and diameter steel tubing products, as well as outsourced manufacturing and production services for other companies. The company serves departments of transportation, municipal transportation road agencies, roadway contractors, subcontractors, distributors, and dealers. Lindsay Corporation was founded in 1954 and is headquartered in Omaha, Nebraska.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1017600940, "total_enterprise": 1044273940, "number_of_employees": 1069, "outstanding_shares": 10834763, "eps": 1.691146, "diluted_eps": 1.688015, "earnings_from_cont_operations": 18261000, "gross_profit": 128966000, "cash": 120012000, "total_debt": 146685000, "total_revenue": 446120000, "cash_from_operations": 41459000, "net_income": 18261000, "ebitda": 46000000, "year_low_stock_price": 71.86, "year_high_stock_price": 111.76, "seekingalpha_follower_count": 3600, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/LNN.png"}