{"symbol": "MICT", "name": "MICT", "next_earnings_utc": 1592224200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "mict-inc.com", "year_founded": 2002, "street_address": "28 West Grand Avenue", "city": "Montvale", "state": "NJ", "zipcode": "07645", "country": "United States", "phone_number": "201 225 0190", "short_description": "MICT, Inc. designs, develops, manufactures, and sells rugged mobile computing and video telematics devices.", "long_description": "MICT, Inc. designs, develops, manufactures, and sells rugged mobile computing and video telematics devices. Its products comprise tablets, on-board-computers, and dash cams that provide fleet operators and field workforces with computing solutions for various work environments, such as extreme temperatures, repeated vibrations, or dirty and wet or dusty conditions. The company's portable tablets enhance workforce productivity by offering computing power and communication capabilities that provide fleet operators with visibility into vehicle location, fuel usage, speed, and mileage; and manage the drivers in various aspects, such as driver identification and behavior, reporting hours worked, customer/organization working procedures and protocols, route management and navigation based on tasks and time schedule. It also provides SmartHub, which offers consumers with services, such as driver recognition, identifying and preventing driver fatigue, recognizing driver behavior, preventive maintenance, fuel efficiency, and a driver assistance system; and a platform to offer services, such as Hours of Service for third party telematics service providers. The company's products are used in and/or targeted to a range of mobile resource management industry sectors, including haulage and distribution, public transportation, construction, and public safety services. It primarily serves application service providers, and solution providers specializing in the mobile resource management markets in the United States, Israel, and internationally. The company was formerly known as Micronet Enertec Technologies, Inc. and changed its name to MICT, Inc. in July 2018. MICT, Inc. was founded in 2002 and is headquartered in Montvale, New Jersey.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 12752961, "total_enterprise": 17484961, "number_of_employees": 44, "outstanding_shares": 11089532, "eps": -0.39421, "diluted_eps": -0.39421, "earnings_from_cont_operations": -4770000, "gross_profit": -369000, "cash": 3154000, "total_debt": 1856000, "total_revenue": 477000, "cash_from_operations": -3797000, "net_income": -4217000, "ebitda": -3761000, "year_low_stock_price": 0.38, "year_high_stock_price": 1.25, "seekingalpha_follower_count": 1639, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MICT.png"}