{"symbol": "MLAB", "name": "Mesa Laboratories, Inc.", "next_earnings_utc": 1590984000, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 34492000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.67, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "mesalabs.com", "year_founded": 1982, "street_address": "12100 West Sixth Avenue", "city": "Lakewood", "state": "CO", "zipcode": "80228", "country": "United States", "phone_number": "303-987-8000", "short_description": "Mesa Laboratories, Inc. designs, manufactures, and markets quality control instruments and disposable products in Europe, Africa, Asia, South America, Australia, Canada, and Central America.", "long_description": "Mesa Laboratories, Inc. designs, manufactures, and markets quality control instruments and disposable products in Europe, Africa, Asia, South America, Australia, Canada, and Central America. The company’s Instruments segment offers data loggers, which are precision instruments used in critical manufacturing, quality control, and validation applications; medical meters and calibration solutions used to test various parameters of the dialysis fluid, and the calibration and operation of the dialysis machine; gas flow calibration and air sampling equipment that are used for industrial hygiene assessments, calibration of gas metering equipment, and environmental air monitoring; and torque testing systems used for measure bottle cap tightness. This segment’s products are used in healthcare, pharmaceutical, medical device, food and beverage, industrial hygiene, and environmental air sampling industries. Its Sterilization and Disinfection Control segment manufactures and markets biological indicators comprising spore strips, self-contained products, and culture media, as well as process challenge devices; and testing services. This segment also provides chemical indicators that are used to assess the effectiveness of sterilization processes; and cleaning indicators, which are used to assess the effectiveness of cleaning processes. The company’s Cold Chain Monitoring segment offers systems, which are used to monitor various environmental parameters, such as temperature, humidity, and differential pressure for use in hospitals, pharmaceutical and medical device manufacturers, blood banks, pharmacies, and laboratory environments; parameter monitoring services for products in a cold chain; and consulting services. Its Cold Chain Packaging segment offers thermal packaging products, such as coolers, boxes, insulation materials, and phase-change products to control temperature during transport. Mesa Laboratories, Inc. was founded in 1982 and is headquartered in Lakewood, Colorado.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1154896169, "total_enterprise": 1222286169, "number_of_employees": 347, "outstanding_shares": 4370468, "eps": 1.089902, "diluted_eps": 1.0313, "earnings_from_cont_operations": 4431000, "gross_profit": 67040000, "cash": 73979000, "total_debt": 141369000, "total_revenue": 109925000, "cash_from_operations": 28418000, "net_income": 4431000, "ebitda": 26658000, "year_low_stock_price": 181.21, "year_high_stock_price": 271.46, "seekingalpha_follower_count": 1030, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MLAB.png"}