{"symbol": "MLI", "name": "Mueller Industries", "next_earnings_utc": 1595329200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "muellerindustries.com", "year_founded": 1917, "street_address": "150 Schilling Boulevard", "city": "Collierville", "state": "TN", "zipcode": "38017", "country": "United States", "phone_number": "901 753 3200", "short_description": "Mueller Industries, Inc. manufactures and sells copper, brass, aluminum, and plastic products in the United States, the United Kingdom, Canada, South Korea, the Middle East, China, and Mexico.", "long_description": "Mueller Industries, Inc. manufactures and sells copper, brass, aluminum, and plastic products in the United States, the United Kingdom, Canada, South Korea, the Middle East, China, and Mexico. The company's Piping Systems segment manufactures copper tubes and fittings, and line sets for water distribution system, heating system, air-conditioning, and refrigeration applications, as well as drainage, waste, and vent systems. It also manufactures steel pipe nipples; and resells imported brass and plastic plumbing valves, malleable iron fittings, faucets, and plumbing specialty products. This segment sells its products primarily to plumbing, refrigeration, and air-conditioning wholesalers; and hardware wholesalers and co-ops, building product retailers, and air-conditioning original equipment manufacturers (OEMs). The company's Industrial Metals segment manufactures and sells brass, bronze, and copper alloy rods; cold-formed aluminum and copper products for automotive, military ordnance, aerospace, and general manufacturing industries; brass and aluminum forgings, brass fittings, industrial machinery, valve bodies, gear blanks, and computer hardware; and brass, aluminum, and stainless steel valves, as well as fluid control systems and gas train assembles for compressed gas, pharmaceutical, construction, and gas appliance markets. Its Climate segment offers valves, protection devices, and brass fittings, as well as tubular assemblies and fabrications for various OEMs in the commercial heating, ventilation, and air-conditioning (HVAC) and refrigeration markets; components and accessories for the air-conditioning and refrigeration markets; and coaxial heat exchangers and twisted tubes for HVAC, geothermal, refrigeration, swimming pool heat pump, marine, ice machine, commercial boiler, and heat reclamation markets. The company was founded in 1917 and is headquartered in Collierville, Tennessee.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1520363425, "total_enterprise": 1880689425, "number_of_employees": 4964, "outstanding_shares": 56772346, "eps": 2.107361, "diluted_eps": 2.079723, "earnings_from_cont_operations": 123044000, "gross_profit": 388822000, "cash": 154283000, "total_debt": 494996000, "total_revenue": 2421754000, "cash_from_operations": 253268000, "net_income": 117664000, "ebitda": 228642000, "year_low_stock_price": 16.78, "year_high_stock_price": 34.11, "seekingalpha_follower_count": 914, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MLI.png"}