{"symbol": "MMSI", "name": "Merit Medical Systems", "next_earnings_utc": 1595534400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 192673590.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.065, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 0, "revenue_down_revisions": 9, "total_analysts": 10, "analysts_sell": 1, "analysts_buy": 3, "analysts_outperform": 3, "analysts_hold": 2, "analysts_underperform": 1, "webpage": "merit.com", "year_founded": 1987, "street_address": "1600 West Merit Parkway", "city": "South Jordan", "state": "UT", "zipcode": "84095", "country": "United States", "phone_number": "801 253 1600", "short_description": "Merit Medical Systems, Inc. manufactures and markets disposable medical devices for interventional, diagnostic, and therapeutic procedures in cardiology, radiology, oncology, critical care, and endoscopy.", "long_description": "Merit Medical Systems, Inc. manufactures and markets disposable medical devices for interventional, diagnostic, and therapeutic procedures in cardiology, radiology, oncology, critical care, and endoscopy. The company operates through two segments, Cardiovascular and Endoscopy. It provides peripheral intervention products for the diagnosis and treatment of diseases in peripheral vessels and organs; and cardiac intervention products, such as access, angiography, hemostasis, intervention, interventional fluid management, pressure monitoring, and cardiac rhythm management, as well as thermodilution and pulmonary artery catheters and electrophysiology to treat various heart conditions. It also offers cardiovascular and critical care products to treat patients with life-threatening diseases, and protect healthcare providers from exposure to bloodborne pathogens. In addition, it provides interventional oncology and spine products to treat vertebral compression fractures, metastatic spinal tumors, liver cancer, uterine fibroids, benign prostatic hyperplasia, vertebral compression fractures, and arteriovenous malformations and hemostatic embolization, as well as breast cancer localization and guidance products for the treatment of breast cancer. Further, it offers non-vascular stents to treat pulmonary and gastrointestinal diseases; dilation balloons to endoscopically dilate strictures; and kits and accessories for endoscopy and bronchoscopy procedures. Additionally, it provides coated tubes and wires; microelectromechanical system sensor components; ConvertX nephroureteral stent system; and Fibrovein, a detergent-based sclerosant. The company sells its products to hospitals and clinic-based physicians, technicians, and nurses through direct sales force, distributors, original equipment manufacturer partners, or custom procedure tray manufacturers in the United States and internationally. The company was founded in 1987 and is headquartered in South Jordan, Utah.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2491727779, "total_enterprise": 2975408779, "number_of_employees": 6355, "outstanding_shares": 55384036, "eps": -0.07067, "diluted_eps": -0.0708, "earnings_from_cont_operations": -3898000, "gross_profit": 431514000, "cash": 50080000, "total_debt": 533761000, "total_revenue": 1000028000, "cash_from_operations": 93172000, "net_income": -3898000, "ebitda": 147344000, "year_low_stock_price": 19.5, "year_high_stock_price": 61.93, "seekingalpha_follower_count": 2015, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MMSI.png"}