{"symbol": "MOG.B", "name": "Moog", "next_earnings_utc": 1595584800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 631278670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "moog.com", "year_founded": 1951, "street_address": "400 Jamison Road", "city": "East Aurora", "state": "NY", "zipcode": "14052", "country": "United States", "phone_number": "716-652-2000", "short_description": "Moog Inc. designs, manufactures, and integrates precision motion and fluid controls and systems for original equipment manufacturers and end users in the aerospace, defense, and industrial markets worldwide.", "long_description": "Moog Inc. designs, manufactures, and integrates precision motion and fluid controls and systems for original equipment manufacturers and end users in the aerospace, defense, and industrial markets worldwide. The company’s Aircrafts Controls segment offers primary and secondary flight controls for military and commercial aircrafts; aftermarket support services; and ground-based navigation aids. Its Space and Defense Controls segment provides controls for satellites, space vehicles, launch vehicles, armored combat vehicles, tactical and strategic missiles, security and surveillance, and other defense applications; and gun aiming, stabilization, and automatic ammunition loading for armored combat vehicles. This segment also offers steering tactical and strategic missiles; and designs, builds, and integrates weapon stores management systems for light attack aerial reconnaissance, ground, and sea platforms. The company’s Industrial Systems segment provides systems for applications in injection and blow molding machinery, metal forming presses, and heavy industry customers in steel and aluminum production; and supplies solutions for power generation applications, electromechanical motion simulation bases, medical training simulators, and custom test systems and controls. This segment also offers systems and components for applications in oil and gas exploration and production; components for wind turbine applications; and components and systems for diagnostic imaging CT scan medical equipment, sleep apnea equipment, oxygen concentrators, infusion therapy, and enteral clinical nutrition. The company was founded in 1951 and is headquartered in East Aurora, New York.", "industry_name": "Aerospace and Defense", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1782386489, "total_enterprise": 2835877489, "number_of_employees": 12809, "outstanding_shares": 32584246, "eps": 5.686161, "diluted_eps": 5.637612, "earnings_from_cont_operations": 195692000, "gross_profit": 838240000, "cash": 115984000, "total_debt": 1169475000, "total_revenue": 3026296000, "cash_from_operations": 153279000, "net_income": 195692000, "ebitda": 381476000, "year_low_stock_price": 33.58, "year_high_stock_price": 95.95, "seekingalpha_follower_count": 281, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MOG.B.png"}