{"symbol": "MS", "name": "Morgan Stanley", "next_earnings_utc": 1594898100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 9052022340.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.83532, "eps_up_revisions": 0, "eps_down_revisions": 12, "revenue_up_revisions": 0, "revenue_down_revisions": 13, "total_analysts": 25, "analysts_sell": 0, "analysts_buy": 10, "analysts_outperform": 5, "analysts_hold": 10, "analysts_underperform": 0, "webpage": "morganstanley.com", "year_founded": 1924, "street_address": "1585 Broadway", "city": "New York", "state": "NY", "zipcode": "10036", "country": "United States", "phone_number": "212-761-4000", "short_description": "Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia.", "long_description": "Morgan Stanley, a financial holding company, provides various financial products and services to corporations, governments, financial institutions, and individuals in the Americas, Europe, the Middle East, Africa, and Asia. The company operates through Institutional Securities, Wealth Management, and Investment Management segments. The Institutional Securities segment offers capital raising and financial advisory services, including services related to the underwriting of debt, equity, and other securities, as well as advice on mergers and acquisitions, restructurings, real estate, and project finance. This segment also provides sales and trading services, including sales, financing, prime brokerage, and market-making services in equity and fixed income products consisting of foreign exchange and commodities; corporate and commercial real estate loans, which provides secured lending facilities and financing for sales and trading customers, as well as asset-backed and mortgage lending; and wealth management services, investment, and research services. The Wealth Management segment offers various financial services and solutions covering brokerage and investment advisory services; financial and wealth planning services; stock plan administration services; annuity and insurance products; securities-based lending, residential real estate loans, and other lending products; and banking and retirement plan services to individual investors and small to medium-sized businesses and institutions. The Investment Management segment provides various investment strategies and products comprising equity, fixed income, liquidity, and alternative/other products to benefit/defined contribution plans, foundations, endowments, government entities, sovereign wealth funds, insurance companies, and third-party fund sponsors and corporations through a network of institutional and intermediary channels. Morgan Stanley was founded in 1924 and is headquartered in New York, New York.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 69644011996, "total_enterprise": null, "number_of_employees": 60431, "outstanding_shares": 1575656380, "eps": 4.880439, "diluted_eps": 4.813692, "earnings_from_cont_operations": 8549000000, "gross_profit": 35755000000, "cash": 580460000000, "total_debt": 306230000000, "total_revenue": 40620000000, "cash_from_operations": 47568000000, "net_income": 8311000000, "ebitda": null, "year_low_stock_price": 27.2, "year_high_stock_price": 57.57, "seekingalpha_follower_count": 81308, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MS.png"}