{"symbol": "MSBI", "name": "Midland States Bancorp", "next_earnings_utc": 1595536200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 64820000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.3375, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "midlandsb.com", "year_founded": 1881, "street_address": "1201 Network Centre Drive", "city": "Effingham", "state": "IL", "zipcode": "62401", "country": "United States", "phone_number": "217-342-7321", "short_description": "Midland States Bancorp, Inc. operates as a financial holding company for Midland States Bank that provides various banking products and services to individuals, businesses, municipalities, and other entities.", "long_description": "Midland States Bancorp, Inc. operates as a financial holding company for Midland States Bank that provides various banking products and services to individuals, businesses, municipalities, and other entities. It operates through Banking, Commercial FHA Origination and Servicing, Wealth Management, and Other segments. The company accepts various deposits, such as checking, savings, money market, and sweep accounts, as well as certificates of deposit, noninterest-bearing and interest-bearing demand deposits, and time deposits. Its loan portfolio include commercial lending products consisting of owner occupied commercial real estate, commercial real estate investment, real estate construction, and multifamily loans, as well as loans to purchase farmland and finance agricultural production; business term loans, equipment financing, and lines of credit; consumer installment loans for purchase cars, boats, other recreational vehicles, and appliances, as well as other home improvement projects; and residential first and second mortgage loans, and home equity lines of credit. The company also originates residential mortgage loans; and commercial mortgage loans for multifamily and healthcare facilities. In addition, it provides trust and wealth management products and services, including financial and estate planning, trustee and custodial services, investment management, tax and insurance planning, business planning, corporate retirement plan consulting and administration, and retail brokerage services. Further, the company offers commercial equipment leasing and merchant services. As of December 31, 2018, it operated 69 banking offices in 48 communities within its market areas, such as Illinois and the St. Louis metropolitan areas. The company was founded in 1881 and is headquartered in Effingham, Illinois.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 347349134, "total_enterprise": null, "number_of_employees": 1100, "outstanding_shares": 23203015, "eps": 1.758727, "diluted_eps": 1.747122, "earnings_from_cont_operations": 43351000, "gross_profit": 243935000, "cash": 453701000, "total_debt": 869969000, "total_revenue": 243935000, "cash_from_operations": 104959000, "net_income": 43351000, "ebitda": null, "year_low_stock_price": 12.49, "year_high_stock_price": 29.5, "seekingalpha_follower_count": 264, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MSBI.png"}