{"symbol": "MTB", "name": "M&T Bank", "next_earnings_utc": 1595241300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1462909620.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 2.09521, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 0, "revenue_down_revisions": 6, "total_analysts": 22, "analysts_sell": 2, "analysts_buy": 1, "analysts_outperform": 3, "analysts_hold": 16, "analysts_underperform": 0, "webpage": "mtb.com", "year_founded": 1856, "street_address": "One M&T Plaza", "city": "Buffalo", "state": "NY", "zipcode": "14203", "country": "United States", "phone_number": "716-635-4000", "short_description": "M&T Bank Corporation operates as the holding company for Manufacturers and Traders Trust Company; and Wilmington Trust, National Association that provide banking services.", "long_description": "M&T Bank Corporation operates as the holding company for Manufacturers and Traders Trust Company; and Wilmington Trust, National Association that provide banking services. The company's Business Banking segment offers deposits, business loans and leases, and credit cards; and cash management, payroll, and letters of credit services to small businesses and professionals. Its Commercial Banking segment provides credit and banking services for middle-market and large commercial customers. The company's Commercial Real Estate segment offers multifamily residential and commercial real estate credit, and deposit services. Its Discretionary Portfolio segment provides deposits; securities, residential real estate loans, and other assets; and short and long term borrowed funds, as well as foreign exchange services. The company's Residential Mortgage Banking segment offers residential real estate loans for consumers and sells those loans in the secondary market; and purchases servicing rights to loans originated by other entities. Its Retail Banking segment offers demand, savings, and time accounts; consumer installment loans, automobile and recreational finance loans, home equity loans and lines of credit, and credit cards; mutual funds and annuities; and other services. The company also provides trust and wealth management; fiduciary and custodial; investment management; and insurance agency services. It offers its services through banking offices, business banking centers, telephone and Internet banking, mobile banking, and automated teller machines. As of December 31, 2019, the company operates 731 domestic banking offices in New York State, Maryland, New Jersey, Pennsylvania, Delaware, Connecticut, Virginia, West Virginia, and the District of Columbia; a full-service commercial banking office in Ontario, and Canada; and an office in George Town, Cayman Islands. M&T Bank Corporation was founded in 1856 and is headquartered in Buffalo, New York.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 13553290629, "total_enterprise": null, "number_of_employees": 17386, "outstanding_shares": 128272673, "eps": 12.37443, "diluted_eps": 12.368953, "earnings_from_cont_operations": 1715229000, "gross_profit": 5695283000, "cash": 11444137000, "total_debt": 6545336000, "total_revenue": 5695283000, "cash_from_operations": 1549807000, "net_income": 1715229000, "ebitda": null, "year_low_stock_price": 85.09, "year_high_stock_price": 174.93, "seekingalpha_follower_count": 9198, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MTB.png"}