{"symbol": "MTRN", "name": "Materion", "next_earnings_utc": 1595505300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 282550000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.42, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 1, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "materion.com", "year_founded": 1931, "street_address": "6070 Parkland Boulevard", "city": "Mayfield Heights", "state": "OH", "zipcode": "44124", "country": "United States", "phone_number": "216 486 4200", "short_description": "Materion Corporation manufactures and sells advanced engineered materials used in semiconductor, industrial, aerospace and defense, automotive, energy, consumer electronics, and telecom and data center markets in the United States, Asia, Europe, and internationally.", "long_description": "Materion Corporation manufactures and sells advanced engineered materials used in semiconductor, industrial, aerospace and defense, automotive, energy, consumer electronics, and telecom and data center markets in the United States, Asia, Europe, and internationally. The company operates through Performance Alloys and Composites, Advanced Materials, and Precision Coatings segments. The Performance Alloys and Composites segment provides copper and nickel products in plate, rod, bar, tube, strip, wire product forms, as well as other customized shapes; thick precision strip products; beryllium hydroxide; and beryllium products, such as beryllium composites, ceramics, and engineered clad and plated metal systems, as well as aluminum silicon carbide metal matrix. This segment also produces strip metal products with clad inlay and overlay metals consisting of precious and base metals electroplated systems, electron beam welded systems, contour profiled systems, and solder-coated metal systems. The Advanced Materials segment provides advanced chemicals, microelectronics packaging, precious and non-precious metals, and specialty metal products, including vapor deposition targets, frame lid assemblies, clad and precious metal pre-forms, high temperature braze materials, and ultra-fine wires. The Precision Coatings segment produces sputter-coated precision thin film coatings and optical filter materials. It distributes its products through company-owned facilities, and independent distributors and agents. The company has a strategic collaboration with Kairos Power to develop and supply materials for advanced reactor technology. The company was formerly known as Brush Engineered Materials Inc. and changed its name to Materion Corporation in 2011. Materion Corporation was founded in 1931 and is headquartered in Mayfield Heights, Ohio.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1066266915, "total_enterprise": 1009719915, "number_of_employees": 2600, "outstanding_shares": 20309846, "eps": 1.502923, "diluted_eps": 1.487911, "earnings_from_cont_operations": 30651000, "gross_profit": 235407000, "cash": 107576000, "total_debt": 51029000, "total_revenue": 1161929000, "cash_from_operations": 120969000, "net_income": 30651000, "ebitda": 111454000, "year_low_stock_price": 26.15, "year_high_stock_price": 68.75, "seekingalpha_follower_count": 1347, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MTRN.png"}