{"symbol": "MVC", "name": "MVC Capital", "next_earnings_utc": 1591624800, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 6000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.145, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "mvccapital.com", "year_founded": 1999, "street_address": "Riverview Plaza", "city": "Purchase", "state": "NY", "zipcode": "10577", "country": "United States", "phone_number": "914-510-9400", "short_description": "MVC Capital, Inc. is a business development company specializing in equity, acquisition financing, mezzanine financing, management buyouts, leveraged buildups, corporate partnerships, PIPE transactions, going private transactions, private company recapitalizations, operational turnarounds, and growth and expansion capital transaction financing.", "long_description": "MVC Capital, Inc. is a business development company specializing in equity, acquisition financing, mezzanine financing, management buyouts, leveraged buildups, corporate partnerships, PIPE transactions, going private transactions, private company recapitalizations, operational turnarounds, and growth and expansion capital transaction financing. The company seeks to invest in mature, small, and middle-market companies. It seeks to invest in companies in the consumer products, business services, industrial manufacturing and services, automotive retailing, energy, food and food service, financial services, insurance, industrial distribution and value-added distribution, medical devices and equipment, specialty chemicals, and security sectors. The company prefers to invest in companies based in the United States. The firm typically invests between $3 million and $25 million for control and non-control stakes in companies with revenues between $10 million and $150 million and EBITDA between $3 million and $25 million. It prefers to be the lead investor in transactions and also co-invests in companies with other private equity sponsors. The company invests in the form of preferred and common equity, and warrants or rights to acquire equity interests; bridge loans; term loans; debt; cash flow loans; senior and subordinated loans; convertible securities; venture capital; mezzanine; and private equity investments. It exits its investments in the form of maturity of loan, public offering, sale, mergers and acquisitions, and financial recapitalizations. It prefers to take majority stake in companies.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "cef", "market_cap": 121948812, "total_enterprise": 209530440, "number_of_employees": 20, "outstanding_shares": 17725118, "eps": 1.34186, "diluted_eps": 1.34186, "earnings_from_cont_operations": 23785336, "gross_profit": 31894696, "cash": 50308071, "total_debt": 137889700, "total_revenue": 31894696, "cash_from_operations": 54627743, "net_income": 23785336, "ebitda": null, "year_low_stock_price": 3.0, "year_high_stock_price": 10.45, "seekingalpha_follower_count": 1297, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/MVC.png"}