{"symbol": "NATH", "name": "Nathan's Famous", "next_earnings_utc": 1591963200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "nathansfamous.com", "year_founded": 1916, "street_address": "One Jericho Plaza", "city": "Jericho", "state": "NY", "zipcode": "11753", "country": "United States", "phone_number": "516 338 8500", "short_description": "Nathan's Famous, Inc., together with its subsidiaries, operates in the foodservice industry.", "long_description": "Nathan's Famous, Inc., together with its subsidiaries, operates in the foodservice industry. The company owns and franchises restaurants under the Nathan's Famous brand name, as well as sells products bearing the Nathan's Famous trademarks through various channels of distribution. It also has license agreements for the manufacture, distribution, marketing, and sale of Nathan's Famous branded hot dogs, sausages, and corned beef products in refrigerated consumer packages to be resold through retail channels, such as supermarkets, groceries, mass merchandisers, and club stores; and other Nathan's Famous branded refrigerated meat products in consumer packages to be resold through retail channels. In addition, the company has license agreements to manufacture Nathan's Famous branded hot dog and sausage products in bulk for use in the food service industry; for supplying Nathan's Famous natural casing and skinless hot dogs in bulk for use in the Nathan's Famous restaurant system; to manufacture proprietary spices; to manufacture and sell various products, including mustard, salsa, sauerkraut, and pickles; to produce and sell French fries and onion rings for retail sale; and to manufacture and sell miniature bagel dogs, franks-in-a-blanket, and other hors d'oeuvres through club stores, supermarkets, and other retail food stores. Further, the company sells Nathan's products directly to end users or to various foodservice distributors, as well as provides Arthur Treacher's brand fish fillets. As of March 29, 2020, its restaurant system consisted of four company-owned units in the New York City metropolitan area; and 216 franchised units located in 21 states and nine foreign countries. Nathan's Famous, Inc. was founded in 1916 and is based in Jericho, New York.", "industry_name": "Hotels, Restaurants and Leisure", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 238612090, "total_enterprise": 317750090, "number_of_employees": 149, "outstanding_shares": 4114711, "eps": 3.186669, "diluted_eps": 3.186669, "earnings_from_cont_operations": 13435000, "gross_profit": 43184000, "cash": 77117000, "total_debt": 156255000, "total_revenue": 103325000, "cash_from_operations": 12349000, "net_income": 13435000, "ebitda": 29355000, "year_low_stock_price": 39.01, "year_high_stock_price": 82.18, "seekingalpha_follower_count": 1370, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NATH.png"}