{"symbol": "NAV", "name": "Navistar International", "next_earnings_utc": 1591266300, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1862475000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.38522, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 15, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 13, "analysts_underperform": 0, "webpage": "navistar.com", "year_founded": 1902, "street_address": "2701 Navistar Drive", "city": "Lisle", "state": "IL", "zipcode": "60532", "country": "United States", "phone_number": "331-332-5000", "short_description": "Navistar International Corporation, through its subsidiaries, manufactures and sells commercial trucks, diesel engines, school and commercial buses, and service parts for trucks and diesel engines worldwide.", "long_description": "Navistar International Corporation, through its subsidiaries, manufactures and sells commercial trucks, diesel engines, school and commercial buses, and service parts for trucks and diesel engines worldwide. The company operates through four segments: Truck, Parts, Global Operations, and Financial Services. It manufactures and distributes Class 4 through 8 trucks and buses in the common carrier, private carrier, government, leasing, construction, energy/petroleum, and student and commercial transportation markets under the International and IC brands; and designs, engineers, and produces sheet metal components, including truck cabs and engines. The company also provides customers with proprietary products needed to support the International commercial truck, IC bus, and engine lines, as well as other product lines; and a selection of other standard truck, trailer, and engine aftermarket parts. In addition, it manufactures and distributes mid-range diesel engines, as well as provides customers with additional engine offerings in the agriculture, marine, genset, and light truck markets; sells engines to original equipment manufacturers (OEM) for various on-and-off-road applications; and offers contract manufacturing services under the MWM brand to OEMs for the assembly of their engines. Further, the company provides retail, wholesale, and lease financing of products of its trucks and parts, as well as financing for wholesale and retail accounts receivable. Additionally, it offers military parts and chasis. The company markets its commercial products through an independent dealer network, as well as through retail outlets; and its reconditioned used trucks to owner-operators and fleet buyers through its network of used truck dealers. It operates approximately 1,052 outlets in the United States and Canada, and 89 outlets in Mexico. Navistar International Corporation was founded in 1902 and is headquartered in Lisle, Illinois.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2501201628, "total_enterprise": 6372201628, "number_of_employees": 13300, "outstanding_shares": 99490916, "eps": 1.750503, "diluted_eps": 1.74967, "earnings_from_cont_operations": 194000000, "gross_profit": 1678000000, "cash": 977000000, "total_debt": 4844000000, "total_revenue": 10656000000, "cash_from_operations": 789000000, "net_income": 174000000, "ebitda": 696000000, "year_low_stock_price": 15.01, "year_high_stock_price": 38.0, "seekingalpha_follower_count": 9564, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NAV.png"}