{"symbol": "NBHC", "name": "National Bank Holdings", "next_earnings_utc": 1595362200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 73201200.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.42, "eps_up_revisions": 1, "eps_down_revisions": 4, "revenue_up_revisions": 3, "revenue_down_revisions": 2, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "nationalbankholdings.com", "year_founded": 2009, "street_address": "7800 East Orchard Road", "city": "Greenwood Village", "state": "CO", "zipcode": "80111", "country": "United States", "phone_number": "720-529-3336", "short_description": "National Bank Holdings Corporation operates as the bank holding company for NBH Bank, N.A. that provides various banking products and financial services to commercial, business, and consumer clients in the United States.", "long_description": "National Bank Holdings Corporation operates as the bank holding company for NBH Bank, N.A. that provides various banking products and financial services to commercial, business, and consumer clients in the United States. The company offers deposit products, including checking accounts, savings accounts, money market accounts, and other deposit accounts, including fixed-rate and fixed maturity time deposits. It also provides commercial and industrial loans and leases, such as working capital loans, equipment loans, lender finance loans, agriculture loans, government and non-profit loans, owner occupied commercial real estate loans, and other commercial loans and leases. The company also offers non-owner occupied commercial real estate loans consisting of loans on commercial properties, such as office buildings, warehouse/distribution buildings, and multi-family and retail buildings; and small business administration loans to support manufacturers, distributors, and service providers; term loans, line of credit, and real estate secured loans; residential real estate loans; and consumer loans. In addition, it offers treasury management solutions comprising online and mobile banking, commercial credit card, wire transfer, automated clearing house, electronic bill payment, lock box, remote deposit capture, merchant processing, cash vault, controlled disbursements, and fraud prevention services, as well as other auxiliary services, including account reconciliation, collections, repurchase accounts, zero balance accounts, and sweep accounts. As of December 31, 2018, the company operated through a network of 104 banking centers located in Colorado, the greater Kansas City area, New Mexico, and Texas. It also operates 128 ATMs. The company was formerly known as NBH Holdings Corp. and changed its name to National Bank Holdings Corporation in March 2012. National Bank Holdings Corporation was incorporated in 2009 and is headquartered in Greenwood Village, Colorado.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 803792619, "total_enterprise": null, "number_of_employees": 1264, "outstanding_shares": 30562457, "eps": 2.471329, "diluted_eps": 2.450592, "earnings_from_cont_operations": 77267000, "gross_profit": 278560000, "cash": 162561000, "total_debt": 439877000, "total_revenue": 278560000, "cash_from_operations": 72338000, "net_income": 77267000, "ebitda": null, "year_low_stock_price": 20.25, "year_high_stock_price": 37.97, "seekingalpha_follower_count": 395, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NBHC.png"}