{"symbol": "NCBS", "name": "Nicolet Bankshares", "next_earnings_utc": 1595361900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 32373500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.97, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 3, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "nicoletbank.com", "year_founded": 2000, "street_address": "111 North Washington Street", "city": "Green Bay", "state": "WI", "zipcode": "54301", "country": "United States", "phone_number": "920-430-1400", "short_description": "Nicolet Bankshares, Inc. operates as the holding company for Nicolet National Bank that provides commercial and retail banking services for businesses and individuals.", "long_description": "Nicolet Bankshares, Inc. operates as the holding company for Nicolet National Bank that provides commercial and retail banking services for businesses and individuals. The company accepts checking, savings, and money market accounts; various certificates of deposit; and individual retirement accounts. It also offers commercial loans, including commercial, industrial, and business loans and lines of credit; owner-occupied commercial real estate loans; agricultural (AG) production and AG real estate loans; commercial real estate investment real estate loans; construction and land development loans; residential real estate loans, such as residential first lien mortgages, junior lien mortgages, home equity loans, lines of credit, and residential construction loans; and consumer loans. In addition, the company provides cash management, international banking, personal brokerage, safe deposit boxes, and trust and fiduciary services, as well as wealth management and retirement plan services. Further, it offers mortgage refinancing; online services, such as commercial, retail, and trust online banking; automated bill payment, mobile banking deposits and account access, remote deposit capture, and telephone banking services; and other services consisting of wire transfers, debit cards, credit cards, pre-paid gift cards, direct deposits, and official bank checks. Additionally, the company provides investment strategy and transactional services to financial institutions. As of December 31, 2018, it operated 38 branches located in northeast and central Wisconsin, as well as in Menominee, Michigan. The company was formerly known as Green Bay Financial Corporation and changed its name to Nicolet Bankshares, Inc. in March 2002. Nicolet Bankshares, Inc. was founded in 2000 and is headquartered in Green Bay, Wisconsin.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 581037071, "total_enterprise": null, "number_of_employees": 575, "outstanding_shares": 10392364, "eps": 5.590424, "diluted_eps": 5.411741, "earnings_from_cont_operations": 55311000, "gross_profit": 169632000, "cash": 258864000, "total_debt": 157741000, "total_revenue": 169632000, "cash_from_operations": 60005000, "net_income": 54929000, "ebitda": null, "year_low_stock_price": 45.33, "year_high_stock_price": 75.99, "seekingalpha_follower_count": 205, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NCBS.png"}