{"symbol": "NDAQ", "name": "Nasdaq", "next_earnings_utc": 1595415600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 665071740.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.37334, "eps_up_revisions": 15, "eps_down_revisions": 3, "revenue_up_revisions": 9, "revenue_down_revisions": 3, "total_analysts": 20, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 4, "analysts_hold": 9, "analysts_underperform": 1, "webpage": "nasdaq.com", "year_founded": 1971, "street_address": "151 West 42nd Street", "city": "New York", "state": "NY", "zipcode": "10036", "country": "United States", "phone_number": "212-401-8700", "short_description": "Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide.", "long_description": "Nasdaq, Inc. operates as a technology company that serves capital markets and other industries worldwide. The company's Market Services segment includes equity derivative trading and clearing, cash equity trading, fixed income and commodities trading and clearing, and trade management service businesses. This segment operates various exchanges and other marketplace facilities across various asset classes, which consist of commodities, cash equity, debt, structured products, and exchange traded products; and provides broker, clearing, settlement, and central depository services. Its Corporate Services segment includes listing services and corporate solution businesses that deliver critical capital market and governance solutions to public and private companies. The company's Information Services segment provides market data, index, and investment data and analytics to institutional and retail investors. Its Market Technology segment offers technology solutions for trading, clearing, settlement, surveillance, depository, and information dissemination to markets. It also provides Nasdaq Trade Surveillance solution, a managed service designed for brokers and other market participants; and Nasdaq Risk, a suite of products that offer a real-time, multi-tiered risk solution that integrates pre-, at-and on-trade risk management and margining. In addition, the company offers corporate responsibility and environmental, social, and governance data management and reporting services. The company was formerly known as The NASDAQ OMX Group, Inc. and changed its name to Nasdaq, Inc. in September 2015. Nasdaq, Inc. was founded in 1971 and is headquartered in New York, New York.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 19435831706, "total_enterprise": 22804831706, "number_of_employees": 4361, "outstanding_shares": 164070840, "eps": 4.429298, "diluted_eps": 4.36972, "earnings_from_cont_operations": 730000000, "gross_profit": 2602000000, "cash": 1109000000, "total_debt": 4476000000, "total_revenue": 4576000000, "cash_from_operations": 1006000000, "net_income": 730000000, "ebitda": 1337000000, "year_low_stock_price": 71.66, "year_high_stock_price": 120.23, "seekingalpha_follower_count": 17818, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NDAQ.png"}