{"symbol": "NES", "name": "Nuverra Environmental Solutions", "next_earnings_utc": 1592944200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "nuverra.com", "year_founded": 2007, "street_address": "6720 North Scottsdale Road", "city": "Scottsdale", "state": "AZ", "zipcode": "85253", "country": "United States", "phone_number": "602 903 7802", "short_description": "Nuverra Environmental Solutions, Inc. provides water logistics and oilfield services to customers focused on the development and ongoing production of oil and natural gas from shale formations in the United States.", "long_description": "Nuverra Environmental Solutions, Inc. provides water logistics and oilfield services to customers focused on the development and ongoing production of oil and natural gas from shale formations in the United States. The company provides water transfer, disposal, rental, and other services associated with the drilling, completion, and ongoing production of shale oil and natural gas. It operates through three divisions: the Rocky Mountain, the Northeast, and the Southern. The Rocky Mountain Division manages a fleet of 204 trucks; owns, manages, and leases a network of 20 salt water disposal wells under the Landtech brand names; and maintains and leases rental equipment, including tanks, loaders, manlifts, light towers, winch trucks, and other miscellaneous equipment used in drilling and completion activities to oil and gas operators and others, as well as provides oilfield labor services. The Northeast Division manages a fleet of 201 trucks; owns, manages, and leases a network of 14 salt water disposal wells under the Nuverra, Heckmann, and Clearwater brands; and maintains and leases rental equipment, including tanks and winch trucks used in drilling and completion activities to oil and gas operators and others. The Southern Division manages a fleet of 34 trucks; owns and operates 60-mile underground twin pipeline network; owns, manages, and leases a network of 7 salt water disposal wells; and maintains and leases rental equipment, including tanks and winch trucks used in drilling and completion activities to oil and gas operators and others. The company was formerly known as Heckmann Corporation and changed its name to Nuverra Environmental Solutions, Inc. in May 2013. Nuverra Environmental Solutions, Inc. was founded in 2007 and is headquartered in Scottsdale, Arizona.", "industry_name": "Energy Equipment and Services", "sector_name": "Energy", "is_defunct": false, "exchange": "NYSEMKT", "equity_type": "stocks", "market_cap": 27000309, "total_enterprise": 61546309, "number_of_employees": 700, "outstanding_shares": 15761082, "eps": -3.504529, "diluted_eps": -3.504529, "earnings_from_cont_operations": -54937000, "gross_profit": 37219000, "cash": 4788000, "total_debt": 39334000, "total_revenue": 168238000, "cash_from_operations": 6519000, "net_income": -54937000, "ebitda": 16355000, "year_low_stock_price": 0.9429, "year_high_stock_price": 7.69, "seekingalpha_follower_count": 8295, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NES.png"}