{"symbol": "NIDB", "name": "Northeast Indiana Bancorp", "next_earnings_utc": 1594648800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "firstfedindiana.bank", "year_founded": 1995, "street_address": "648 North Jefferson Street", "city": "Huntington", "state": "IN", "zipcode": "46750", "country": "United States", "phone_number": "260-356-3311", "short_description": "Northeast Indiana Bancorp, Inc. operates as the bank holding company for First Federal Savings Bank that provides various banking and financial advisory services.", "long_description": "Northeast Indiana Bancorp, Inc. operates as the bank holding company for First Federal Savings Bank that provides various banking and financial advisory services. The company provides various personal products, including checking accounts, savings accounts, certificates of deposit, retirement accounts, health savings accounts, and direct deposits. Its loan portfolio comprises mortgage loans, such as home purchases, refinances, new construction loans, and home equity/home improvement loans; installment loans consisting of auto loans, personal loans, short term notes, and savings account loans, as well as RV, ATV, and boat loans; and commercial loans, including lines of credit, letters of credit, equipment financing, and construction loans, as well as commercial loans comprising revolving line of credit, term loans, real estate loans, letter of credit, and small business administration loans. The company also offers debit and credit cards, safe deposit boxes, online banking services, merchant services, and cash management services, as well as treasury management and merchant deposit capture services. In addition, it provides various financial services to individual and corporate clients, including brokerage accounts, retail funds, and wealth management products, as well as insurance products and retirement plans. As of April 29, 2020, the company operated five full service locations in Huntington; two full service location in Warsaw; and two full service locations in Fort Wayne, Indiana. Northeast Indiana Bancorp, Inc. was founded in 1995 and is based in Huntington, Indiana.", "industry_name": "Thrifts and Mortgage Finance", "sector_name": "Financials", "is_defunct": false, "exchange": "OTCQB", "equity_type": "stocks", "market_cap": 36309810, "total_enterprise": null, "number_of_employees": 55, "outstanding_shares": 1210327, "eps": 3.887018, "diluted_eps": 3.887018, "earnings_from_cont_operations": 4660940, "gross_profit": 14579775, "cash": 18466851, "total_debt": 52152674, "total_revenue": 14579775, "cash_from_operations": 5748159, "net_income": 4660940, "ebitda": null, "year_low_stock_price": 26.01, "year_high_stock_price": 42.5, "seekingalpha_follower_count": 153, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NIDB.png"}