{"symbol": "NKE", "name": "NIKE", "next_earnings_utc": 1593116100, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7709111110.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.14108, "eps_up_revisions": 0, "eps_down_revisions": 24, "revenue_up_revisions": 0, "revenue_down_revisions": 27, "total_analysts": 34, "analysts_sell": 0, "analysts_buy": 18, "analysts_outperform": 9, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "nike.com", "year_founded": 1964, "street_address": "One Bowerman Drive", "city": "Beaverton", "state": "OR", "zipcode": "97005", "country": "United States", "phone_number": "503 671 6453", "short_description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide.", "long_description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells athletic footwear, apparel, equipment, and accessories worldwide. The company offers NIKE brand products in six categories, including running, NIKE basketball, the Jordan brand, football, training, and sportswear. It also markets products designed for kids, as well as for other athletic and recreational uses, such as American football, baseball, cricket, golf, lacrosse, skateboarding, tennis, volleyball, walking, wrestling, and other outdoor activities; and apparel with licensed college and professional team and league logos, as well as sells sports apparel. In addition, the company sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities; and various plastic products to other manufacturers. Further, it provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks; and action sports and youth lifestyle apparel and accessories under the Hurley trademark. Additionally, the company licenses agreements that permit unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. It sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 149951999399, "total_enterprise": 153425999399, "number_of_employees": 76700, "outstanding_shares": 1555034734, "eps": 2.763608, "diluted_eps": 2.709458, "earnings_from_cont_operations": 4318000000, "gross_profit": 18521000000, "cash": 3182000000, "total_debt": 6656000000, "total_revenue": 41274000000, "cash_from_operations": 4496000000, "net_income": 4318000000, "ebitda": 5860000000, "year_low_stock_price": 60.0, "year_high_stock_price": 105.62, "seekingalpha_follower_count": 176795, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NKE.png"}