{"symbol": "NMXS", "name": "Net Medical Xpress Solutions", "next_earnings_utc": 1592339400, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "netmedical.com", "year_founded": 1980, "street_address": "8206 Louisiana Boulevard", "city": "Albuquerque", "state": "NM", "zipcode": "87113", "country": "United States", "phone_number": "505-255-1999", "short_description": "Net Medical Xpress Solutions, Inc. develops and markets Internet technology-based software solutions.", "long_description": "Net Medical Xpress Solutions, Inc. develops and markets Internet technology-based software solutions. It offers software products and services, such as telemedicine building block, an online service for doctors, offices, hospitals, and clinics for telemedicine services; digital paper, a paper form and turns into an online fill-out list; and single pane of glass software that allows a provider to be connected into a video conference with a patient. The company also provides electronic prescription system for physicians in private practice; electronic prior authorization system, which connects to health plans and pharmacies to verify prior authorization requirements related to medical tests, procedures, devices, and drugs that require pre-approval by insurers; and Electronic Medical Records (EMR) that provides the ability to connect with 43 various hospital EMR systems. In addition, it offers hardware products, such as Web real time communications, an advanced televideo conferencing system, as well as medical cart and various net medical USB digital diagnosing tools. Further, the company provides video clinical services, such as neurology and stroke assessment, behavioral assessment, and critical care; diagnostic services, including radiology and cardiology; and video primary care services. Additionally, it provides management and administrative services, such as credentialing, call center, recruiting and staffing, and professional liability insurance services; software hosting and maintenance, and custom programming; scanning services; and consulting, training, and installation services. The company was formerly known as New Mexico Software, Inc. and changed its name to Net Medical Xpress Solutions, Inc. in January 2013. Net Medical Xpress Solutions, Inc. was founded in 1980 and is based in Albuquerque, New Mexico.", "industry_name": "Health Care Technology", "sector_name": "Health Care", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 1902518, "total_enterprise": null, "number_of_employees": 23, "outstanding_shares": 23846476, "eps": -0.015588, "diluted_eps": -0.019991, "earnings_from_cont_operations": -303000, "gross_profit": 689000, "cash": 226000, "total_debt": null, "total_revenue": null, "cash_from_operations": -189000, "net_income": null, "ebitda": null, "year_low_stock_price": 0.02, "year_high_stock_price": 0.1425, "seekingalpha_follower_count": 94, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NMXS.png"}