{"symbol": "NTAP", "name": "NetApp, Inc.", "next_earnings_utc": 1590609600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1373829140.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.05249, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 15, "total_analysts": 26, "analysts_sell": 2, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 19, "analysts_underperform": 1, "webpage": "netapp.com", "year_founded": 1992, "street_address": "1395 Crossman Avenue", "city": "Sunnyvale", "state": "CA", "zipcode": "94089", "country": "United States", "phone_number": "408-822-6000", "short_description": "NetApp, Inc. provides software, systems, and services to manage and share data on-premises, and private and public clouds worldwide.", "long_description": "NetApp, Inc. provides software, systems, and services to manage and share data on-premises, and private and public clouds worldwide. The company offers cloud data services, including NetApp Cloud Volumes Service for AWS, NetApp Cloud Volumes ONTAP, NetApp Cloud Sync, NetApp Cloud Secure, NetApp Cloud Tiering, NetApp SaaS Backup, NetApp Kubernetes Service, and NetApp Cloud Insights. It also provides cloud infrastructure solutions, such as FlexPod, a portfolio of pre-validated designs and integration; NetApp HCI for public cloud consumption experience; and NetApp StorageGRID, a software-defined object-based storage solution. In addition, the company offers storage systems and software, including all-flash arrays that support data management; hybrid arrays to deploy the speed of flash storage; NetApp ONTAP storage operating system; NetApp ONTAP Select, which offers robust enterprise storage services; NetApp MAX Data; NetApp FlexArray storage virtualization software; NetApp OnCommand API Services; NetApp Active IQ software; NetApp data availability services; NetApp SnapCenter backup management software; NetApp SnapMirror data replication software; NetApp MetroCluster business continuity softwar; NetApp SnapLock data compliance software; NetApp SANtricity storage operating system; and NetApp Element operating system. Further, it provides software maintenance, hardware maintenance, and other services, including professional services, global support solutions, and customer education and training. It serves the energy, financial services, government, high technology, Internet, life sciences, healthcare services, manufacturing, media, entertainment, animation, video postproduction, and telecommunications through a direct sales force and an ecosystem of partners. NetApp, Inc. was founded in 1992 and is headquartered in Sunnyvale, California.", "industry_name": "Technology Hardware, Storage and Peripherals", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 10056919508, "total_enterprise": 9028919508, "number_of_employees": 10500, "outstanding_shares": 221177029, "eps": 4.317796, "diluted_eps": 4.263497, "earnings_from_cont_operations": 1019000000, "gross_profit": 3708000000, "cash": 3016000000, "total_debt": 1988000000, "total_revenue": 5603000000, "cash_from_operations": 1076000000, "net_income": 1019000000, "ebitda": 1120000000, "year_low_stock_price": 34.66, "year_high_stock_price": 69.18, "stocktwits_watchlist_count": 3007, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NTAP.png"}