{"symbol": "NTNX", "name": "Nutanix, Inc.", "next_earnings_utc": 1590609600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 314533940.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.85683, "eps_up_revisions": 3, "eps_down_revisions": 13, "revenue_up_revisions": 0, "revenue_down_revisions": 12, "total_analysts": 19, "analysts_sell": 1, "analysts_buy": 6, "analysts_outperform": 3, "analysts_hold": 8, "analysts_underperform": 1, "webpage": "nutanix.com", "year_founded": 2009, "street_address": "1740 Technology Drive", "city": "San Jose", "state": "CA", "zipcode": "95110", "country": "United States", "phone_number": "408-216-8360", "short_description": "Nutanix, Inc. develops and provides an enterprise cloud platform in North America, Europe, the Asia Pacific, the Middle East, Latin America, and Africa.", "long_description": "Nutanix, Inc. develops and provides an enterprise cloud platform in North America, Europe, the Asia Pacific, the Middle East, Latin America, and Africa. The company offers Acropolis, an enterprise cloud platform that converges virtualization, enterprise storage services, and virtual networking and platform services; Nutanix Prism, a consumer-grade control plane, which provides management and analytics; and Acropolis Hypervisor, an enterprise-grade virtualization solution. It also offers Nutanix Calm, an enterprise cloud platform that automates the provisioning, scaling, and updating of applications; Nutanix Files, a software-defined file storage consolidation solution; Nutanix Flow, an application-centric network and policy management solution; and Prism Pro, a solution to analyse large volumes of system. In addition, the company provides Nutanix Objects, a scalable, software-defined object storage solution; Nutanix Karbon, a turnkey enterprise-grade Kubernetes service offering; Nutanix Move solution simplifies and streamlines the enterprise cloud transition; Nutanix Era, a database services software suite; Nutanix Volumes, a scale-out storage solution for non-virtualized workloads; Xi IoT, a cloud-agnostic edge computing platform; Xi Leap, a hybrid cloud disaster recovery service that enables enterprises to protect on-premises workloads and data; Xi Frame, a cloud-native and infrastructure-independent desktop-as-a-service platform; and Xi Beam, a multi-cloud cost and security compliance optimization service, as well as developing Xi Clusters solution, which allow deployment of Acropolis on Amazon Web services infrastructure. It serves customers in a range of industries, including automotive, consumer goods, education, energy, financial services, healthcare, manufacturing, media, public sector, retail, technology, and telecommunications, as well as service providers. The company was founded in 2009 and is headquartered in San Jose, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 4673630583, "total_enterprise": 4490026583, "number_of_employees": 5340, "outstanding_shares": 194653502, "eps": -4.528687, "diluted_eps": -4.528687, "earnings_from_cont_operations": -851015000, "gross_profit": 957945000, "cash": 819000000, "total_debt": 635396000, "total_revenue": 1249035000, "cash_from_operations": -124800000, "net_income": -851015000, "ebitda": -737534000, "year_low_stock_price": 11.31, "year_high_stock_price": 38.66, "stocktwits_watchlist_count": 14029, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NTNX.png"}