{"symbol": "NWFL", "name": "Norwood Financial", "next_earnings_utc": 1595498400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "waynebank.com", "year_founded": 1870, "street_address": "717 Main Street", "city": "Honesdale", "state": "PA", "zipcode": "18431", "country": "United States", "phone_number": "570-253-1455", "short_description": "Norwood Financial Corp. operates as the bank holding company for Wayne Bank that provides various banking products and services.", "long_description": "Norwood Financial Corp. operates as the bank holding company for Wayne Bank that provides various banking products and services. The company accepts a range of deposit products, including interest-bearing and non-interest bearing transaction accounts, and statement savings and money market accounts, as well as certificate of deposits. It also provides various loans, such as commercial loans comprising lines of credit, revolving credit, term loans, mortgages, secured lending products, and letter of credit facilities; municipal finance lending; construction loans for commercial construction projects and single-family residences; land loans; consumer loans; mortgage lending to finance principal residences and second home dwellings; and indirect dealer financing of new and used automobiles, boats, and recreational vehicles. In addition, the company offers investment securities services; trust and investment products; and cash management, direct deposit, remote deposit capture, mobile deposit capture, mobile payment, automated clearing house activity, real estate settlement, and Internet and mobile banking services. Further, it is involved in the annuity and mutual fund sale, and discount brokerage activities, as well as insurance agency business. The company serves consumers, businesses, nonprofit organizations, and municipalities. It operates 27 offices in Northeastern Pennsylvania and the Southern Tier of New York, including 5 offices in Wayne County, 2 offices in Pike County, 4 offices in Monroe County, 2 offices in Lackawanna County, and 2 offices in Luzerne County, Pennsylvania, as well as 28 automated teller machines. The company was founded in 1870 and is headquartered in Honesdale, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 154105651, "total_enterprise": null, "number_of_employees": 217, "outstanding_shares": 6292595, "eps": 2.24989, "diluted_eps": 2.229923, "earnings_from_cont_operations": 14104000, "gross_profit": 44372000, "cash": 38418000, "total_debt": 97231000, "total_revenue": 44372000, "cash_from_operations": 18706000, "net_income": 14104000, "ebitda": null, "year_low_stock_price": 21.2, "year_high_stock_price": 39.69, "seekingalpha_follower_count": 384, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/NWFL.png"}