{"symbol": "OCPNY", "name": "Olympus", "next_earnings_utc": 1591848000, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1919241411.833626, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "olympus-global.com", "year_founded": 1919, "street_address": "Shinjuku Monolith", "city": "Tokyo", "state": null, "zipcode": "163-0914", "country": "Japan", "phone_number": "81 3 3340 2111", "short_description": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide.", "long_description": "Olympus Corporation manufactures and sells precision machineries and instruments worldwide. The company operates through four segments: Medical Business, Scientific Solutions Business, Imaging Business, and Others. It offers video endoscopy systems; gastrointestinal, colono, duodeno, and broncho endoscopes; ultrasound endoscopes and probes, endoscopic ultrasound observation devices, and capsule endoscope systems; reprocessing products for cleaning, disinfection, and sterilization of endoscopy equipment; integrated documentation system for capturing information relevant to endoscopy, therapeutic, and other ancillary equipment; endotherapy devices; endoscopy products for gastrointestinal surgery, bronchial surgery, urology, gynecology, orthopedic surgery, neurosurgery, and anesthesiology; ear, nose, and throat endoscope products; and surgical endoscope ancillary equipment. The company also provides upright, polarizing, inverted, laser scanning confocal, stereo, and macro fluorescence microscopes; box-type fluorescence imaging devices, microscope digital cameras, life science imaging software, bio-imaging systems, and virtual slide systems; metallurgical, semiconductor and flat-panel display inspection, laser scanning, and measuring microscopes; microscopic 3D measurement instruments, and industrial microscope ancillary equipment; and industrial videoscopes and fiberscopes, industrial rigidscopes and ancillary equipment, ultrasonic flaw detectors, eddy current and phased array flaw detectors, and X-ray fluorescence and X-ray diffraction analyzers. In addition, it offers interchangeable lens cameras, compact digital cameras, digital camera accessories, lens barrels units, optical components, digital audio recorders, binoculars, and related software applications. The company was formerly known as Olympus Optical Co., Ltd. and changed its name to Olympus Corporation in October 2003. Olympus Corporation was founded in 1919 and is headquartered in Tokyo, Japan.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 22310163665, "total_enterprise": 23429087647, "number_of_employees": 35124, "outstanding_shares": 1285578607, "eps": 0.419678197730598, "diluted_eps": 0.419446398498109, "earnings_from_cont_operations": 558819469, "gross_profit": 4712800125, "cash": 1331612416, "total_debt": 2458260862, "total_revenue": 7434793812, "cash_from_operations": null, "net_income": 559141566, "ebitda": 1699051195, "year_low_stock_price": 10.64, "year_high_stock_price": 18.88, "seekingalpha_follower_count": 304, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/OCPNY.png"}