{"symbol": "OESX", "name": "Orion Energy Systems", "next_earnings_utc": 1591270200, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 28077000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.02333, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 2, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "orionlighting.com", "year_founded": 1996, "street_address": "2210 Woodland Drive", "city": "Manitowoc", "state": "WI", "zipcode": "54220", "country": "United States", "phone_number": "920-892-9340", "short_description": "Orion Energy Systems, Inc. researches, designs, develops, manufactures, implements, markets, and sells energy management systems for the commercial office and retail, area lighting, and industrial markets in North America.", "long_description": "Orion Energy Systems, Inc. researches, designs, develops, manufactures, implements, markets, and sells energy management systems for the commercial office and retail, area lighting, and industrial markets in North America. The company operates in three segments: Orion U.S. Markets Division, Orion Engineered Systems Division, and Orion Distribution Services Division. It offers LED Troffer Door Retrofit for use in office or retail grid ceilings; and LED interior high bay lighting products, including Apollo class of LED interior fixtures designed for new construction and retrofit projects, as well as ISON class of LED interior fixtures. The company also provides an array of smart building control systems, which provide lighting control options and data intelligence capabilities for building managers under the InteLite brand or procured from third parties; and various other LED, HIF, and induction fixtures for lighting and energy management needs comprising fixtures for agribusinesses, parking lots, roadways, retail, mezzanine, outdoor applications, and private label resale. In addition, it offers lighting-related energy management services, such as site assessment, site field verification, utility incentive and government subsidy management, engineering design, project management, and installation; and sells and distributes replacement lamps and fixture components into the after-market. The company serves customers directly; and through independent sales agencies and distributors, and energy service companies and electrical contractors. Orion Energy Systems, Inc. was founded in 1996 and is headquartered in Manitowoc, Wisconsin.", "industry_name": "Electrical Equipment", "sector_name": "Industrials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 135589099, "total_enterprise": 122834099, "number_of_employees": 186, "outstanding_shares": 30265424, "eps": 0.404552, "diluted_eps": 0.395132, "earnings_from_cont_operations": 12111000, "gross_profit": 35732000, "cash": 13762000, "total_debt": 1007000, "total_revenue": 147392000, "cash_from_operations": 10827000, "net_income": 12111000, "ebitda": 14325000, "year_low_stock_price": 1.92, "year_high_stock_price": 6.4, "seekingalpha_follower_count": 3860, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/OESX.png"}