{"symbol": "ORCL", "name": "Oracle", "next_earnings_utc": 1592337600, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 10729996400.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.16101, "eps_up_revisions": 4, "eps_down_revisions": 24, "revenue_up_revisions": 0, "revenue_down_revisions": 23, "total_analysts": 34, "analysts_sell": 2, "analysts_buy": 6, "analysts_outperform": 4, "analysts_hold": 21, "analysts_underperform": 1, "webpage": "oracle.com", "year_founded": 1977, "street_address": "500 Oracle Parkway", "city": "Redwood City", "state": "CA", "zipcode": "94065", "country": "United States", "phone_number": "650-506-7000", "short_description": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide.", "long_description": "Oracle Corporation provides products and services that address enterprise information technology environments worldwide. The company's cloud and license business engages in the sale, marketing, and delivery of its applications and infrastructure technologies through cloud and on-premise deployment models, including cloud services and license support; and cloud license and on-premise license. Its Software as a Service offerings include a suite of cloud software applications that cover various business functions, including enterprise resource planning, human capital management, customer experience, supply chain management, and others, as well as cloud-based industry solutions. The company also provides cloud Infrastructure as a Service; enterprise database; database products, including MySQL, Oracle TimesTen In-Memory Database, Oracle Berkeley DB, and Oracle NoSQL Database; middleware software; Java; server and storage products; hardware products and services comprising point-of-sale terminals and related hardware for managing businesses within the food and beverage, hotel and retail industries; and hardware products and services for communications networks, including network signaling, policy control and subscriber data management solutions, and session border control technology, among others. In addition, it offers operating systems, including Oracle Linux and Oracle Solaris, virtualization software, and other hardware-related software; management technologies and products, such as Oracle Enterprise Manager; and product repairs, maintenance services, and technical support services. It serves businesses of various sizes, government agencies, educational institutions, and resellers. The company was founded in 1977 and is headquartered in Redwood Shores, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 163544866240, "total_enterprise": 191898866240, "number_of_employees": 136000, "outstanding_shares": 3153584000, "eps": 3.274941, "diluted_eps": 3.179774, "earnings_from_cont_operations": 10759000000, "gross_profit": 31734000000, "cash": 25858000000, "total_debt": 53566000000, "total_revenue": 39766000000, "cash_from_operations": 13947000000, "net_income": 10759000000, "ebitda": 16371000000, "year_low_stock_price": 39.71, "year_high_stock_price": 60.5, "seekingalpha_follower_count": 128508, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ORCL.png"}