{"symbol": "ORI", "name": "Old Republic International", "next_earnings_utc": 1595509200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1949000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.42, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 1, "revenue_down_revisions": 0, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "oldrepublic.com", "year_founded": null, "street_address": "307 North Michigan Avenue", "city": "Chicago", "state": "IL", "zipcode": "60601", "country": "United States", "phone_number": "312-346-8100", "short_description": "Old Republic International Corporation, through its subsidiaries, engages in the insurance underwriting and related services business primarily in the United States and Canada.", "long_description": "Old Republic International Corporation, through its subsidiaries, engages in the insurance underwriting and related services business primarily in the United States and Canada. The company operates through three segments: General Insurance, Title Insurance, and the Republic Financial Indemnity Group Run-off Business. The General Insurance segment offers automobile extended warranty, aviation, commercial automobile, commercial multi-peril, general liability, home warranty, inland marine, travel accident, and workers' compensation insurance products; and financial indemnity products for specialty coverages, including errors and omissions, fidelity, guaranteed asset protection, and surety. This segment provides its insurance products to businesses, government, and other institutions in transportation, commercial construction, healthcare, education, retail and wholesale trade, forest products, energy, general manufacturing, and financial services industries. The Title Insurance segment offers lenders' and owners' title insurance policies to real estate purchasers and investors based upon searches of the public records. This segment also provides escrow closing and construction disbursement services; and real estate information products, national default management services, and various other services pertaining to real estate transfers and loan transactions. The Republic Financial Indemnity Group Run-off Business segment offers private mortgage insurance coverage that protects mortgage lenders and investors from default related losses on residential mortgage loans made primarily to homebuyers. Old Republic International Corporation is headquartered in Chicago, Illinois.", "industry_name": "Insurance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 4676533469, "total_enterprise": 5499833469, "number_of_employees": 9000, "outstanding_shares": 299970075, "eps": 0.131245, "diluted_eps": 0.131245, "earnings_from_cont_operations": 39400000, "gross_profit": 3457400000, "cash": 638400000, "total_debt": 967800000, "total_revenue": 6046600000, "cash_from_operations": 1016300000, "net_income": 39400000, "ebitda": 102000000, "year_low_stock_price": 11.88, "year_high_stock_price": 24.1, "seekingalpha_follower_count": 11323, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ORI.png"}