{"symbol": "OZK", "name": "Bank OZK", "next_earnings_utc": 1595534400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 234759820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.36686, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 3, "revenue_down_revisions": 4, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 1, "analysts_hold": 8, "analysts_underperform": 0, "webpage": "ozk.com", "year_founded": 1903, "street_address": "17901 Chenal Parkway", "city": "Little Rock", "state": "AR", "zipcode": "72223", "country": "United States", "phone_number": "501-978-2265", "short_description": "Bank OZK provides retail and commercial banking services to businesses, individuals, and non-profit and governmental entities.", "long_description": "Bank OZK provides retail and commercial banking services to businesses, individuals, and non-profit and governmental entities. The company accepts non-interest bearing checking, interest bearing transaction, business sweep, savings, money market, individual retirement, and other accounts, as well as time deposits. Its loan products include real estate, small business and consumer, indirect consumer RV and marine, government guaranteed, commercial and industrial, and agricultural loans, as well as mortgage lending products. The company also provides trust and wealth services, including personal trusts, custodial accounts, investment management accounts, and retirement accounts; and corporate trust services, such as trustee, paying agent and registered transfer agent services, and other incidental services. In addition, it offers automated clearing house, wire transfer, transaction reporting, wholesale lockbox, remote deposit capture, automated credit line transfer, reconciliation, positive pay, and merchant and commercial card services, as well as zero balance and investment sweep accounts. Further, the company is involved in the provision of real estate appraisals; ATMs; telephone, online, and mobile banking services; debit cards; safe deposit boxes; and other products and services, as well as processes merchant debit and credit card transactions. As of December 31, 2019, it operated 250 offices in Arkansas, Georgia, Florida, North Carolina, Texas, Alabama, South Carolina, California, New York, and Mississippi. The company was formerly known as Bank of the Ozarks and changed its name to Bank OZK in July 2018. Bank OZK was founded in 1903 and is headquartered in Little Rock, Arkansas.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2892229922, "total_enterprise": null, "number_of_employees": 2774, "outstanding_shares": 128600708, "eps": 2.534948, "diluted_eps": 2.528809, "earnings_from_cont_operations": 327054000, "gross_profit": 838178000, "cash": 1347729000, "total_debt": 1464488000, "total_revenue": 838178000, "cash_from_operations": 387396000, "net_income": 327066000, "ebitda": null, "year_low_stock_price": 14.2, "year_high_stock_price": 31.76, "seekingalpha_follower_count": 10579, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/OZK.png"}