{"symbol": "PACW", "name": "PacWest Bancorp", "next_earnings_utc": 1595329200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 277133380.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.51556, "eps_up_revisions": 0, "eps_down_revisions": 9, "revenue_up_revisions": 5, "revenue_down_revisions": 3, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 2, "analysts_hold": 6, "analysts_underperform": 0, "webpage": "pacwestbancorp.com", "year_founded": 1999, "street_address": "9701 Wilshire Boulevard", "city": "Beverly Hills", "state": "CA", "zipcode": "90212", "country": "United States", "phone_number": "310-887-8500", "short_description": "PacWest Bancorp operates as the holding company for Pacific Western Bank, a state chartered bank that provides commercial banking products and services.", "long_description": "PacWest Bancorp operates as the holding company for Pacific Western Bank, a state chartered bank that provides commercial banking products and services. The company accepts demand, money market, and time deposits. It also provides real estate loans to professional developers and real estate investors for the acquisition, refinancing, and construction of commercial real estate properties; small business administration loans; asset-based loans for working capital needs; venture capital loans to support the start-up operations of entrepreneurial companies; and equipment-secured loans and leases. In addition, the company offers consumer loans comprising personal loans, auto loans, home equity lines of credit, revolving lines of credit, and other loans. Further, it provides international banking and multi-state deposit services; money market sweep products; investment advisory and asset management services; treasury and cash management services; telephone banking, and online and mobile banking services; and foreign exchange and ATM services. The company offers its products and services to small and mid-sized companies, entrepreneurial businesses and their venture capital, private equity investors, professionals, and other individuals. As of January 31, 2019, it had 74 full-service branches located throughout the state of California; and 1 branch in Durham, North Carolina. The company was formerly known as First Community Bancorp and changed its name to PacWest Bancorp in April 2008. PacWest Bancorp was founded in 1999 and is headquartered in Beverly Hills, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2016265891, "total_enterprise": null, "number_of_employees": 1835, "outstanding_shares": 116479832, "eps": -9.164582, "diluted_eps": -9.164582, "earnings_from_cont_operations": -1077079000, "gross_profit": 1018998000, "cash": 613050000, "total_debt": 2896648000, "total_revenue": 1018998000, "cash_from_operations": 546341000, "net_income": -1077079000, "ebitda": null, "year_low_stock_price": 13.84, "year_high_stock_price": 40.14, "seekingalpha_follower_count": 3406, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PACW.png"}