{"symbol": "PFBC", "name": "Preferred Bank", "next_earnings_utc": 1595448300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 42905330.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.9625, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "preferredbank.com", "year_founded": 1991, "street_address": "601 South Figueroa Street", "city": "Los Angeles", "state": "CA", "zipcode": "90017", "country": "United States", "phone_number": "213-891-1188", "short_description": "Preferred Bank provides various commercial banking products and services to small and mid-sized businesses and their owners, entrepreneurs, real estate developers and investors, professionals, and high net worth individuals in the United States.", "long_description": "Preferred Bank provides various commercial banking products and services to small and mid-sized businesses and their owners, entrepreneurs, real estate developers and investors, professionals, and high net worth individuals in the United States. The company's deposit products include checking, savings, and money market deposit accounts; fixed-rate and fixed maturity retail, and non-retail certificates of deposit; and individual retirement accounts. It also provides real estate mortgage loans that are secured by retail, industrial, office, special purpose, and residential single and multi-family properties; real estate construction loans; commercial loans comprising lines of credit for working capital and term loans for capital expenditures; and commercial and export letters of credit, import lines of credit, documentary collections, international wire transfers, export financing products, bills purchase programs, and acceptances/trust receipt financing products, as well as standby letters of credit and foreign exchange services for importers and exporters. In addition, it offers various high-wealth banking services to wealthy individuals residing in the Pacific Rim area with residences, real estate investments, or businesses in Southern California. Further, it provides various banking services to physicians, accountants, attorneys, business managers, and other professionals; and safe deposit boxes, account reconciliation, courier service, and cash management services to the manufacturing, service, and distribution companies. Additionally, it offers remote deposit capture, and Internet and mobile banking services. As of December 31, 2018, it had 13 full-service branch offices in Alhambra, Arcadia, Century City, City of Industry, Diamond Bar, Los Angeles, Pico Rivera, San Francisco, Tarzana, Torrance, and Irvine, California; and Flushing, New York. The company was founded in 1991 and is headquartered in Los Angeles, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 558909428, "total_enterprise": null, "number_of_employees": 279, "outstanding_shares": 14876482, "eps": 5.017651, "diluted_eps": 5.012311, "earnings_from_cont_operations": 75782000, "gross_profit": 158839000, "cash": 484869000, "total_debt": 119249000, "total_revenue": 158839000, "cash_from_operations": 84788000, "net_income": 75782000, "ebitda": null, "year_low_stock_price": 20.04, "year_high_stock_price": 64.5, "seekingalpha_follower_count": 685, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PFBC.png"}