{"symbol": "PFIS", "name": "Peoples Financial Services", "next_earnings_utc": 1595599200, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "psbt.com", "year_founded": 1905, "street_address": "150 North Washington Avenue", "city": "Scranton", "state": "PA", "zipcode": "18503", "country": "United States", "phone_number": "570-346-7741", "short_description": "Peoples Financial Services Corp. operates as the bank holding company for Peoples Security Bank and Trust Company that provides financial services.", "long_description": "Peoples Financial Services Corp. operates as the bank holding company for Peoples Security Bank and Trust Company that provides financial services. The company accepts money market, NOW, savings, individual retirement, demand deposit, and certificates of deposit accounts. Its loan products include residential real estate, automobile, manufactured housing, personal, student, and home equity loans; and commercial real estate, working capital, construction, small business administration, and agricultural loans, as well as loans for equipment and other commercial needs, and mineral rights. The company also offers investment management, IRA trustee, estate administration, living and life insurance trust, trustee under will, guardianship, custodial/IRA custodial, and corporate trust services, as well as pension and profit sharing plans. In addition, it provides investment portfolio management, estate and business succession planning, annuities, insurance, retirement plan, and tax planning, as well as education funding strategies; and securities and brokerage, and investor services. Further, the company offers small business checking and merchant money market accounts, online and telephone banking, business credit cards, merchant line of credit, and financial checkup services. Additionally, it provides various other services, including remote deposit capture; automatic clearing house transactions; cash management services; automated teller machines; point of sale transactions; safe deposit boxes; night depository services; direct deposit; and official check services. The company serves business, non-profit, governmental, municipal agency, and professional customers, as well as retail customers through 27 full-service community banking offices located in Pennsylvania; and Broome County of New York. Peoples Financial Services Corp. was founded in 1905 and is headquartered in Scranton, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 242694082, "total_enterprise": null, "number_of_employees": 408, "outstanding_shares": 7343240, "eps": 3.329262, "diluted_eps": 3.319752, "earnings_from_cont_operations": 24605000, "gross_profit": 83481000, "cash": 51972000, "total_debt": 211162000, "total_revenue": 83481000, "cash_from_operations": 40241000, "net_income": 24605000, "ebitda": null, "year_low_stock_price": 29.01, "year_high_stock_price": 53.88, "seekingalpha_follower_count": 235, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PFIS.png"}