{"symbol": "PG", "name": "The Procter & Gamble Company", "next_earnings_utc": 1594983600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 16922040320.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.01104, "eps_up_revisions": 2, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 16, "total_analysts": 23, "analysts_sell": 0, "analysts_buy": 9, "analysts_outperform": 4, "analysts_hold": 9, "analysts_underperform": 1, "webpage": "pginvestor.com", "year_founded": 1837, "street_address": "One Procter & Gamble Plaza", "city": "Cincinnati", "state": "OH", "zipcode": "45202", "country": "United States", "phone_number": "513-983-1100", "short_description": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa.", "long_description": "The Procter & Gamble Company provides branded consumer packaged goods to consumers in North and Latin America, Europe, the Asia Pacific, Greater China, India, the Middle East, and Africa. It operates in five segments: Beauty; Grooming; Health Care; Fabric & Home Care; and Baby, Feminine & Family Care. The Beauty segment offers conditioners, shampoos, styling aids, and treatments; and antiperspirants and deodorants, and personal cleansing and skin care products under the Head & Shoulders, Herbal Essences, Pantene, Rejoice, Olay, Old Spice, Safeguard, SK-II, and Secret brands. The Grooming segment provides female and male blades and razors, pre- and post-shave products, and other shave care products; and appliances that include electric shavers and epilators under the Braun, Gillette, and Venus brands. The Health Care segment offers toothbrushes, toothpaste, and other oral care products; and gastrointestinal, rapid diagnostics, respiratory, vitamins/minerals/supplements, pain relief, and other personal health care products under the Crest, Oral-B, Metamucil, Neurobion, Pepto Bismol, and Vicks brands. The Fabric & Home Care segment provides fabric enhancers, laundry additives, and laundry detergents; and air care, dish care, P&G professional, and surface care products under the Ariel, Downy, Gain, Tide, Cascade, Dawn, Fairy, Febreze, Mr. Clean, and Swiffer brands. The Baby, Feminine & Family Care segment baby wipes, taped diapers, and pants; adult incontinence and feminine care products; and paper towels, tissues, and toilet papers under the Luvs, Pampers Always, Always Discreet, Tampax Bounty, Charmin, and Puffs brands. The company sells its products through mass merchandisers, e-commerce, grocery stores, membership club stores, drug stores, department stores, distributors, wholesalers, baby stores, specialty beauty stores, high-frequency stores, and pharmacies. The Procter & Gamble Company was founded in 1837 and is headquartered in Cincinnati, Ohio.", "industry_name": "Household Products", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 286976491698, "total_enterprise": 309785491698, "number_of_employees": 97000, "outstanding_shares": 2475642613, "eps": 1.894319, "diluted_eps": 1.855536, "earnings_from_cont_operations": 5080000000, "gross_profit": 35952000000, "cash": 15393000000, "total_debt": 36901000000, "total_revenue": 70346000000, "cash_from_operations": 16748000000, "net_income": 4986000000, "ebitda": 19059000000, "year_low_stock_price": 94.34, "year_high_stock_price": 128.09, "seekingalpha_follower_count": 219484, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PG.png"}