{"symbol": "PKX", "name": "POSCO", "next_earnings_utc": 1591869600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 4845467677.567309, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 6, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "posco.com", "year_founded": 1968, "street_address": "6261, Donghaean-Ro", "city": "Pohang", "state": null, "zipcode": null, "country": "South Korea", "phone_number": null, "short_description": "POSCO manufactures and sells steel rolled products and plates in South Korea and internationally.", "long_description": "POSCO manufactures and sells steel rolled products and plates in South Korea and internationally. It operates through four segments: Steel, Construction, Trading, and Others. The company offers hot and cold rolled steel, stainless steel, plates, wire rods, and silicon steel sheets. It also plans, designs, and constructs industrial plants, civil engineering projects, and commercial and residential buildings; exports and imports steel products and raw materials; and generates electricity; produces gas and refuse derived fuel, as well as provides network and system integration, and logistics services. In addition, the company is involved in the engineering and construction; computer hardware and software distribution; economic research and consulting; business facility maintenance; architecture and consulting; investment in venture, energy, and bio tech industries; electronic commerce; intellectual property services and consulting; refractories and quicklime manufacturing and sales; transporting and warehousing; real estate development, rental, sale, and management; house and train manufacturing and management; and education and real estate business. Further, it engages in the resource development; mine development; business facility maintenance; fuel cell; iron ore and coal sales; and cargo handling business, as well as operates housing business agency. Additionally, the company manufactures and sells coated steel and steel byproduct, anode material, and textile products. It also engages in loading and unloading; IT service and DVR; electric control engineering; forest resources development; wastewater treatment operation and maintenance; refractory materials sales and furnace maintenance; rice processing; grain sales; packing materials manufacturing; and social enterprise businesses. POSCO was founded in 1968 and is headquartered in Pohang, South Korea.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 11766129534, "total_enterprise": 21599825284, "number_of_employees": 34936, "outstanding_shares": 80115641, "eps": 15.1868644062094, "diluted_eps": 15.1868644062094, "earnings_from_cont_operations": 1344990089, "gross_profit": 4700672336, "cash": 12598619033, "total_debt": 19935266625, "total_revenue": 51620186459, "cash_from_operations": 5202760460, "net_income": 1222194795, "ebitda": 5559878082, "year_low_stock_price": 26.27, "year_high_stock_price": 54.53, "seekingalpha_follower_count": 4410, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PKX.png"}