{"symbol": "PNFP", "name": "Pinnacle Financial Partners", "next_earnings_utc": 1595282400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 274729820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.86237, "eps_up_revisions": 0, "eps_down_revisions": 10, "revenue_up_revisions": 4, "revenue_down_revisions": 5, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 2, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "pnfp.com", "year_founded": 2000, "street_address": "150 Third Avenue South", "city": "Nashville", "state": "TN", "zipcode": "37201", "country": "United States", "phone_number": "615-744-3700", "short_description": "Pinnacle Financial Partners, Inc., together with its subsidiaries, operates as the bank holding company for Pinnacle Bank that provides various banking products and services in the United States.", "long_description": "Pinnacle Financial Partners, Inc., together with its subsidiaries, operates as the bank holding company for Pinnacle Bank that provides various banking products and services in the United States. The company accepts various deposits, including savings, checking, noninterest-bearing checking, interest-bearing checking, money market, and certificate of deposit accounts. Its loan products include commercial loans, such as equipment and working capital loans; commercial real estate loans comprising investment properties and business loans secured by real estate; and loans to individuals consisting of secured and unsecured installment and term loans, lines of credit, residential first mortgage loans, and home equity loans and lines of credit. The company also offers various securities and other financial products; investment products; brokerage and investment advisory programs; and fiduciary and investment management services, such as personal trust, endowments, foundations, individual retirement accounts, pensions, and custody. In addition, it provides insurance products primarily in the property and casualty area; merger and acquisition advisory services; and private debt, equity and mezzanine, interest rate derivatives, and other middle-market advisory services. Further, the company offers treasury management, telephone and online banking, mobile banking, debit and credit cards, direct and remote deposit, automated teller machine, and cash management services. It serves individuals, small-to medium-sized businesses, and professional entities. As of December 31, 2019, the company operated 111 offices, including 47 in Tennessee, 36 in North Carolina, 20 in South Carolina, and eight in Virginia. Pinnacle Financial Partners, Inc. was founded in 2000 and is headquartered in Nashville, Tennessee.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 3005475722, "total_enterprise": null, "number_of_employees": 2487, "outstanding_shares": 75419717, "eps": 4.404911, "diluted_eps": 4.376929, "earnings_from_cont_operations": 335277000, "gross_profit": 935600000, "cash": 1031860000, "total_debt": 3373602000, "total_revenue": 935600000, "cash_from_operations": 335607000, "net_income": 335277000, "ebitda": null, "year_low_stock_price": 27.8, "year_high_stock_price": 65.0, "seekingalpha_follower_count": 1670, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PNFP.png"}