{"symbol": "PNGAY", "name": "Ping An Insurance (Group) Company of China", "next_earnings_utc": 1592316000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "pingan.com", "year_founded": 1988, "street_address": "Ping An Finance Center", "city": "Shenzhen", "state": null, "zipcode": null, "country": "China", "phone_number": "86 40 0886 6338", "short_description": "Ping An Insurance (Group) Company of China, Ltd. provides financial products and services for insurance, banking, asset management, and fintech and healthtech businesses in China.", "long_description": "Ping An Insurance (Group) Company of China, Ltd. provides financial products and services for insurance, banking, asset management, and fintech and healthtech businesses in China. The company's Life and Health Insurance segment offers term, whole-life, endowment, annuity, investment-linked, universal life, and health care and medical insurance to individual and corporate customers. Its Property and Casualty Insurance segment provides auto, non-auto, and accident and health insurance to individual and corporate customers. The company's Banking segment undertakes loan and intermediary businesses with corporate and retail customers; and provides wealth management and credit card services to individual customers. Its Trust segment offers trust services; and undertakes investing activities. The company's Securities segment provides brokerage, trading, investment banking, and asset management services. Its Other Asset Management segment provides investment management, finance lease, and other asset management services. The company's Technology segment offers various financial and daily-life services through Internet platforms, such as financial transaction information service platform, and health care service platform. It also provides annuity insurance, investment management, IT and business process outsourcing, real estate investment, futures brokerage, consulting, project investment, financial advisory, currency brokerage, property agency, fund raising and distribution, real estate development, and insurance sale agency services. In addition, the company provides factoring, equity investment, financing guarantee, logistics, management consulting, e-commerce, credit information, and private equity financing services. Further, it operates expressway, as well as produces and sells consumer chemicals. The company was founded in 1988 and is based in Shenzhen, China.", "industry_name": "Insurance", "sector_name": "Financials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 190342920217, "total_enterprise": 420151442633, "number_of_employees": 372194, "outstanding_shares": 9140120705, "eps": 1.03435538298623, "diluted_eps": 1.02914804094599, "earnings_from_cont_operations": 20525944229, "gross_profit": 60396611366, "cash": 321171337804, "total_debt": 246699188140, "total_revenue": 167729191670, "cash_from_operations": 30719661137, "net_income": 18348464525, "ebitda": 32578538652, "year_low_stock_price": 18.11, "year_high_stock_price": 25.91, "seekingalpha_follower_count": 2326, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PNGAY.png"}