{"symbol": "PRGS", "name": "Progress Software", "next_earnings_utc": 1593116100, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 98331670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.63, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "progress.com", "year_founded": 1981, "street_address": "14 Oak Park Drive", "city": "Bedford", "state": "MA", "zipcode": "01730", "country": "United States", "phone_number": "781 280 4000", "short_description": "Progress Software Corporation develops business applications.", "long_description": "Progress Software Corporation develops business applications. The company operates through three segments: OpenEdge, Data Connectivity and Integration, and Application Development and Deployment. The OpenEdge segment offers Progress OpenEdge, a development software, which builds multi-language applications for secure deployment across various platforms and devices, as well as cloud; Progress Corticon, a business rules management system that enables applications with decision automation and change process, and decision-related insight capabilities; Progress Kinvey, a platform for building enterprise applications; MOVEit that provides secure collaboration and automated file transfers of critical business information; WhatsUp Gold, a network monitoring solution; and DataRPM, a cognitive predictive maintenance solution for industrial IoT. The Data Connectivity and Integration segment provides Progress DataDirect Connect software, which offers data connectivity using industry-standard interfaces to connect applications running on various platforms; and Progress DataDirect Hybrid Data Pipeline, a data access service that provides cloud and on-premises data sources for hybrid cloud applications, such as CRM, data management platforms, and hosted analytics. The Application Development and Deployment segment offers Developer Tools, a set of components for user interface development; and Sitefinity, a Web content management and customer analytics platform. The company also provides project management, implementation, custom development, programming, and other services, as well as services to Web-enable applications; and training services. It sells its products to end users, application partners, original equipment manufacturers, and system integrators. The company has operations in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. Progress Software Corporation was founded in 1981 and is headquartered in Bedford, Massachusetts.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1809453339, "total_enterprise": 1957929339, "number_of_employees": 1538, "outstanding_shares": 44788449, "eps": 0.85121, "diluted_eps": 0.830976, "earnings_from_cont_operations": 38114000, "gross_profit": 381441000, "cash": 177055000, "total_debt": 325531000, "total_revenue": 433432000, "cash_from_operations": 137056000, "net_income": 38114000, "ebitda": 142273000, "year_low_stock_price": 28.09, "year_high_stock_price": 52.5, "seekingalpha_follower_count": 2141, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PRGS.png"}