{"symbol": "PTEN", "name": "Patterson-UTI Energy", "next_earnings_utc": 1595498400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 244372840.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.57627, "eps_up_revisions": 0, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 16, "total_analysts": 25, "analysts_sell": 3, "analysts_buy": 1, "analysts_outperform": 2, "analysts_hold": 16, "analysts_underperform": 3, "webpage": "patenergy.com", "year_founded": 1978, "street_address": "10713 West Sam Houston Parkway North", "city": "Houston", "state": "TX", "zipcode": "77064", "country": "United States", "phone_number": "281 765 7100", "short_description": "Patterson-UTI Energy, Inc., through its subsidiaries, provides onshore contract drilling services to oil and natural gas operators in the United States and Canada.", "long_description": "Patterson-UTI Energy, Inc., through its subsidiaries, provides onshore contract drilling services to oil and natural gas operators in the United States and Canada. It operates through three segments: Contract Drilling Services, Pressure Pumping Services, and Directional Drilling Services. The Contract Drilling segment markets its contract drilling services primarily in west Texas and southeastern New Mexico, north central and east Texas, northern Louisiana, Colorado, Wyoming, North Dakota, south Texas, western Oklahoma, Pennsylvania, Ohio, West Virginia, and western Canada. As of December 31, 2019, this segment had a drilling fleet of 216 marketable land-based drilling rigs. The Pressure Pumping segment offers pressure pumping services that consist of well stimulation and cementing for the completion of new wells and remedial work on existing wells, as well as hydraulic fracturing, cementing, and acid pumping services in Texas, the Mid-Continent, and the Appalachian region. The Directional Drilling Services segment provides a suite of directional drilling services, including directional drilling, downhole performance motors, measurement-while-drilling, wireline steering tools, and services that enhance the accuracy of horizontal wellbore placement. It also service equipment to drilling contractors, as well as provides electrical controls and automation to the energy, marine, and mining industries in North America and other markets; and owns and invests in oil and natural gas assets as a non-operating working interest owner located principally in Texas and New Mexico. The company was founded in 1978 and is headquartered in Houston, Texas.", "industry_name": "Energy Equipment and Services", "sector_name": "Energy", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 688089746, "total_enterprise": 1537662746, "number_of_employees": 5800, "outstanding_shares": 186474186, "eps": -4.206578, "diluted_eps": -4.206578, "earnings_from_cont_operations": -831811000, "gross_profit": 613841000, "cash": 152200000, "total_debt": 1001773000, "total_revenue": 2212441000, "cash_from_operations": 585662000, "net_income": -831811000, "ebitda": 463319000, "year_low_stock_price": 1.61, "year_high_stock_price": 12.39, "seekingalpha_follower_count": 6056, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PTEN.png"}