{"symbol": "PTNR", "name": "Partner Communications Company Ltd.", "next_earnings_utc": 1590573600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "partner.co.il", "year_founded": 1997, "street_address": "Afeq Industrial Park", "city": "Rosh HaAyin", "state": null, "zipcode": "48103", "country": "Israel", "phone_number": "972 54 781 4888", "short_description": "Partner Communications Company Ltd. provides various telecommunication services in Israel.", "long_description": "Partner Communications Company Ltd. provides various telecommunication services in Israel. It operates in two segments, Cellular and Fixed-Line. The company offers cellular telephony services, including basic cellular telephony, text messaging, internet browsing and data transfer, content, and roaming services, as well as services provided to other operators that are permitted to use its cellular network. It also provides cellular content and value-added services, such as multimedia messaging, cyber protection, cloud backup, ringtone, music streaming, and various business services; and international roaming services, as well as sells and leases cellular handsets, and related cellular devices and accessories. In addition, the company offers Internet service provider (ISP) services comprising email accounts, Wi-Fi networking, anti-virus and anti-spam filtering, and infrastructure and ISP access services; network and data infrastructure services, information security and integration solutions, business information storage services, and data center and cloud services; international long distance services; fixed-line transmission and data capacity services; and voice over broadband telephony and primary rate interface services. Further, it provides television, high speed broadband fiber optic based network, and value added services; and sell and rents modems, domestic routers, servers, and related equipment, as well as tablets, laptops, landline phones, datacards, modems, and datacards, smart watches, car dashboard cameras, televisions, digital cameras, games consoles, audio accessories and other devices, and integration projects. Additionally, the company offers office communication private branch exchange services to business customers. It offers its services and products through sales and service centers, and direct sales force, as well as through dealers and online. The company was founded in 1997 and is headquartered in Rosh HaAyin, Israel.", "industry_name": "Wireless Telecommunication Services", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 756592285, "total_enterprise": 1204176316, "number_of_employees": 2834, "outstanding_shares": 182311394, "eps": 0.0337894188167839, "diluted_eps": 0.0337894188167839, "earnings_from_cont_operations": 5501984, "gross_profit": 152607651, "cash": 246430950, "total_debt": 694118669, "total_revenue": 936495526, "cash_from_operations": 242376857, "net_income": 5501984, "ebitda": 144209886, "year_low_stock_price": 2.9, "year_high_stock_price": 6.46, "stocktwits_watchlist_count": 184, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PTNR.png"}