{"symbol": "PWOD", "name": "Penns Woods Bancorp", "next_earnings_utc": 1595512800, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "pwod.com", "year_founded": 1983, "street_address": "300 Market Street", "city": "Williamsport", "state": "PA", "zipcode": "17703-0967", "country": "United States", "phone_number": "570-322-1111", "short_description": "Penns Woods Bancorp, Inc. operates as the bank holding company for Jersey Shore State Bank and Luzerne Bank, which provides commercial and retail banking services to individuals, partnerships, non-profit organizations, and corporations.", "long_description": "Penns Woods Bancorp, Inc. operates as the bank holding company for Jersey Shore State Bank and Luzerne Bank, which provides commercial and retail banking services to individuals, partnerships, non-profit organizations, and corporations. The company accepts time, demand, and savings deposits, including super NOW accounts, statement savings accounts, money market accounts, and certificates of deposit, as well as checking accounts and IRAs. It also offers loan products comprising residential, commercial, and construction real estate loans; agricultural loans for the purchase or improvement of real estate; commercial loans for the acquisition and improvement of real estate, purchase of equipment, and working capital purposes; letters of credit; consumer loans, such as residential mortgages, home equity loans and lines, automobile financing, personal loans and lines of credit, and overdraft and check lines; and revolving credit loans with overdraft protection. In addition, the company provides securities brokerage and financial planning services, which include the sale of life insurance products, annuities, and estate planning services; property and casualty, and auto insurance products; safe deposit services; ATM services; and Internet and telephone banking services. Further, it engages in real estate transactions and investment activities. The company operates through a network of twenty-six offices located in Clinton, Lycoming, Centre, Montour, Union, and Luzerne counties, Pennsylvania. Penns Woods Bancorp, Inc. was incorporated in 1983 and is based in Williamsport, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 151112306, "total_enterprise": null, "number_of_employees": 334, "outstanding_shares": 7041580, "eps": 2.102566, "diluted_eps": 2.070578, "earnings_from_cont_operations": 14817000, "gross_profit": 57808000, "cash": 77798000, "total_debt": 192943000, "total_revenue": 57808000, "cash_from_operations": 16360000, "net_income": 14801000, "ebitda": null, "year_low_stock_price": 18.72, "year_high_stock_price": 36.27, "seekingalpha_follower_count": 338, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/PWOD.png"}