{"symbol": "QES", "name": "Quintana Energy Services", "next_earnings_utc": 1591828200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 68000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.3, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "quintanaenergyservices.com", "year_founded": 2017, "street_address": "1415 Louisiana Street", "city": "Houston", "state": "TX", "zipcode": "77002", "country": "United States", "phone_number": "832 518 4094", "short_description": "Quintana Energy Services Inc. provides oilfield services to onshore oil and natural gas exploration and production companies operating in conventional and unconventional plays in the United States.", "long_description": "Quintana Energy Services Inc. provides oilfield services to onshore oil and natural gas exploration and production companies operating in conventional and unconventional plays in the United States. The company operates in four segments: Directional Drilling, Pressure Pumping, Pressure Control, and Wireline. The Directional Drilling segment provides directional, horizontal, under balanced, and measurement-while-drilling services, as well as rental tools and support services. The Pressure Pumping segment provides hydraulic fracturing stimulation services, cementing, and acidizing services for the completion, production, and maintenance of oil and gas wells. As of December 31, 2019, this segment had a pressure pumping fleet of 253,150 hydraulic horsepower. The Pressure Control segment offers coiled tubing, rig-assisted snubbing, fluid pumping, nitrogen, well control, and other pressure control related services to support completion and workover operations. This segment had a fleet of 24 coiled tubing, 36 rig-assisted snubbing, and 24 nitrogen pumping units. The Wireline segment offers pump-down services for setting plugs between hydraulic fracturing stages, as well as the deployment of perforation equipment in connection with plug-and-perf operations. This segment also provides cased-hole production logging, injection profiling, stimulation performance evaluation, and water break-through identification services; and industrial logging services for cavern, storage, and injection wells. It owned 33 wireline units. Quintana Energy Services Inc. was founded in 2017 and is headquartered in Houston, Texas.", "industry_name": "Energy Equipment and Services", "sector_name": "Energy", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 24036975, "total_enterprise": 54437975, "number_of_employees": 1100, "outstanding_shares": 33759797, "eps": -2.599723, "diluted_eps": -2.600902, "earnings_from_cont_operations": -87300000, "gross_profit": 63756000, "cash": 23180000, "total_debt": 53581000, "total_revenue": 435419000, "cash_from_operations": 31296000, "net_income": -87300000, "ebitda": 13299000, "year_low_stock_price": 0.59, "year_high_stock_price": 4.04, "seekingalpha_follower_count": 456, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/QES.png"}