{"symbol": "RBCAA", "name": "Republic Bancorp", "next_earnings_utc": 1595505900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 54386000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.79, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "republicbank.com", "year_founded": null, "street_address": "601 West Market Street", "city": "Louisville", "state": "KY", "zipcode": "40202", "country": "United States", "phone_number": "502-584-3600", "short_description": "Republic Bancorp, Inc., a financial holding company, provides banking products and services in the United States.", "long_description": "Republic Bancorp, Inc., a financial holding company, provides banking products and services in the United States. It operates through five segments: Traditional Banking, Warehouse Lending, Mortgage Banking, Tax Refund Solutions, and Republic Credit Solutions. The company accepts demand, savings, time, and brokered and other certificates of deposits; and money market and individual retirement accounts. Its loan products include single family, first lien residential real estate, and adjustable rate mortgage loans; commercial real estate, construction and land development, and commercial and industrial loans; home improvement and home equity, and secured and unsecured personal loans; and aircraft loans. The company also offers credit cards; title insurance and other financial products and services; and memory banking, private banking, lockbox processing, remote deposit capture, business online banking, account reconciliation, automated clearing house processing, and Internet and mobile banking services. In addition, it provides short-term and revolving credit facilities to mortgage bankers; tax refund solutions, which facilitate the receipt and payment of federal and state tax refund products through third-party tax preparers and tax-preparation software providers; and general purpose reloadable prepaid cards through third party service providers. Further, the company offers consumer credit products; and property and casualty insurance products. As of December 31, 2019, it operated 41 full-service banking centers and two loan production offices. Republic Bancorp, Inc. is headquartered in Louisville, Kentucky.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 669731895, "total_enterprise": null, "number_of_employees": 1080, "outstanding_shares": 20896471, "eps": 4.224635, "diluted_eps": 4.205943, "earnings_from_cont_operations": 88880000, "gross_profit": 275353000, "cash": 334844000, "total_debt": 778419000, "total_revenue": 275353000, "cash_from_operations": 81136000, "net_income": 88880000, "ebitda": null, "year_low_stock_price": 27.05, "year_high_stock_price": 52.68, "seekingalpha_follower_count": 632, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RBCAA.png"}