{"symbol": "REVG", "name": "REV Group", "next_earnings_utc": 1591610400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 489050670.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.256, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 7, "analysts_sell": 2, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 1, "webpage": "revgroup.com", "year_founded": null, "street_address": "111 East Kilbourn Avenue", "city": "Milwaukee", "state": "WI", "zipcode": "53202", "country": "United States", "phone_number": "414-290-0190", "short_description": "REV Group, Inc. designs, manufactures, and distributes specialty vehicles in the United States, Canada, Europe, Africa, the Middle East, Latin America, the Caribbean, and internationally.", "long_description": "REV Group, Inc. designs, manufactures, and distributes specialty vehicles in the United States, Canada, Europe, Africa, the Middle East, Latin America, the Caribbean, and internationally. It operates through three segments: Fire & Emergency, Commercial, and Recreation. The Fire & Emergency segment offers a range of fire apparatus and ambulance products for municipalities and private contractors. This segment sells its products primarily under the Emergency One, Kovatch Mobile Equipment, and Ferrara brands; and ambulances under the American Emergency Vehicles, Horton Emergency Vehicles, Leader Emergency Vehicles, Marque, McCoy Miller, Road Rescue, Wheeled Coach, and Frontline brands. The Commercial segment provides transit and shuttle buses, school buses, terminal trucks, cut-away and luxury buses, mobility vans, industrial sweepers, and other specialty vehicles. The segment sells its products directly, as well as through dealers primarily under the Collins Bus, Goshen Coach, ENC, ElDorado National, Krystal Coach, Federal Coach, Champion, and World Trans brands to governmental bodies, including municipalities, such as fire departments, school districts, hospitals, and the U.S. federal government, as well as transit and shuttle bus markets. The Recreation segment offers motorized and towable recreational vehicles, and luxury coaches. This segment sells its vehicles under the American Coach, Fleetwood RV, Monaco Coach, Holiday Rambler, Renegade, Midwest, and Lance brands through dealers. The company also provides aftermarket parts and services. The company was formerly known as Allied Specialty Vehicles, Inc. and changed its name to REV Group, Inc. in November 2015. The company is headquartered in Milwaukee, Wisconsin.", "industry_name": "Machinery", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 426361514, "total_enterprise": 842661514, "number_of_employees": 8040, "outstanding_shares": 63258385, "eps": -0.113184, "diluted_eps": -0.119242, "earnings_from_cont_operations": -7900000, "gross_profit": 252900000, "cash": 67300000, "total_debt": 483600000, "total_revenue": 2417100000, "cash_from_operations": 78600000, "net_income": -7100000, "ebitda": 77900000, "year_low_stock_price": 3.5, "year_high_stock_price": 14.99, "seekingalpha_follower_count": 1285, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/REVG.png"}