{"symbol": "RF", "name": "Regions Financial", "next_earnings_utc": 1594980000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1456555560.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.12867, "eps_up_revisions": 0, "eps_down_revisions": 15, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 28, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 5, "analysts_hold": 15, "analysts_underperform": 1, "webpage": "regions.com", "year_founded": 1970, "street_address": "1900 Fifth Avenue North", "city": "Birmingham", "state": "AL", "zipcode": "35203", "country": "United States", "phone_number": "800-734-4667", "short_description": "Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers.", "long_description": "Regions Financial Corporation, a financial holding company, provides banking and bank-related services to individual and corporate customers. It operates through three segments: Corporate Bank, Consumer Bank, and Wealth Management. The Corporate Bank segment offers commercial banking services, such as commercial and industrial, commercial real estate, and investor real estate lending; equipment lease financing; deposit products; and securities underwriting and placement, loan syndication and placement, foreign exchange, derivatives, merger and acquisition, and other advisory services. It serves corporate, middle market, and commercial real estate developers and investors. The Consumer Bank segment provides consumer banking products and services related to residential first mortgages, home equity lines and loans, branch small business and indirect loans, consumer credit cards, and other consumer loans, as well as deposits. The Wealth Management segment offers credit related products, and retirement and savings solutions; and trust and investment management, asset management, and estate planning services to individuals, businesses, governmental institutions, and non-profit entities. The company also provides investment and insurance products; low income housing tax credit corporate fund syndication services; and other specialty financing services. As of March 18, 2020, it operated 1,400 banking offices and 2,000 automated teller machines across the South, Midwest and Texas. Regions Financial Corporation was founded in 1970 and is headquartered in Birmingham, Alabama.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 10853976400, "total_enterprise": null, "number_of_employees": 19564, "outstanding_shares": 959679611, "eps": 1.290454, "diluted_eps": 1.275316, "earnings_from_cont_operations": 1350000000, "gross_profit": 5195000000, "cash": 4018000000, "total_debt": 13798000000, "total_revenue": 5195000000, "cash_from_operations": 2790000000, "net_income": 1350000000, "ebitda": null, "year_low_stock_price": 6.94, "year_high_stock_price": 17.54, "seekingalpha_follower_count": 20422, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RF.png"}