{"symbol": "RFIL", "name": "RF Industries", "next_earnings_utc": 1591819200, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 12922000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.0, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "rfindustries.com", "year_founded": 1979, "street_address": "Building 6000", "city": "San Diego", "state": "CA", "zipcode": "92126", "country": "United States", "phone_number": "858-549-6340", "short_description": "RF Industries, Ltd., together with its subsidiaries, designs, manufactures, and markets interconnect products and systems in the United States, Canada, Mexico, and internationally.", "long_description": "RF Industries, Ltd., together with its subsidiaries, designs, manufactures, and markets interconnect products and systems in the United States, Canada, Mexico, and internationally. The company operates through two segments, RF Connector and Cable Assembly and Custom Cabling Manufacturing and Assembly. The company's RF Connector and Cable Assembly segment designs, manufactures, and distributes coaxial connectors and cable assemblies that are integrated with coaxial connectors. The Custom Cabling Manufacturing and Assembly segment designs, manufactures, markets and distributes custom copper and fiber cable assemblies, complex hybrid fiber optic and power solution cables, electromechanical wiring harnesses, wiring harnesses, ambient thermal systems, and shrouds for small cell installations. It also manufactures and sells custom and standard cable assemblies, hybrid fiber optic power solution cables, adapters, and electromechanical wiring harnesses for communication, computer, LAN, automotive, and medical equipment. In addition, the company designs and manufactures cable assemblies and wiring harnesses for blue chip industrial, oilfield, instrumentation, and military customers. It also designs and manufactures quality connectivity solutions to telecommunications and data communications distributors. The company sells its products through warehousing distributors and in-house marketing and sales team. It serves telecommunications carriers and equipment manufacturers, wireless and network infrastructure carriers, and OEMs. The company was formerly known as Celltronics, Inc. and changed its name to RF Industries, Ltd. in November 1990. RF Industries, Ltd. was founded in 1979 and is headquartered in San Diego, California.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 54180663, "total_enterprise": 41914663, "number_of_employees": 293, "outstanding_shares": 9758062, "eps": 0.308513, "diluted_eps": 0.292494, "earnings_from_cont_operations": 2907000, "gross_profit": 15745000, "cash": 14390000, "total_debt": 2124000, "total_revenue": 57092000, "cash_from_operations": 5297000, "net_income": 2907000, "ebitda": 4483000, "year_low_stock_price": 3.31, "year_high_stock_price": 8.89, "seekingalpha_follower_count": 1898, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RFIL.png"}