{"symbol": "RL", "name": "Ralph Lauren Corporation", "next_earnings_utc": 1590580800, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1289568420.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.06815, "eps_up_revisions": 0, "eps_down_revisions": 15, "revenue_up_revisions": 0, "revenue_down_revisions": 14, "total_analysts": 21, "analysts_sell": 1, "analysts_buy": 5, "analysts_outperform": 4, "analysts_hold": 10, "analysts_underperform": 1, "webpage": "ralphlauren.com", "year_founded": 1967, "street_address": "650 Madison Avenue", "city": "New York", "state": "NY", "zipcode": "10022", "country": "United States", "phone_number": "212-318-7000", "short_description": "Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally.", "long_description": "Ralph Lauren Corporation designs, markets, and distributes lifestyle products in North America, Europe, Asia, and internationally. The company offers apparel, including a range of men’s, women’s, and children’s clothing accessories, which comprise footwear, eyewear, watches, fashion and fine jewelry, scarves, hats, gloves, umbrellas, and belts, as well as leather goods, such as handbags, luggage, small leather goods, and belts; home products consisting of bedding and bath products, furniture, fabrics and wallpapers, lightings, tabletops, floorcoverings, and giftware; and fragrances. It sells apparel and accessories under the Ralph Lauren Collection, Ralph Lauren Purple Label, Polo Ralph Lauren, Double RL, Lauren Ralph Lauren, Polo Golf Ralph Lauren, Ralph Lauren Golf, RLX Ralph Lauren, Polo Ralph Lauren Children, Chaps, Club Monaco, and other brand names; women's fragrances under the Ralph Lauren Collection, Woman by Ralph Lauren, Romance Collection, Ralph Collection, and Big Pony Women's brand names; and men's fragrances under the Polo Blue, Safari, Purple Label, Polo Red, Polo Green, Polo Black, Polo Supreme, Polo Sport, and Big Pony Men's brand names. The company’s restaurant concepts include The Polo Bar in New York City; RL Restaurant in Chicago; Ralph's in Paris; and Ralph's Coffee concept. It sells its products to department stores, specialty stores, and golf and pro shops, as well as directly to consumers through its retail stores, concession-based shop-within-shops, and its digital commerce sites. The company directly operates 501 retail stores and 653 concession-based shop-within-shops; and operates 108 Ralph Lauren stores, 39 Ralph Lauren concession shops, and 138 Club Monaco stores and shops through licensing partners. Ralph Lauren Corporation was founded in 1967 and is based in New York, New York.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 5499022295, "total_enterprise": 6413022295, "number_of_employees": 18650, "outstanding_shares": 73743091, "eps": 8.618276, "diluted_eps": 8.478711, "earnings_from_cont_operations": 664900000, "gross_profit": 3965500000, "cash": 1908400000, "total_debt": 2822400000, "total_revenue": 6391400000, "cash_from_operations": 848700000, "net_income": 664900000, "ebitda": 996500000, "year_low_stock_price": 59.82, "year_high_stock_price": 128.29, "stocktwits_watchlist_count": 2168, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RL.png"}