{"symbol": "RLI", "name": "RLI", "next_earnings_utc": 1595362200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 233139000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.536, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "rlicorp.com", "year_founded": 1965, "street_address": "9025 North Lindbergh Drive", "city": "Peoria", "state": "IL", "zipcode": "61615", "country": "United States", "phone_number": "309-692-1000", "short_description": "RLI Corp., an insurance holding company, underwrites property and casualty insurance in the United States and internationally.", "long_description": "RLI Corp., an insurance holding company, underwrites property and casualty insurance in the United States and internationally. Its Casualty segment provides commercial and personal coverage products; and general liability products, such as coverage for third-party liability of commercial insureds, including manufacturers, contractors, apartments, and mercantile. This segment also offers coverages for security guards and in the areas of onshore energy-related businesses and environmental liability for underground storage tanks, contractors and asbestos, and environmental remediation specialists; and professional liability coverages focuses on providing errors and omission coverage to small to medium-sized design, technical, computer, and miscellaneous professionals. In addition, this segment provides commercial automobile liability and physical damage insurance to local, intermediate and long haul truckers, public transportation entities, and equipment dealers; incidental and related insurance coverages; inland marine coverages; management liability coverages, such as directors and officers liability insurance, fiduciary liability and fidelity coverages, and for various classes of risks, including public and private businesses; and healthcare liability and home business insurance products. The company's Property segment offers commercial property, cargo, hull, protection and indemnity, marine liability, inland marine, homeowners' and dwelling fire, and other property insurance products. Its Surety segment offers small bonds for businesses and individuals; bonds for small to medium-sized contractors; commercial surety bonds for medium-to-large businesses; and commercial surety bonds for the energy, petrochemical, and refining industries. The company also underwrites various reinsurance coverages. It markets its products through branch offices, brokers, and underwriting and independent agents. RLI Corp. was founded in 1965 and is headquartered in Peoria, Illinois.", "industry_name": "Insurance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3547092917, "total_enterprise": 3676881917, "number_of_employees": 894, "outstanding_shares": 44922656, "eps": 1.447735, "diluted_eps": 1.431802, "earnings_from_cont_operations": 64902000, "gross_profit": 151797000, "cash": 42701000, "total_debt": 172490000, "total_revenue": 857888000, "cash_from_operations": 240363000, "net_income": 64902000, "ebitda": 67257000, "year_low_stock_price": 66.02, "year_high_stock_price": 99.93, "seekingalpha_follower_count": 2548, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RLI.png"}