{"symbol": "RRTS", "name": "Roadrunner Transportation Systems", "next_earnings_utc": 1593079200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 420600000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.16, "eps_up_revisions": 0, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "rrts.com", "year_founded": 2005, "street_address": "1431 Opus Place", "city": "Downers Grove", "state": "IL", "zipcode": "60515", "country": "United States", "phone_number": "414 615 1500", "short_description": "Roadrunner Transportation Systems, Inc. provides asset-right transportation and asset-light logistics services.", "long_description": "Roadrunner Transportation Systems, Inc. provides asset-right transportation and asset-light logistics services. It operates through four segments: Ascent Transportation Management (Ascent TM), Ascent On-Demand (Ascent OD), Less-than-Truckload (LTL), and Truckload (TL). The company offers domestic freight management solutions, including asset-backed truckload brokerage, specialized/heavy haul, LTL shipment execution, LTL carrier rate negotiations, access to its transportation management system, and freight audit/payment. It also provides air and ground expedite services for the transportation of automotive and industrial parts, paper products, and steel, as well as frozen and refrigerated foods, including dairy, poultry and meat, and consumers products, such as foods and beverages. In addition, the company arranges the pickup and delivery of TL freight through its 30 TL service centers in the United States; offers dry van truckload, temperature-controlled truckload, and logistics and warehouse services; and provides pickup, consolidation, linehaul, deconsolidation, and delivery of LTL shipments in the United States and Canada through 27 LTL service centers and approximately 140 third-party delivery agents. Further, the company provides international air and ocean freight forwarding, customs brokerage, regulatory compliance, project and order management, and retail consolidation services. It operates through a network of independent brokerage agents, direct sales force, company brokers, and commissioned sales representatives. The company offers its services under the Roadrunner and Ascent Global Logistics brands. Roadrunner Transportation Systems, Inc. was incorporated in 2005 and is headquartered in Downers Grove, Illinois.", "industry_name": "Road and Rail", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 80332318, "total_enterprise": 490922318, "number_of_employees": 3600, "outstanding_shares": 37892603, "eps": -10.621752, "diluted_eps": -10.621752, "earnings_from_cont_operations": -340937000, "gross_profit": 287756000, "cash": 4777000, "total_debt": 415367000, "total_revenue": 1847862000, "cash_from_operations": -97075000, "net_income": -340937000, "ebitda": -67986000, "year_low_stock_price": 1.88, "year_high_stock_price": 13.0, "seekingalpha_follower_count": 2267, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/RRTS.png"}