{"symbol": "SAP", "name": "SAP SE", "next_earnings_utc": 1595325600, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7185736921.910539, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.20856, "eps_up_revisions": 0, "eps_down_revisions": 8, "revenue_up_revisions": 0, "revenue_down_revisions": 10, "total_analysts": 14, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 4, "analysts_hold": 5, "analysts_underperform": 1, "webpage": "sap.com", "year_founded": 1972, "street_address": "Dietmar-Hopp-Allee 16", "city": "Walldorf", "state": null, "zipcode": "69190", "country": "Germany", "phone_number": "49 6227 7 47474", "short_description": "SAP SE operates as an enterprise application software, and analytics and business intelligence company worldwide.", "long_description": "SAP SE operates as an enterprise application software, and analytics and business intelligence company worldwide. It operates in Applications, Technology & Services; SAP Business Network; and Customer Experience segments. It offers SAP HANA, which enables businesses to process and analyze live data; SAP Data Hub, a solution for businesses to manage data from various sources; and SAP Cloud platform that offers an enterprise platform-as-a-service. The company also provides SAP Leonardo, a system that combines design thinking services with intelligent technologies for business processes; SAP Analytics Cloud, which leverages the intersection of business intelligence, planning, and predictive analytics; SAP BW/4HANA, a data warehouse solution; SAP S/4HANA, an enterprise resource planning suite for intelligent enterprises; SAP Integrated Business Planning solutions that deliver real-time supply chain planning capabilities; and SAP Business One, an on-premise and cloud business application. In addition, it offers SAP Fiori, an user experience interface; SAP SuccessFactors Human Capital Management solutions that help organizations enhance the value of their workforce; SAP Fieldglass, a cloud-based application for external workforce management and services procurement; SAP Ariba, an online business-to-business marketplace; and SAP Concur, a travel and expense management software. Further, the company provides SAP MaxAttention to turn ideas into value-based predictable outcomes; SAP ActiveAttention program, a premium-level engagement solution to support smaller businesses; SAP Enterprise Support services that provides proactive, predictive, and preventive support for customers across hybrid landscapes; and SAP Preferred Success, which provides a bundle of prescriptive customer success activities for accelerated cloud adoption. The company has a strategic partnership with GEA Group Aktiengesellschaft. SAP SE was founded in 1972 and is headquartered in Walldorf, Germany.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 149959547828, "total_enterprise": 160553134869, "number_of_employees": 100330, "outstanding_shares": 1190824145, "eps": 3.92424840202777, "diluted_eps": 3.92387811329072, "earnings_from_cont_operations": 4726691646, "gross_profit": 21594666079, "cash": 9008155169, "total_debt": 19450077143, "total_revenue": 30838659907, "cash_from_operations": 4053339211, "net_income": 4682609654, "ebitda": 7934758651, "year_low_stock_price": 90.89, "year_high_stock_price": 140.67, "seekingalpha_follower_count": 34823, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SAP.png"}