{"symbol": "SBFG", "name": "SB Financial Group", "next_earnings_utc": 1595535300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 8900000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.42, "eps_up_revisions": 1, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "yourstatebank.com", "year_founded": 1983, "street_address": "401 Clinton Street", "city": "Defiance", "state": "OH", "zipcode": "43512", "country": "United States", "phone_number": "419-783-8950", "short_description": "SB Financial Group, Inc., through its subsidiaries, provides a range of commercial banking and wealth management services to individual and corporate customers primarily in Ohio, Indiana, and Michigan.", "long_description": "SB Financial Group, Inc., through its subsidiaries, provides a range of commercial banking and wealth management services to individual and corporate customers primarily in Ohio, Indiana, and Michigan. The company offers checking accounts, savings accounts, money market accounts, and time certificates of deposit. It also provides commercial, consumer, agricultural, and residential mortgage loans. In addition, the company offers automatic teller machine, personal and corporate trust, commercial leasing, bank credit card, safe deposit box rental, internet banking, private client group, and other personalized banking services; and various trust and financial services comprising asset management services for individuals and corporate employee benefit plans, as well as brokerage services. Further, it sells insurance products to retail and commercial customers. The company operates a network of 19 banking centers located within the Ohio counties of Allen, Defiance, Franklin, Fulton, Hancock, Lucas, Paulding, Wood, and Williams; 1 banking center located in Allen County, Indiana; and 7 loan production offices located in Cuyahoga, Franklin, Lucas, and Seneca counties, Ohio, as well as Hamilton and Steuben counties, Indiana, and Monroe County, Michigan. The company was formerly known as Rurban Financial Corp. and changed its name to SB Financial Group, Inc. in April 2013. SB Financial Group, Inc. was founded in 1983 and is headquartered in Defiance, Ohio.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 119020711, "total_enterprise": null, "number_of_employees": 252, "outstanding_shares": 7698623, "eps": 1.432948, "diluted_eps": 1.324619, "earnings_from_cont_operations": 10428000, "gross_profit": 53409000, "cash": 66274000, "total_debt": 73431000, "total_revenue": 53409000, "cash_from_operations": 10128000, "net_income": 10428000, "ebitda": null, "year_low_stock_price": 9.02, "year_high_stock_price": 20.49, "seekingalpha_follower_count": 255, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SBFG.png"}