{"symbol": "SCHL", "name": "Scholastic", "next_earnings_utc": 1592510400, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 272600000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.93, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "scholastic.com", "year_founded": 1920, "street_address": "557 Broadway", "city": "New York", "state": "NY", "zipcode": "10012", "country": "United States", "phone_number": "212-343-6100", "short_description": "Scholastic Corporation publishes and distributes children’s books worldwide.", "long_description": "Scholastic Corporation publishes and distributes children’s books worldwide. It operates in three segments: Children’s Book Publishing and Distribution, Education, and International. The Children’s Book Publishing and Distribution segment publishes and distributes children’s books, e-books, media, and interactive products through its school book club and school book fair channels, as well as through its trade channel. Its original publications include Harry Potter, The Hunger Games, The 39 Clues, Spirit Animals, The Magic School Bus, I Spy, Captain Underpants, Dog Man, Goosebumps, and Clifford The Big Red Dog; and licensed properties comprise Star Wars, Lego, Pokemon, and Geronimo Stilton. In addition, this segment publishes and creates books plus products for children, including titles, such as Sew Mini Treats, Lego Chain Reactions, and Make Your Own Bath Bombs under the Klutz name. The Education segment publishes and distributes classroom magazines under the Scholastic News, Scope, Storyworks, Let's Find Out, and Junior Scholastic names; non-fiction books under the Children’s Press and Franklin Watts names; and literacy curriculum products under the Scholastic Literacy name, as well as provides children’s books, other print and online references, fiction focused products, classroom materials, and consulting services. The International segment offers original trade and educational publishing programs; distributes children’s books, digital educational resources, and other materials through school-based book clubs, school-based book fairs, and trade channels; produces and distributes magazines; and offers online subscription services. This segment has operations in approximately 165 countries. The company distributes its products and services directly to schools and libraries through retail stores and the Internet. Scholastic Corporation was founded in 1920 and is headquartered in New York, New York.", "industry_name": "Media", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1073358793, "total_enterprise": 913858793, "number_of_employees": 8900, "outstanding_shares": 34270715, "eps": -0.372492, "diluted_eps": -0.375759, "earnings_from_cont_operations": -12800000, "gross_profit": 874100000, "cash": 263800000, "total_debt": 102900000, "total_revenue": 1673800000, "cash_from_operations": 99900000, "net_income": -12900000, "ebitda": 75600000, "year_low_stock_price": 20.01, "year_high_stock_price": 45.8, "seekingalpha_follower_count": 1560, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SCHL.png"}