{"symbol": "SCHN", "name": "Schnitzer Steel Industries", "next_earnings_utc": 1593691200, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.2, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "schnitzersteel.com", "year_founded": 1906, "street_address": "299 SW Clay Street", "city": "Portland", "state": "OR", "zipcode": "97201", "country": "United States", "phone_number": "503-224-9900", "short_description": "Schnitzer Steel Industries, Inc. recycles ferrous and nonferrous scrap metals; and manufactures finished steel products worldwide.", "long_description": "Schnitzer Steel Industries, Inc. recycles ferrous and nonferrous scrap metals; and manufactures finished steel products worldwide. The company operates in two segments, Auto and Metals Recycling (AMR), and Cascade Steel and Scrap (CSS). The AMR segment acquires, processes, and recycles scrap metals, as well as processes mixed and large pieces of scrap metal into smaller pieces by crushing, torching, shearing, shredding, and sorting. This segment offers ferrous recycled scrap metal, a feedstock used in the production of finished steel products; and nonferrous products, including aluminum, copper, stainless steel, nickel, brass, titanium, lead, high temperature alloys, and joint products. It sells ferrous and nonferrous recycled metal products to steel mills, foundries, refineries, smelters, wholesalers, and recycled metal processors. This segment also procures salvaged vehicles and sells serviceable used auto parts from these vehicles through its 51 self-service auto parts stores in the United States and Western Canada, as well as sells auto bodies and component parts, such as engines, transmissions, and alternators to wholesalers. The CSS segment produces various finished steel products using ferrous recycled scrap metal and other raw materials. It provides semi-finished goods, which include billets; and finished goods consisting of rebar, coiled rebar, wire rods, merchant bars, and other specialty products. This segment serves steel service centers, construction industry subcontractors, steel fabricators, wire drawers, and farm and wood products suppliers. Schnitzer Steel Industries, Inc. was founded in 1906 and is headquartered in Portland, Oregon.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 425461631, "total_enterprise": 685196631, "number_of_employees": 3363, "outstanding_shares": 27099467, "eps": 0.876633, "diluted_eps": 0.870991, "earnings_from_cont_operations": 26355000, "gross_profit": 241267000, "cash": 10326000, "total_debt": 265764000, "total_revenue": 1940262000, "cash_from_operations": 138066000, "net_income": 24153000, "ebitda": 105218000, "year_low_stock_price": 10.09, "year_high_stock_price": 27.47, "seekingalpha_follower_count": 2918, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SCHN.png"}