{"symbol": "SCHW", "name": "The Charles Schwab Corporation", "next_earnings_utc": 1594817100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2421463640.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.50548, "eps_up_revisions": 0, "eps_down_revisions": 12, "revenue_up_revisions": 0, "revenue_down_revisions": 12, "total_analysts": 19, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 4, "analysts_hold": 11, "analysts_underperform": 0, "webpage": "schwab.com", "year_founded": 1971, "street_address": "211 Main Street", "city": "San Francisco", "state": "CA", "zipcode": "94105", "country": "United States", "phone_number": "415-667-7000", "short_description": "The Charles Schwab Corporation, through its subsidiaries, provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services.", "long_description": "The Charles Schwab Corporation, through its subsidiaries, provides wealth management, securities brokerage, banking, asset management, custody, and financial advisory services. The company operates through two segments, Investor Services and Advisor Services. The Investor Services segment provides retail brokerage and banking services, retirement plan services, and other corporate brokerage services; equity compensation plan sponsors full-service recordkeeping for stock plans, stock options, restricted stock, performance shares, and stock appreciation rights; and retail investor, retirement plan, and mutual fund clearing services. The Advisor Services segment provides custodial, trading, and support services; and retirement business and corporate brokerage retirement services. This segment provides brokerage accounts with cash management capabilities; third-party mutual funds, as well as proprietary mutual funds, plus mutual fund trading, and clearing services to broker-dealers; and exchange-traded funds (ETFs), including proprietary and third-party ETFs. It also offers advice solutions, such as managed portfolios of proprietary and third-party mutual funds and ETFs, separately managed accounts, customized personal advice for tailored portfolios, and specialized planning and portfolio management. In addition, this segment provides banking products and services, including checking and savings accounts, certificates of deposit, first lien residential real estate mortgage loans, home equity loans and lines of credit, and pledged asset lines; and trust services comprising trust custody services, personal trust reporting services, and administrative trustee services. The company serves individuals and institutional clients in the United States, the Commonwealth of Puerto Rico, England, Hong Kong, Singapore, and Australia. The Charles Schwab Corporation was founded in 1971 and is headquartered in San Francisco, California.", "industry_name": "Capital Markets", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 46230998064, "total_enterprise": null, "number_of_employees": 19700, "outstanding_shares": 1287412923, "eps": 2.58407, "diluted_eps": 2.560275, "earnings_from_cont_operations": 3535000000, "gross_profit": 10349000000, "cash": 102768000000, "total_debt": 9857000000, "total_revenue": 10615000000, "cash_from_operations": 22038000000, "net_income": 3535000000, "ebitda": null, "year_low_stock_price": 28.0, "year_high_stock_price": 51.65, "seekingalpha_follower_count": 23007, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SCHW.png"}