{"symbol": "SEAC", "name": "SeaChange International", "next_earnings_utc": 1594067400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7394500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.155, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "seachange.com", "year_founded": 1993, "street_address": "50 Nagog Park", "city": "Acton", "state": "MA", "zipcode": "01720", "country": "United States", "phone_number": "978-897-0100", "short_description": "SeaChange International, Inc. provides multiscreen, advertising, and premium over the top (OTT) video products and services that facilitate the aggregation, licensing, management, and distribution of video and television advertising content worldwide.", "long_description": "SeaChange International, Inc. provides multiscreen, advertising, and premium over the top (OTT) video products and services that facilitate the aggregation, licensing, management, and distribution of video and television advertising content worldwide. It offers video products, including SeaChange Adrenalin, a multiscreen video back office platform that enables service providers to manage, monetize, and deliver a seamless viewing experience across televisions, personal computers (PCs), tablets, smartphones, and other IP-enabled devices; and SeaChange AssetFlow, a content management solution, which is used to receive, manage, and publish content for viewing on televisions, tablets, PCs, and other consumer devices. The company also provides advertising products, such as SeaChange Infusion, an advertising platform to maximize advertising revenue across multiscreen, broadcast, on-demand, and OTT viewing. In addition, it offers SeaChange NitroX, an user experience product that empower service providers and content owners to optimize live and on-demand video consumption on multiscreen and OTT services. Further, the company provides professional, and maintenance and support services, as well as managed services. It sells and markets its products and services through a direct sales organization, and sales representatives and partners, as well as to systems integrators and value-added resellers. The company serves cable system, telecommunications companies, and satellite operators, as well as media companies. SeaChange International, Inc. was founded in 1993 and is headquartered in Acton, Massachusetts.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 69789340, "total_enterprise": 62011340, "number_of_employees": 181, "outstanding_shares": 37521151, "eps": -0.243085, "diluted_eps": -0.243085, "earnings_from_cont_operations": -8921000, "gross_profit": 43502000, "cash": 12848000, "total_debt": 5070000, "total_revenue": 67154000, "cash_from_operations": -14794000, "net_income": -8921000, "ebitda": 2078000, "year_low_stock_price": 1.15, "year_high_stock_price": 4.98, "seekingalpha_follower_count": 2199, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SEAC.png"}