{"symbol": "SFBS", "name": "ServisFirst Bancshares", "next_earnings_utc": 1595275200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 100101000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.734, "eps_up_revisions": 3, "eps_down_revisions": 2, "revenue_up_revisions": 4, "revenue_down_revisions": 1, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "servisfirstbank.com", "year_founded": 2005, "street_address": "2500 Woodcrest Place", "city": "Birmingham", "state": "AL", "zipcode": "35209", "country": "United States", "phone_number": "205-949-0302", "short_description": "ServisFirst Bancshares, Inc. operates as the bank holding company for ServisFirst Bank that provides banking services to individual and corporate customers in the United States.", "long_description": "ServisFirst Bancshares, Inc. operates as the bank holding company for ServisFirst Bank that provides banking services to individual and corporate customers in the United States. It offers demand, time, savings, and other deposits; checking, money market, and IRA accounts; and certificates of deposit. The company also provides commercial lending products, such as seasonal loans, bridge loans, and term loans for working capital, expansion of the business, acquisition of property, and plant and equipment, as well as commercial lines of credit; commercial real estate loans, construction and development loans, and residential real estate loans; and consumer loans, such as home equity loans, vehicle financing, loans secured by deposits, and secured and unsecured personal loans. In addition, it offers other banking products and services comprising telephone and mobile banking, direct deposit, Internet banking, traveler's checks, safe deposit boxes, attorney trust accounts, automatic account transfers, automated teller machines, and debit card systems, as well as Visa credit cards; treasury and cash management services; wire transfer, night depository, banking-by-mail, and remote capture services; and correspondent banking services to other financial institutions. Further, the company, through its subsidiary, SF Intermediate Holding Company, Inc., operates as a real estate investment trust for the United States income tax purposes; and holds and manages participations in residential mortgages and commercial real estate loans originated by ServisFirst Bank in Alabama, Florida, Georgia, and Tennessee. It operates 20 full-service banking offices located in Jefferson, Shelby, Madison, Montgomery, Mobile, Baldwin, and Houston Counties in Alabama; Escambia and Hillsborough Counties in Florida; Cobb and Douglas Counties in Georgia; Charleston County in South Carolina; and Davidson County in Tennessee. The company was founded in 2005 and is headquartered in Birmingham, Alabama.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1878079033, "total_enterprise": null, "number_of_employees": 500, "outstanding_shares": 53844009, "eps": 2.77937, "diluted_eps": 2.749925, "earnings_from_cont_operations": 149011000, "gross_profit": 290136000, "cash": 617131000, "total_debt": 620923000, "total_revenue": 290136000, "cash_from_operations": 174833000, "net_income": 149011000, "ebitda": null, "year_low_stock_price": 21.76, "year_high_stock_price": 40.9, "seekingalpha_follower_count": 754, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SFBS.png"}