{"symbol": "SGH", "name": "SMART Global Holdings", "next_earnings_utc": 1594152300, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 282681050.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.67327, "eps_up_revisions": 2, "eps_down_revisions": 3, "revenue_up_revisions": 1, "revenue_down_revisions": 3, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "smartm.com", "year_founded": 1988, "street_address": "39870 Eureka Drive", "city": "Newark", "state": "CA", "zipcode": "94560", "country": "United States", "phone_number": "510-623-1231", "short_description": "SMART Global Holdings, Inc. designs and manufactures electronic products focused in memory and computing technology areas.", "long_description": "SMART Global Holdings, Inc. designs and manufactures electronic products focused in memory and computing technology areas. It offers dynamic random access memory (DRAM) modules for desktops, notebooks, and servers; and embedded and removable flash memory products; and flash component products, such as embedded multimedia controllers, and embedded and removal products in USB, CompactFlash and SD/microSD card configurations. The company also provides supply chain services, including procurement, logistics, inventory management, temporary warehousing, programming, kitting, and packaging. In addition, it offers specialty compute and storage system solutions to customers various verticals, including financial services, energy, government, social media, and education end markets; and offers hardware and software products, including solutions based on the Open Compute Project. Further it provides servers, software, integrated turn-key clusters, enterprise-grade storage, and bare metal HPC in hardware or cloud-based solutions through Penguin Computing On-Demand; Open Compute Tundra Extreme Scale products; turn-key storage solutions based upon its Frostbyte storage platform; and rackmount servers and GPU accelerated computing platforms. The company sells its products directly to original equipment manufacturers, enterprise, government and other end customers through direct sales force, customer service representatives, on-site field application engineers, independent sales representatives, distributors, integrators, and resellers. The company was formerly known as Saleen Holdings, Inc. and changed its name to SMART Global Holdings, Inc. in August 2014. SMART Global Holdings, Inc. was founded in 1988 and is headquartered in Newark, California.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 664606903, "total_enterprise": 745447903, "number_of_employees": 1712, "outstanding_shares": 23993029, "eps": -0.081967, "diluted_eps": -0.083372, "earnings_from_cont_operations": -1926000, "gross_profit": 201153000, "cash": 141860000, "total_debt": 222701000, "total_revenue": 1058117000, "cash_from_operations": 143852000, "net_income": -1926000, "ebitda": 67285000, "year_low_stock_price": 16.42, "year_high_stock_price": 39.08, "seekingalpha_follower_count": 3293, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SGH.png"}