{"symbol": "SGRP", "name": "SPAR Group", "next_earnings_utc": 1593202500, "next_earnings_period_start_date_utc": 1593475200, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "sparinc.com", "year_founded": 1967, "street_address": "South Building", "city": "White Plains", "state": "NY", "zipcode": "10604", "country": "United States", "phone_number": "248 364 7727", "short_description": "SPAR Group, Inc., together with its subsidiaries, provides merchandising and marketing services worldwide.", "long_description": "SPAR Group, Inc., together with its subsidiaries, provides merchandising and marketing services worldwide. The company offers syndicated services, such as product reordering and replenishment; authorized for distribution are in stock and on the shelf or sales floor; adding new products that are approved for distribution; implementing store planogram schematics; setting product category shelves; ensuring that product shelf tags are in place; checking for salability of the clients' products; placing new product and promotional items in prominent positions; and kiosk replenishment and maintenance services for retailers, manufacturers, and distributors. It also provides dedicated services, including syndicated services, as well as new store set-up, store remodel, and fixture installation services for a specific retailer or manufacturer. In addition, the company offers project services comprising specific in-store services initiated by retailers and manufacturers, such as new store openings, new product launches, special seasonal or promotional merchandising, focused product support, product recalls, and in-store product demonstration and sampling, as well as performs kiosk product replenishment, inventory control, new store sets and existing store resets, re-merchandising, remodels and category implementation, and under annual or stand-alone project contracts or agreements. Further, it assembles furniture, grills, and various other products in stores, homes, and offices; and offers in-store event staffing, retail compliance and price audit, mystery shopping, and data collection services. The company serves mass merchandisers; pharmacies; grocery, office supply, dollar, automotive, convenience, specialty, electronic, and home improvement stores; and other retail outlets. SPAR Group, Inc. was founded in 1967 and is headquartered in White Plains, New York.", "industry_name": "Media", "sector_name": "Communication Services", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 14700643, "total_enterprise": 36494643, "number_of_employees": 1604, "outstanding_shares": 21000919, "eps": 0.115653, "diluted_eps": 0.11, "earnings_from_cont_operations": 5833000, "gross_profit": 49250000, "cash": 10458000, "total_debt": 19846000, "total_revenue": 252876000, "cash_from_operations": 6147000, "net_income": 2419000, "ebitda": 11081000, "year_low_stock_price": 0.55, "year_high_stock_price": 1.38, "seekingalpha_follower_count": 791, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SGRP.png"}