{"symbol": "SHLO", "name": "Shiloh Industries", "next_earnings_utc": 1592823600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "shiloh.com", "year_founded": 1950, "street_address": "880 Steel Drive", "city": "Valley City", "state": "OH", "zipcode": "44280", "country": "United States", "phone_number": "330-558-2600", "short_description": "Shiloh Industries, Inc., together with its subsidiaries, designs, engineers, and manufactures lightweight technologies for the automotive and commercial vehicle markets worldwide.", "long_description": "Shiloh Industries, Inc., together with its subsidiaries, designs, engineers, and manufactures lightweight technologies for the automotive and commercial vehicle markets worldwide. It produces components primarily for body structure, chassis, and propulsion systems. The company offers solution materials, including aluminum, magnesium, steel, high strength steel alloys, and acoustic laminates; body structure components, such as shock towers, instrument panels/cross car beams, torque boxes, tunnel and seat supports, seat back frames, hinge pillars, liftgates, door inners, roof supports/roof panels, dashpanels, and body sides; and chassis systems components comprising cross members, frame rails, axle carriers, bearing caps, axle covers, PTU covers, axle tubes, rack and pinion housings, steering column housings, knuckles, links, wheel hubs, steering pumps, brake components, wheel blanks, and flanges. It also provides propulsion systems components consisting of battery boxes and closures, beam axle housings, planetary carriers, clutch housings, transmission gear housings, engine valve covers, valve bodies, rocker arm spacers, heat shields, exhaust manifolds, cones, baffles, muffler shells, engine oil pans, transmission fluid pans, front covers, and transmission covers. In addition, the company produces structural products, such as charger boxes, control boxes, motor housings, battery covers, battery box trays, and battery box rails for electric vehicles. It offers its products under the BlankLight, CastLight, StampLight, and ShilohCore brands. The company serves original equipment manufacturers and tier 1 suppliers. Shiloh Industries, Inc. was founded in 1950 and is headquartered in Valley City, Ohio.", "industry_name": "Auto Components", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 29291751, "total_enterprise": 338915751, "number_of_employees": 3600, "outstanding_shares": 24208059, "eps": -0.802994, "diluted_eps": -0.809722, "earnings_from_cont_operations": -18929000, "gross_profit": 96174000, "cash": 12260000, "total_debt": 321884000, "total_revenue": 1039260000, "cash_from_operations": 17597000, "net_income": -18929000, "ebitda": 67319000, "year_low_stock_price": 0.75, "year_high_stock_price": 5.81, "seekingalpha_follower_count": 1255, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SHLO.png"}