{"symbol": "SHOO", "name": "Steven Madden, Ltd.", "next_earnings_utc": 1590663600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 351735000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.18014, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 0, "revenue_down_revisions": 7, "total_analysts": 13, "analysts_sell": 1, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 11, "analysts_underperform": 0, "webpage": "stevemadden.com", "year_founded": 1990, "street_address": "52-16 Barnett Avenue", "city": "Long Island City", "state": "NY", "zipcode": "11104", "country": "United States", "phone_number": "718 446 1800", "short_description": "Steven Madden, Ltd. designs, sources, markets, and sells fashion-forward name brand and private label footwear for women, men, and children in the United States and internationally.", "long_description": "Steven Madden, Ltd. designs, sources, markets, and sells fashion-forward name brand and private label footwear for women, men, and children in the United States and internationally. Its Wholesale Footwear segment provides footwear under the Steve Madden Women's, Madden Girl, Steve Madden Men's, Madden, Madden NYC, Report, Dolce Vita, DV by Dolce Vita, Mad Love, Steven by Steve Madden, Superga, Betsey Johnson, Betseyville, Steve Madden Kids, Stevies, GREATS, Blondo, and Anne Klein brands, as well as private label footwear. The company's Wholesale Accessories segment offers Steve Madden, Steven by Steve Madden, Madden Girl, Betsey Johnson, Madden NYC, Big Buddha, DKNY, Anne Klein, Jocelyn, Luv Betsey, BB Dakota, Cupcakes & Cashmere, and accessories brands; private label fashion handbags and accessories to department stores, mass merchants, value priced retailers, online retailers, and specialty stores; and cold weather accessories, fashion scarves, wraps, and other trend accessories primarily under the Steve Madden, BB Dakota, Cejon, Betsey Johnson, and Big Buddha brand names, as well as private labels to department stores and specialty stores. Its Retail segment operates Steve Madden, Steven, Superga, GREATS, and International retail stores, as well as Steve Madden, Superga, Betsey Johnson, Blondo, Dolce Vita, BB Dakota, and Jocelyn e-commerce websites. The company's Licensing segment licenses its Steve Madden, Steven by Steve Madden, Madden Girl, and FREEBIRD by Steven trademarks. Its First Cost segment operates as a buying agent for footwear products under private labels for mass-market merchandisers, shoe chains, and other mid-tier retailers. As of December 31, 2019, it owned and operated 227 retail stores, including 146 Steve Madden full-price stores, 68 Steve Madden outlet stores, 2 Steven stores, 2 GREATS stores, and 1 Superga store, as well as 8 e-commerce websites. Steven Madden, Ltd. was founded in 1990 and is headquartered in Long Island City, New York.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1883817799, "total_enterprise": 1763714799, "number_of_employees": 3250, "outstanding_shares": 83134060, "eps": 1.775776, "diluted_eps": 1.69, "earnings_from_cont_operations": 141722000, "gross_profit": 686017000, "cash": 304622000, "total_debt": 171796000, "total_revenue": 1787157000, "cash_from_operations": 233780000, "net_income": 141311000, "ebitda": 206583000, "year_low_stock_price": 16.38, "year_high_stock_price": 44.8, "stocktwits_watchlist_count": 328, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SHOO.png"}