{"symbol": "SLB", "name": "Schlumberger", "next_earnings_utc": 1595587800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5692211020.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.00028, "eps_up_revisions": 0, "eps_down_revisions": 23, "revenue_up_revisions": 0, "revenue_down_revisions": 19, "total_analysts": 32, "analysts_sell": 0, "analysts_buy": 12, "analysts_outperform": 5, "analysts_hold": 15, "analysts_underperform": 0, "webpage": "slb.com", "year_founded": 1926, "street_address": "5599 San Felipe", "city": "Houston", "state": "TX", "zipcode": "77056", "country": "United States", "phone_number": null, "short_description": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide.", "long_description": "Schlumberger Limited supplies technology for reservoir characterization, drilling, production, and processing to the oil and gas industry worldwide. The company's Reservoir Characterization segment offers reservoir interpretation and data processing services; open and cased-hole, and slickline services; exploration and production pressure and flow-rate measurement services; tubing-conveyed perforating services; integrated production systems; software, consulting, information management, and IT infrastructure services; reservoir characterization, field development planning, and production enhancement consulting services; and petro technical data services and training solutions. Its Drilling segment designs, manufactures, and markets roller cone and fixed cutter drill bits; supplies drilling fluid systems, fluid systems and specialty equipment, production technology solutions, and engineered managed pressure and underbalanced drilling solutions; and offers environmental services and products. This segment also provides drilling and measurement, land drilling rigs, and related support services; and supplies well planning and drilling, engineering, supervision, logistics, procurement, and contracting services, as well as drilling rig management services. The company's Production segment offers well services; coiled tubing equipment; hydraulic fracturing, multistage completions, perforating, coiled tubing equipment, and services; well completion services and equipment; artificial lift production equipment and optimization services; and production management services. Its Cameron segment offers integrated subsea production systems; drilling equipment and services; onshore and offshore platform wellhead systems and processing solutions; and valve and process systems. The company was formerly known as Socie'te' de Prospection E'lectrique. Schlumberger Limited was founded in 1926 and is based in Houston, Texas.", "industry_name": "Energy Equipment and Services", "sector_name": "Energy", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 25632904392, "total_enterprise": 39352904392, "number_of_employees": 105000, "outstanding_shares": 1387812907, "eps": -12.944063, "diluted_eps": -12.945608, "earnings_from_cont_operations": -17905000000, "gross_profit": 4101000000, "cash": 3344000000, "total_debt": 16642000000, "total_revenue": 32493000000, "cash_from_operations": 5889000000, "net_income": -17934000000, "ebitda": 6336000000, "year_low_stock_price": 11.87, "year_high_stock_price": 41.4, "seekingalpha_follower_count": 97412, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SLB.png"}