{"symbol": "SMAR", "name": "Smartsheet Inc.", "next_earnings_utc": 1591216200, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 81399140.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.19345, "eps_up_revisions": 0, "eps_down_revisions": 15, "revenue_up_revisions": 8, "revenue_down_revisions": 5, "total_analysts": 16, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 5, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "smartsheet.com", "year_founded": 2005, "street_address": "10500 NE 8th Street", "city": "Bellevue", "state": "WA", "zipcode": "98004", "country": "United States", "phone_number": "844 324 2360", "short_description": "Smartsheet Inc. provides cloud-based platform for execution of work.", "long_description": "Smartsheet Inc. provides cloud-based platform for execution of work. It enables teams and organizations to plan, capture, manage, automate, and report on work. The company offers Smartdashboards that provides real-time visibility into the status of work to align individuals, managers, and executives; Smartportals to easily locate and access from any device the resources available for a project without IT assistance; Smartcards to organize, share, and act on workflows; and Smartgrids to keep teams on task by easily tracking multiple moving parts. It also provides Smartprojects, which offers interface with capabilities that foster collaboration among teams and organizations to enhance work execution; Smartcalendars that align teams and organizations by connecting deadlines to workflows; Smartforms enables business users to collect information in a structured and consistent format; Smartautomation that automates repetitive processes; and Smartintegrations enable organizations and teams to connect, sync, and extend their existing enterprise applications across their workflows to create work execution. In addition, the company offers Connectors; Control Center that enables organizations to achieve consistent work execution; and Accelerators, which are pre-packaged solutions for specific and repeatable use cases. It serves aerospace, automotive, biotechnology, consumer, e-commerce, education, finance, government, healthcare, IT services, marketing, media, non-profit, publishing, software, technology, and travel sectors. The company was formerly known as Smartsheet.com, Inc. and changed its name to Smartsheet Inc. inn February 2017. Smartsheet Inc. was founded in 2005 and is headquartered in Bellevue, Washington.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 6881483210, "total_enterprise": 6380089210, "number_of_employees": 1588, "outstanding_shares": 119345876, "eps": -0.849094, "diluted_eps": -0.849094, "earnings_from_cont_operations": -95940000, "gross_profit": 218051000, "cash": 566456000, "total_debt": 65062000, "total_revenue": 270882000, "cash_from_operations": -10870000, "net_income": -95940000, "ebitda": -90256000, "year_low_stock_price": 30.91, "year_high_stock_price": 58.3, "seekingalpha_follower_count": 6655, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SMAR.png"}