{"symbol": "SMGBY", "name": "San Miguel", "next_earnings_utc": 1592316000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "sanmiguel.com.ph", "year_founded": 1890, "street_address": "No. 40 San Miguel Avenue", "city": "Mandaluyong City", "state": null, "zipcode": "1550", "country": "Philippines", "phone_number": "63 2 8632 3000", "short_description": "San Miguel Corporation engages in food and beverage, packaging, energy, fuel and oil, and infrastructure businesses worldwide.", "long_description": "San Miguel Corporation engages in food and beverage, packaging, energy, fuel and oil, and infrastructure businesses worldwide. Its Food and Beverage segment is involved in feeds production; poultry and livestock farming; processing and selling poultry and meat products; processing and marketing refrigerated processed and canned meat products; milling, manufacturing, and marketing flour, flour mixes, bakery ingredients, butter, margarine, cheese, milk, ice cream, jelly-based snacks and desserts, oils, salad aids, biscuits, and condiments; importing and marketing coffee and coffee-related products; and grain terminal handling. This segment also produces, markets, and sells non-alcoholic beverages; and hard liquor in the form of gin, Chinese wine, brandy, rum, and vodka. Its Packaging segment produces and markets packaging products, such as glass containers and molds, polyethylene terephthalate (PET) bottles and preforms, PET recycling, plastic and metal closures, corrugated cartons, woven polypropylene, kraft sacks and paperboards, pallets, flexible packaging, aluminum cans, woven products, industrial laminates, and radiant barriers, as well as plastic crates, floorings, films, trays, pails, and tubs. This segment also engages in the crate and plastic pallet leasing, PET bottle filling graphics design, packaging research and testing, packaging development and consultation, and contract packaging and trading activities. Its Energy segment generates, sells, retails, and distributes power. Its Fuel and Oil segment refines and markets petroleum products. Its Infrastructure segment constructs and develops airports, roads, highways, toll roads, freeways, skyways, flyovers, viaducts, interchanges, and mass rail transit systems. The company also develops, manages, and sells real estate properties. The company was founded in 1890 and is headquartered in Mandaluyong City, the Philippines. San Miguel Corporation is a subsidiary of Top Frontier Investment Holdings, Inc.", "industry_name": "Industrial Conglomerates", "sector_name": "Industrials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 4776390679, "total_enterprise": 24529907009, "number_of_employees": 47730, "outstanding_shares": 236743300, "eps": 0.0601662271206455, "diluted_eps": 0.060027553631175, "earnings_from_cont_operations": 725093486, "gross_profit": 3534953749, "cash": 7569356426, "total_debt": 21780751821, "total_revenue": 19359259988, "cash_from_operations": 1092068490, "net_income": 282345995, "ebitda": 2672958079, "year_low_stock_price": 14.84, "year_high_stock_price": 35.45, "seekingalpha_follower_count": 206, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SMGBY.png"}