{"symbol": "SNOA", "name": "Sonoma Pharmaceuticals", "next_earnings_utc": 1594071300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "sonomapharma.com", "year_founded": 1999, "street_address": "1129 North McDowell Boulevard", "city": "Petaluma", "state": "CA", "zipcode": "94954", "country": "United States", "phone_number": "707-283-0550", "short_description": "Sonoma Pharmaceuticals, Inc., a specialty pharmaceutical company, develops and markets solutions for the treatment of chronic skin conditions and advanced tissue care in the United States and internationally.", "long_description": "Sonoma Pharmaceuticals, Inc., a specialty pharmaceutical company, develops and markets solutions for the treatment of chronic skin conditions and advanced tissue care in the United States and internationally. The company offers Epicyn, an antimicrobial facial cleanser; Levicyn, a hypochlorous acid (HOCl) based prescription product to manage and relieve burning, itching, and pain experienced with various types of dermatoses; Celacyn gel, a product indicated to promote healing through the management of new and old scars resulting from surgical procedures and trauma wounds or burns; SebuDerm, a product indicated to manage and relieve the burning, itching, pain, and distraction associated with seborrhea and seborrheic dermatitis; and Ceramax, a Lipogrid based skin barrier cream indicated to relieve and manage the burning and itching associated with various skin conditions, as well as Loyon for the management of scaling and itch. It also provides Mondoxyne, a doxycycline-based prescription oral tetracycline antibiotic used as a treatment for acne vulgaris; Acuicyn, a HOCl-based product indicated to relieve itch and inflammation while helping to keep areas around the eye clean; and Microcyn, a line of products designed to stimulate expedited healing by targeting various pathogens, as well as antibiotic-resistant strains that slow natural healing of wounds. In addition, the company offers MicrocynAH and MicrocynVS, which are HOCl-based solutions designed to relieve common symptoms of hot spots, scratches, skin rashes post-surgical sites, and irritated animal skin for healing; and Pediacyn, Epicyn, Gramaderm, and Microdacyn for dermatoses, scar management, and acne. The company was formerly known as Oculus Innovative Sciences, Inc. and changed its name to Sonoma Pharmaceuticals, Inc. in December 2016. Sonoma Pharmaceuticals, Inc. was incorporated in 1999 and is headquartered in Petaluma, California.", "industry_name": "Pharmaceuticals", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 17241585, "total_enterprise": 14612585, "number_of_employees": 63, "outstanding_shares": 1777483, "eps": -3.521763, "diluted_eps": -3.521763, "earnings_from_cont_operations": -4794000, "gross_profit": 8694000, "cash": 3727000, "total_debt": 1098000, "total_revenue": 18739000, "cash_from_operations": -3746000, "net_income": -4794000, "ebitda": -5419000, "year_low_stock_price": 3.33, "year_high_stock_price": 19.6, "seekingalpha_follower_count": 4843, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SNOA.png"}