{"symbol": "SNX", "name": "SYNNEX", "next_earnings_utc": 1592943300, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5133330660.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.50057, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 6, "total_analysts": 8, "analysts_sell": 0, "analysts_buy": 5, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "synnexcorp.com", "year_founded": 1980, "street_address": "44201 Nobel Drive", "city": "Fremont", "state": "CA", "zipcode": "94538", "country": "United States", "phone_number": "510 656 3333", "short_description": "SYNNEX Corporation provides business process services in the United States and internationally.", "long_description": "SYNNEX Corporation provides business process services in the United States and internationally. It operates in two segments, Technology Solutions and Concentrix. The Technology Solutions segment distributes peripherals; information technology systems, including data center servers and storage solutions; system components; software; networking, communications, and security equipment; consumer electronics; and complementary products. It also provides systems design and integration solutions, build-to-order, and configure-to-order assembly capabilities; logistics services that include outsourced fulfillment, virtual distribution, and direct ship to end-users; cloud services; online services; and financing services comprising net terms, third party leasing, floor plan financing, and letters of credit backed financing and arrangements. In addition, this segment offers marketing services, such as direct mail, external media advertising, reseller product training, targeted telemarketing campaigns, trade shows, trade groups, database analysis, print on demand services, and Web-based marketing. This segment serves resellers, system integrators, and retailers. The Concentrix segment offers a portfolio of strategic solutions and end-to-end business outsourcing services focused on customer experience, process optimization, technology innovation, front and back-office automation, and business transformation services. This segment serves clients in various industry verticals, including automotive; banking, financial services, and insurance; energy and public-sector; healthcare; media and communications; retail and e-commerce; technology and consumer electronics; and travel and transportation. The company was formerly known as SYNNEX Information Technologies, Inc. and changed its name to SYNNEX Corporation in October 2003. SYNNEX Corporation was founded in 1980 and is headquartered in Fremont, California.", "industry_name": "Electronic Equipment, Instruments and Components", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 5489910067, "total_enterprise": 9038582067, "number_of_employees": 235000, "outstanding_shares": 51475950, "eps": 10.472155, "diluted_eps": 10.407794, "earnings_from_cont_operations": 536190000, "gross_profit": 2917341000, "cash": 296193000, "total_debt": 3844865000, "total_revenue": 23772038000, "cash_from_operations": 766360000, "net_income": 536190000, "ebitda": 1268487000, "year_low_stock_price": 52.06, "year_high_stock_price": 153.07, "seekingalpha_follower_count": 3753, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SNX.png"}