{"symbol": "SOMLY", "name": "SECOM CO., LTD.", "next_earnings_utc": 1591711200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2121794692.411735, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "secom.co.jp", "year_founded": 1962, "street_address": "5-1, Jingumae 1-chome", "city": "Tokyo", "state": null, "zipcode": "150-0001", "country": "Japan", "phone_number": "81 3 5775 8100", "short_description": "SECOM CO., LTD. provides security services in Japan and internationally.", "long_description": "SECOM CO., LTD. provides security services in Japan and internationally. The company provides online security; remote imaging security; and building management systems for condominiums and apartments, shops, offices, warehouses, factories, and other commercial and industrial establishments, as well as financial institutions; emergency medical alert system for seniors; large-scale proprietary; and camera systems. It also offers automatic fire alarm, environmental monitoring systems, and fire and smoke control systems; foam, dry chemical, and inert gas fire extinguishing systems, as well as fire sprinklers; inspection, maintenance, and repair services; and parking lot control systems, as well as assembles and sells printed circuit boards. In addition, the company provides pharmaceutical and home nursing services, and consulting and support services for physicians; caregivers to assist with personal hygiene and other daily activities; housekeeping services; electronic medical report system for home medical care; remote image diagnosis support services; robots that enable people with impaired upper body mobility to eat with minimal assistance; residences for seniors; and health care club services. Further, it offers fire, cancer treatment, and automobile insurance products, as well as hospital referrals and treatment related consulting services; geographic information services; and data center, disaster response, information security, business process outsourcing, and cloud-based services. Additionally, the company develops and sells condominiums and suites; leases and manages real estate properties; sells security, medical, water-treatment equipment; operates PFI correctional facilities, pharmacies, and restaurants and shops at medical facilities; and offers electrical engineering, general office, credit, clerical, software development, lifestyle support, and car maintenance services. The company was founded in 1962 and is headquartered in Tokyo, Japan.", "industry_name": "Commercial Services and Supplies", "sector_name": "Industrials", "is_defunct": false, "exchange": "Pink Current Info", "equity_type": "stocks", "market_cap": 18890994853, "total_enterprise": 15371920652, "number_of_employees": 56923, "outstanding_shares": 873045532, "eps": 3.7960098868086, "diluted_eps": 3.7960098868086, "earnings_from_cont_operations": 950900788, "gross_profit": 3139261698, "cash": 5464680004, "total_debt": 657235600, "total_revenue": 9859557093, "cash_from_operations": null, "net_income": 828520141, "ebitda": 1934559186, "year_low_stock_price": 15.8, "year_high_stock_price": 23.46, "seekingalpha_follower_count": 56, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SOMLY.png"}