{"symbol": "SPWH", "name": "Sportsman's Warehouse Holdings", "next_earnings_utc": 1591301100, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 224707250.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.075, "eps_up_revisions": 5, "eps_down_revisions": 0, "revenue_up_revisions": 3, "revenue_down_revisions": 0, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 2, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "sportsmans.com", "year_founded": 1986, "street_address": "1475 West 9000 South", "city": "West Jordan", "state": "UT", "zipcode": "84088", "country": "United States", "phone_number": "801 566 6681", "short_description": "Sportsman's Warehouse Holdings, Inc., together with its subsidiaries, operates as an outdoor sporting goods retailer in the United States.", "long_description": "Sportsman's Warehouse Holdings, Inc., together with its subsidiaries, operates as an outdoor sporting goods retailer in the United States. It offers camping products, such as backpacks, camp essentials, canoes and kayaks, coolers, outdoor cooking equipment, sleeping bags, tents, and tools; and clothing products, including camouflage, jackets, hats, outerwear, sportswear, technical gear, and work wear. The company also provides fishing products comprising bait, electronics, fishing rods, flotation items, fly fishing products, lines, lures, reels, tackles, and small boats; and foot wear products consisting of hiking and work boots, socks, sport sandals, technical footwear, trial and casual shoes, and waders. In addition, it offers hunting and shooting products, such as ammunition, archery items, ATV accessories, blinds and tree stands, decoys, firearms, firearms safety and storage products, reloading equipment, and shooting gear products; and optics, electronics, and accessories, including gift items, GPS devices, knives, lighting, optics, and two-way radios. Further, the company's stores provide archery technician services, fishing-reel line winding, gun bore sighting and scope mounting, and cleaning services, as well as issues hunting and fishing licenses. Additionally, it offers various private label offerings under the Rustic Ridge, Killik, Vital Impact, Yukon Gold, Lost Creek, and Sportsman's Warehouse brands. As of February 01, 2020, the company operated through 103 stores in 27 states. Sportsman's Warehouse Holdings, Inc. was founded in 1986 and is headquartered in West Jordan, Utah.", "industry_name": "Specialty Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 483649092, "total_enterprise": 895327092, "number_of_employees": 3875, "outstanding_shares": 43298934, "eps": 0.468308, "diluted_eps": 0.46, "earnings_from_cont_operations": 20215000, "gross_profit": 296633000, "cash": 1685000, "total_debt": 413363000, "total_revenue": 886401000, "cash_from_operations": 77866000, "net_income": 20215000, "ebitda": 53420000, "year_low_stock_price": 3.41, "year_high_stock_price": 11.61, "seekingalpha_follower_count": 2567, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SPWH.png"}