{"symbol": "SRCE", "name": "1st Source", "next_earnings_utc": 1595536200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 79006330.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.59333, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "1stsource.com", "year_founded": 1863, "street_address": "100 North Michigan Street", "city": "South Bend", "state": "IN", "zipcode": "46601", "country": "United States", "phone_number": "574-235-2000", "short_description": "1st Source Corporation operates as the holding company for 1st Source Bank that provides commercial and consumer banking services, trust and wealth advisory services, and insurance to individual and business clients.", "long_description": "1st Source Corporation operates as the holding company for 1st Source Bank that provides commercial and consumer banking services, trust and wealth advisory services, and insurance to individual and business clients. Its consumer banking services include checking and savings accounts; certificates of deposit; individual retirement accounts; online and mobile banking products; consumer loans, real estate loans, and lines of credit; and financial planning, financial literacy, and other consultative services, as well as debit and credit cards. The company also offers commercial, small business, agricultural, and real estate loans for general corporate purposes, including financing for industrial and commercial properties, equipment, inventories, accounts receivables, and renewable energy and acquisition financing; and commercial leasing, treasury management, and retirement planning services. In addition, it provides a range of trust, investment, agency, and custodial services comprising administration of estates and personal trusts, as well as management of investment accounts for individuals, employee benefit plans, and charitable foundations. Further, the company offers equipment loan and lease products for new and used aircraft, auto and light trucks, construction equipment, and medium and heavy duty trucks; and leases construction equipment, various types of trucks, vans, automobiles, motor coaches, shuttle buses, and other equipment. Additionally, it provides corporate and personal property, casualty, and individual and group health and life insurance products and services; and investment advisory services to trust and investment clients. As of December 31, 2019, the company operated through 80 banking centers in 17 counties in Indiana and Michigan, and Sarasota County in Florida. 1st Source Corporation was founded in 1863 and is headquartered in South Bend, Indiana.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 883277580, "total_enterprise": null, "number_of_employees": 1175, "outstanding_shares": 25535634, "eps": 3.355913, "diluted_eps": 3.350453, "earnings_from_cont_operations": 86237000, "gross_profit": 303085000, "cash": 174784000, "total_debt": 476868000, "total_revenue": 303085000, "cash_from_operations": 162514000, "net_income": 86177000, "ebitda": null, "year_low_stock_price": 26.07, "year_high_stock_price": 53.42, "seekingalpha_follower_count": 1224, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SRCE.png"}