{"symbol": "SRNE", "name": "Sorrento Therapeutics, Inc.", "next_earnings_utc": 1590984000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 8000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.23, "eps_up_revisions": 1, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 1, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "sorrentotherapeutics.com", "year_founded": 2006, "street_address": "4955 Directors Place", "city": "San Diego", "state": "CA", "zipcode": "92121", "country": "United States", "phone_number": "858 203 4100", "short_description": "Sorrento Therapeutics, Inc., a clinical stage biopharma company, develops therapies for cancer, autoimmune, inflammatory, and neurodegenerative diseases.", "long_description": "Sorrento Therapeutics, Inc., a clinical stage biopharma company, develops therapies for cancer, autoimmune, inflammatory, and neurodegenerative diseases. It operates through two segments, Sorrento Therapeutics and Scilex. The company provides cancer therapeutics by leveraging its proprietary G-MAB antibody library and targeted delivery modalities, which include chimeric antigen receptor T-cell therapy (CAR-T), dimeric antigen receptor T-cell therapy, and antibody drug conjugates, as well as bispecific antibody approaches. It also offers Sofusa, a drug delivery technology that delivers biologics directly into the lymphatic system. In addition, the company's clinical programs in development include anti-CD38 CAR-T therapy for the treatment of multiple myeloma, as well as for amyloidosis and graft-versus-host diseases. Further, it develops resiniferatoxin, a non-opioid-based TRPV1 agonist neurotoxin for late stage cancer and osteoarthritis knee pain treatment; and ZTlido, a lidocaine delivery system for the treatment of postherpetic neuralgia. Additionally, the company engages in the development of SEMDEXA, an injectable viscous gel formulation, which is Phase III trial for the treatment of sciatica, a pathology of low back pain; and SP-103, an investigational non-aqueous lidocaine topical system undergoing clinical development in chronic low back pain conditions. It has various collaborations with SmartPharm Therapeutics Inc. to develop gene-encoded antibody vaccine to protect against COVID-19; Celularity, Inc. for initiating Phase I/II clinical study, including up to 86 patients with COVID-19; and Mount Sinai Health System to develop COVI-SHIELD, an antibody therapy targeting SARS-CoV-2 infection, as well as a research testing agreement with The University of Texas Medical Branch at Galveston for the preclinical testing of Sorrento's COVID-19 therapeutic product candidates. The company was founded in 2006 and is based in San Diego, California.", "industry_name": "Biotechnology", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 1020717690, "total_enterprise": 1204014690, "number_of_employees": 310, "outstanding_shares": 202122315, "eps": -1.685848, "diluted_eps": -1.954273, "earnings_from_cont_operations": -285663000, "gross_profit": -81775000, "cash": 21897000, "total_debt": 255011000, "total_revenue": 33010000, "cash_from_operations": -167237000, "net_income": -249192000, "ebitda": -179900000, "year_low_stock_price": 1.39, "year_high_stock_price": 10.0, "seekingalpha_follower_count": 18900, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/SRNE.png"}