{"symbol": "STCN", "name": "Steel Connect", "next_earnings_utc": 1591884000, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "moduslink.com", "year_founded": 1986, "street_address": "1601 Trapelo Road", "city": "Waltham", "state": "MA", "zipcode": "02451", "country": "United States", "phone_number": "781-663-5001", "short_description": "Steel Connect, Inc., through its subsidiaries, provides supply chain and direct marketing services to the consumer electronics, communications, computing, medical devices, software, storage, retail, and other industries.", "long_description": "Steel Connect, Inc., through its subsidiaries, provides supply chain and direct marketing services to the consumer electronics, communications, computing, medical devices, software, storage, retail, and other industries. The company offers product configuration and packaging, kitting, and assembly of components and parts into finished goods; and value-added processes, such as product testing, radio frequency identification tagging, product or service activation, language settings, personalization and engraving, multi-channel packaging, and packaging design services. It also provides fulfillment services, including order management, pick, pack and ship, retail compliance, and demand planning services; and content protection and activation, and IP security services, as well as optimizes component and finished goods inventory levels. In addition, it offers operates a cloud-based e-commerce platform, an online buying experience so that products can be purchased, serviced, and delivered worldwide; and provides reverse logistics services that simplifies the returns process for retailers and manufacturers to improve service parts management and the value of returned assets. Further, the company offers direct marketing services comprising end-to-end services for paper-based direct marketing and omnichannel marketing campaign services. The company was formerly known as ModusLink Global Solutions, Inc. and changed its name to Steel Connect, Inc. in February 2018. Steel Connect, Inc. was incorporated in 1986 and is headquartered in Waltham, Massachusetts.", "industry_name": "IT Services", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 31869326, "total_enterprise": 485408326, "number_of_employees": 3760, "outstanding_shares": 61405253, "eps": -0.789499, "diluted_eps": -0.795148, "earnings_from_cont_operations": -46374000, "gross_profit": 166497000, "cash": 30197000, "total_debt": 448555000, "total_revenue": 839079000, "cash_from_operations": 20258000, "net_income": -46374000, "ebitda": 46199000, "year_low_stock_price": 0.402, "year_high_stock_price": 1.95, "seekingalpha_follower_count": 1366, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/STCN.png"}