{"symbol": "STLD", "name": "Steel Dynamics", "next_earnings_utc": 1595282400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2009491760.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.2691, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 12, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 2, "analysts_hold": 6, "analysts_underperform": 1, "webpage": "steeldynamics.com", "year_founded": 1993, "street_address": "7575 West Jefferson Boulevard", "city": "Fort Wayne", "state": "IN", "zipcode": "46804", "country": "United States", "phone_number": "260 969 3500", "short_description": "Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States.", "long_description": "Steel Dynamics, Inc., together with its subsidiaries, operates as a steel producer and metal recycler in the United States. It operates through three segments: Steel Operations, Metals Recycling Operations, and Steel Fabrication Operations. The Steel Operations segment offers hot roll, cold roll, and coated steel products; structural steel beams, pilings, and standard and premium grade rail products; engineered special-bar-quality products; and merchant-bar-quality products, including rounds, angles, flats, reinforcing bars, and channels and specialty steel sections. This segment is also involved in the turning, polishing, straightening, chamfering, threading, precision saw-cutting, cold drawing, and heat treating of bar products; and cutting to length, straightening, hole punching, shot blasting, welding, and coating of beams, channels, and specialty steel sections. Its products are used in construction, automotive, manufacturing, transportation, heavy and agriculture equipment, and pipe and tube industry sectors. This segment sells its products directly to end-users, steel fabricators, and service centers. The Metals Recycling Operations segment engages in the purchase, process, and resale of ferrous and nonferrous scrap metals into reusable forms and grades. Its ferrous products include heavy melting steel, busheling, bundled scrap, shredded scrap, steel turnings, and cast iron products; and nonferrous products comprise aluminum, brass, copper, stainless steel, and other nonferrous metals. This segment also provides transportation logistics, marketing, brokerage, and scrap management services. The Steel Fabrication Operations segment produces steel building components comprising steel joists, girders, trusses, and steel deck products for non-residential steel fabricators. The company also exports its products. Steel Dynamics, Inc. was founded in 1993 and is headquartered in Fort Wayne, Indiana.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5586421080, "total_enterprise": 6912285080, "number_of_employees": 8385, "outstanding_shares": 210332119, "eps": 3.015216, "diluted_eps": 3.003023, "earnings_from_cont_operations": 663909000, "gross_profit": 1512643000, "cash": 1454671000, "total_debt": 2788122000, "total_revenue": 10222656000, "cash_from_operations": 1426018000, "net_income": 654115000, "ebitda": 1289891000, "year_low_stock_price": 14.98, "year_high_stock_price": 35.78, "seekingalpha_follower_count": 11085, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/STLD.png"}