{"symbol": "TBK", "name": "Triumph Bancorp", "next_earnings_utc": 1595275500, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 72078800.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.15667, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 2, "revenue_down_revisions": 3, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 1, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "triumphbancorp.com", "year_founded": null, "street_address": "12700 Park Central Drive", "city": "Dallas", "state": "TX", "zipcode": "75251", "country": "United States", "phone_number": "214-365-6900", "short_description": "Triumph Bancorp, Inc. operates as a financial holding company for TBK Bank, SSB that provides banking and commercial finance products and services to retail customers and small-to-mid-sized businesses in the United States.", "long_description": "Triumph Bancorp, Inc. operates as a financial holding company for TBK Bank, SSB that provides banking and commercial finance products and services to retail customers and small-to-mid-sized businesses in the United States. The company operates through Banking, Factoring, and Corporate segments. It offers depository products, including checking, savings, and money market accounts, as well as certificates of deposit; and commercial and industrial loans, loans to purchase capital equipment, and business loans for working capital and operational purposes. The company also provides asset-based, and equipment and premium finance loans; real estate loans to finance commercial properties; factoring services to the transportation and non-transportation sectors; agriculture loans; commercial construction, land, and land development loans; mortgage warehouse loans; residential real estate loans; and consumer loans. In addition, it offers debit cards; electronic banking, trust, and treasury management services; and insurance brokerage services. As of December 31, 2019, the company operated through a network of 10 branches in the Quad Cities Metropolitan Area of Iowa and Illinois; 8 branches in central and northwestern Illinois; 7 branches in southern Colorado; 3 branches in New Mexico; 30 branches in Colorado; 2 branches in far western Kansas; and 3 loan production offices in Colorado and 1 loan production office in Missouri, as well as an additional branch office limited to deposit gathering activities in Dallas, Texas. Triumph Bancorp, Inc. is headquartered in Dallas, Texas.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 587966092, "total_enterprise": null, "number_of_employees": 1107, "outstanding_shares": 23949739, "eps": 1.550529, "diluted_eps": 1.550529, "earnings_from_cont_operations": 39306000, "gross_profit": 264311000, "cash": 208414000, "total_debt": 1003124000, "total_revenue": 264311000, "cash_from_operations": 65777000, "net_income": 39306000, "ebitda": null, "year_low_stock_price": 19.03, "year_high_stock_price": 43.15, "seekingalpha_follower_count": 481, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TBK.png"}