{"symbol": "TCOM", "name": "Trip.com Group Limited", "next_earnings_utc": 1590703200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 534052860.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.27742, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 35, "analysts_sell": 1, "analysts_buy": 13, "analysts_outperform": 6, "analysts_hold": 14, "analysts_underperform": 1, "webpage": "trip.com", "year_founded": 1999, "street_address": "968 Jin Zhong Road", "city": "Shanghai", "state": null, "zipcode": "200335", "country": "China", "phone_number": "86 21 3406 4880", "short_description": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally.", "long_description": "Trip.com Group Limited operates as a travel service provider for accommodation reservation, transportation ticketing, packaged tours and in-destination, corporate travel management, and other travel-related services in China and internationally. The company acts as an agent for hotel-related transactions and selling air tickets; and provides other related services, including sale of aviation and train insurance, air-ticket delivery services, online check-in, and other value-added services, such as online seat selection, express security check, and real-time flight status. It also provides independent leisure travelers bundled packaged-tour products comprising group tours, semi-group tours, and customized and packaged tours with various transportation arrangements, such as flights, cruises, buses, and car rental services. In addition, the company offers integrated transportation and accommodation services; various value-added services, such as transportation at destinations and tickets, activities, insurance, visa services, and tour guides; and customer, supplier management and customer relationship management services. Further, it provides its corporate clients with travel data collection and analysis, industry benchmark, cost saving analysis, and travel management solutions; and Corporate Travel Management System, an online platform that integrates information maintenance, online booking and authorization, online enquiry, and travel report system. Additionally, the company offers online advertising and financial services. It operates primarily under the Ctrip, Qunar, Trip.com, and Skyscanner brands. The company was formerly known as Ctrip.com International, Ltd. and changed its name to Trip.com Group Limited in October 2019. Trip.com Group Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.", "industry_name": "Internet and Direct Marketing Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 14698668650, "total_enterprise": 16373545497, "number_of_employees": 44300, "outstanding_shares": 588417480, "eps": 1.77312499102385, "diluted_eps": 1.65195751770096, "earnings_from_cont_operations": 1005041003, "gross_profit": 4063536745, "cash": 6172859010, "total_debt": 7359002714, "total_revenue": 5122290999, "cash_from_operations": 1053153140, "net_income": 1006908041, "ebitda": 880811156, "year_low_stock_price": 20.1, "year_high_stock_price": 40.91, "stocktwits_watchlist_count": 3962, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TCOM.png"}