{"symbol": "TER", "name": "Teradyne", "next_earnings_utc": 1595365200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 750456350.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.01501, "eps_up_revisions": 14, "eps_down_revisions": 1, "revenue_up_revisions": 13, "revenue_down_revisions": 0, "total_analysts": 17, "analysts_sell": 2, "analysts_buy": 8, "analysts_outperform": 0, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "teradyne.com", "year_founded": 1960, "street_address": "600 Riverpark Drive", "city": "North Reading", "state": "MA", "zipcode": "01864", "country": "United States", "phone_number": "978 370 2700", "short_description": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide.", "long_description": "Teradyne, Inc. designs, develops, manufactures, sells, and supports automatic test equipment worldwide. The company operates through Semiconductor Test, System Test, Industrial Automation, and Wireless Test segments. The Semiconductor Test segment offers products and services for wafer level and device package testing in automotive, industrial, communications, consumer, computer and electronic game, and other applications. This segment also provides FLEX test platform systems; J750 test system to address the highest volume semiconductor devices; Magnum platform that tests memory devices, such as flash memory and DRAM; and ETS platform for semiconductor manufacturers, and assembly and test subcontractors in the analog/mixed signal markets. It serves integrated device manufacturers that integrate the fabrication of silicon wafers into their business; fabless companies that outsource the manufacturing of silicon wafers; foundries; and outsourced semiconductor assembly and test providers. The System Test segment offers defense/aerospace test instrumentation and systems; storage test systems; and circuit-board test and inspection systems. The Industrial Automation segment provides collaborative, autonomous mobile, and advanced robotic control software for manufacturing and light industrial customers. The Wireless Test segment provides test solutions for use in the development and manufacture of wireless devices, smart phones, tablets, notebooks, laptops, peripherals, and Internet-of-Things devices under the LitePoint brand name. This segment also offers IQxel products for Wi-Fi and other standards; IQxstream solution for testing GSM, EDGE, CDMA2000, TD-SCDMA, WCDMA, HSPA+, LTE-FDD, TD_LTE, LTE-A, and 5G technologies; IQcell, a multi-device cellular signaling test solution; IQgig test solution; and turnkey test software for wireless chipsets. The company was founded in 1960 and is headquartered in North Reading, Massachusetts.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 11099844832, "total_enterprise": 10759734832, "number_of_employees": 5400, "outstanding_shares": 165768292, "eps": 3.168672, "diluted_eps": 2.950025, "earnings_from_cont_operations": 534521000, "gross_profit": 1457744000, "cash": 804495000, "total_debt": 464385000, "total_revenue": 2505221000, "cash_from_operations": 603836000, "net_income": 534521000, "ebitda": 753293000, "year_low_stock_price": 41.89, "year_high_stock_price": 81.57, "seekingalpha_follower_count": 12094, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TER.png"}