{"symbol": "TFC", "name": "Truist Financial", "next_earnings_utc": 1595238300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5469100830.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.77795, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 24, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 6, "analysts_hold": 10, "analysts_underperform": 0, "webpage": "truist.com", "year_founded": 1872, "street_address": "214 North Tryon Street", "city": "Charlotte", "state": "NC", "zipcode": "28202", "country": "United States", "phone_number": "336-733-2000", "short_description": "Truist Financial Corporation, a holding company, provides banking and trust services for small and mid-size businesses, public agencies, local governments, corporations, and individuals in the Southeastern and Mid-Atlantic United States.", "long_description": "Truist Financial Corporation, a holding company, provides banking and trust services for small and mid-size businesses, public agencies, local governments, corporations, and individuals in the Southeastern and Mid-Atlantic United States. The company operates through four segments: Community Banking Retail and Consumer Finance, Community Banking Commercial, Insurance Holdings, and Financial Services and Commercial Finance. Its deposit products include noninterest-bearing checking, interest-bearing checking, savings, and money market deposit accounts, as well as certificates of deposit and individual retirement accounts. The company also provides funding; asset management; automobile lending; bankcard lending; consumer finance; home equity and mortgage lending; insurance, such as property and casualty, life, health, employee benefits, commercial general liability, surety, title and other insurance products; investment brokerage; mobile/online banking; and payment, lease financing, small business lending, and wealth management/private banking services. In addition, it offers association, capital market, institutional trust, insurance premium and commercial finance, international banking, leasing, merchant, commercial deposit and treasury, commercial middle market lending, floor plan lending, commercial mortgage lending, mortgage warehouse lending, private equity investment, real estate lending, and supply chain financing services. Further, the company provides retail brokerage, equity and debt underwriting, investment advice, and corporate finance, as well as facilitates the origination, trading, and distribution of fixed-income securities and equity products. As of December 31, 2018, the company operated through approximately 1,879 financial centers. The company was formerly known as BB&T Corporation and changed its name to Truist Financial Corporation in December 2019. The company was founded in 1872 and is based in Charlotte, North Carolina.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 49559886023, "total_enterprise": null, "number_of_employees": 59000, "outstanding_shares": 1347468353, "eps": 3.436251, "diluted_eps": 3.396794, "earnings_from_cont_operations": 3502000000, "gross_profit": 13928000000, "cash": 46047000000, "total_debt": 81201000000, "total_revenue": 13928000000, "cash_from_operations": 6893000000, "net_income": 3492000000, "ebitda": null, "year_low_stock_price": 24.01, "year_high_stock_price": 56.92, "seekingalpha_follower_count": 31026, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TFC.png"}