{"symbol": "THR", "name": "Thermon Group Holdings", "next_earnings_utc": 1591869600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 87966000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.1675, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "thermon.com", "year_founded": null, "street_address": "7171 Southwest Parkway", "city": "Austin", "state": "TX", "zipcode": "78735", "country": "United States", "phone_number": "512 690 0600", "short_description": "Thermon Group Holdings, Inc. provides engineered industrial process heating solutions for process industries in the United States, Latin America, Canada, Europe, the Middle East, Africa, and the Asia-Pacific.", "long_description": "Thermon Group Holdings, Inc. provides engineered industrial process heating solutions for process industries in the United States, Latin America, Canada, Europe, the Middle East, Africa, and the Asia-Pacific. Its products include various electric heat tracing cables, steam tracing components, tubing bundles, and instrument and control products, as well as related product lines. The company offers self-regulating and power limiting heating cables that automatically increase or decrease heat output as pipe temperature changes, as well as constant wattage heating cables; mineral insulated cables for generating high temperatures that is primarily used in harsh environments; skin effect trace heater; and heat traced tube bundles for environmental gas sampling systems. It also provides heat transfer compounds and steam tracers for comprehensive steam tracing solutions; control and monitoring systems for electric tracing of pipes, tanks, hoppers, and instrument sampling systems; and turnkey solutions that provide customers with solutions for heat tracing, including design, optimization, installation, and ongoing maintenance. In addition, the company offers explosion-proof gas catalytic heaters, convection heaters designed for rugged industrial applications, electric heaters engineered for industrial processes and environments, advanced gas and liquid filtration systems, and heat transfer systems for rail track and switch equipment. Further, it provides heating, sensing, monitoring, and controlling tools; and equipment for temporary electric power distribution and lighting products used in energy infrastructure construction projects and maintenance/turnaround projects. The company offers its solutions to the oil and gas, chemical processing, and power generation markets through a network of sales and service professionals, and distributors. Thermon Group Holdings, Inc. is headquartered in Austin, Texas.", "industry_name": "Electrical Equipment", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 527143728, "total_enterprise": 683154728, "number_of_employees": 1465, "outstanding_shares": 32884824, "eps": 0.663043, "diluted_eps": 0.65988, "earnings_from_cont_operations": 21653000, "gross_profit": 171023000, "cash": 37054000, "total_debt": 193065000, "total_revenue": 409345000, "cash_from_operations": 65736000, "net_income": 21674000, "ebitda": 71547000, "year_low_stock_price": 12.62, "year_high_stock_price": 27.73, "seekingalpha_follower_count": 521, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/THR.png"}