{"symbol": "TISI", "name": "Team", "next_earnings_utc": 1592514900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 255044500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.385, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 2, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "teaminc.com", "year_founded": 1973, "street_address": "13131 Dairy Ashford", "city": "Sugar Land", "state": "TX", "zipcode": "77478", "country": "United States", "phone_number": "281 331 6154", "short_description": "Team, Inc. provides asset performance assurance and optimization solutions in the United States, Canada, Europe, and internationally.", "long_description": "Team, Inc. provides asset performance assurance and optimization solutions in the United States, Canada, Europe, and internationally. It operates through three segments: Inspection and Heat Treating (IHT), Mechanical Services (MS), and Quest Integrity. The IHT segment offers non-destructive evaluation and testing, radiographic testing, ultrasonic testing, magnetic particle inspection, liquid penetrant inspection, positive material identification, electromagnetic testing, alternating current field measurement, and eddy current testing services. It also provides long-range guided ultrasonic testing, phased array ultrasonic testing, tank inspection and management program, rope access, mechanical and pipeline integrity, and field heat treating services. The MS segment offers on-stream and turnaround/project related and nested environment services, such as leak repair, fugitive emissions control, hot tapping, field machining and technical bolting, valve repair, field welding, vapor barrier plug and weld testing, and valve insertion. The Quest Integrity segment provides furnace tube inspection system, in-line inspection, pipeline integrity management, engineering and condition assessment, and digital imaging services. The company serves refining, power, renewable, nuclear, LNG, offshore oil and gas, pipeline, terminal and storage, chemical, petrochemical, pulp and paper, automotive and mining, bridge, port, construction and building, road and railway, and aerospace and defense industries. Team, Inc. was founded in 1973 and is headquartered in Sugar Land, Texas.", "industry_name": "Commercial Services and Supplies", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 165694829, "total_enterprise": 555648829, "number_of_employees": 6800, "outstanding_shares": 30627510, "eps": -1.069515, "diluted_eps": -1.07, "earnings_from_cont_operations": -32417000, "gross_profit": 327744000, "cash": 12175000, "total_debt": 402129000, "total_revenue": 1163314000, "cash_from_operations": 58836000, "net_income": -32417000, "ebitda": 48391000, "year_low_stock_price": 3.75, "year_high_stock_price": 19.0, "seekingalpha_follower_count": 1483, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TISI.png"}