{"symbol": "TMO", "name": "Thermo Fisher Scientific", "next_earnings_utc": 1595412000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5778415860.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 2.52294, "eps_up_revisions": 0, "eps_down_revisions": 18, "revenue_up_revisions": 0, "revenue_down_revisions": 16, "total_analysts": 19, "analysts_sell": 0, "analysts_buy": 12, "analysts_outperform": 1, "analysts_hold": 5, "analysts_underperform": 1, "webpage": "thermofisher.com", "year_founded": 1956, "street_address": "168 Third Avenue", "city": "Waltham", "state": "MA", "zipcode": "02451", "country": "United States", "phone_number": "781-622-1000", "short_description": "Thermo Fisher Scientific Inc. provides analytical and other instruments, laboratory equipment, software, consumables, reagents, instrument systems, chemicals, supplies, and services worldwide.", "long_description": "Thermo Fisher Scientific Inc. provides analytical and other instruments, laboratory equipment, software, consumables, reagents, instrument systems, chemicals, supplies, and services worldwide. The company's Life Sciences Solutions segment offers reagents, instruments, and consumables for biological and medical research, discovery and production of new drugs and vaccines, and diagnosis of diseases to pharmaceutical, biotechnology, agricultural, clinical, academic, and government markets. Its Analytical Instruments segment provides instruments, consumables, software, and services for use in laboratory, on production line, and in field for pharmaceutical, biotechnology, academic, government, environmental, and research and industrial markets, as well as clinical laboratories. The company's Specialty Diagnostics segment offers liquid, ready-to-use, and lyophilized immunodiagnostic reagent kits, as well as calibrators, controls, and calibration verification fluids; blood-test systems and antibody tests; dehydrated and prepared culture media, collection and transport systems, instrumentation, and consumables; cancer diagnosis and medical research products; human leukocyte antigen typing and testing for organ transplant market; and healthcare products. Its Laboratory Products and Services segment provides laboratory refrigerators and freezers, and ultralow-temperature freezers and cryopreservation storage tanks; temperature control, sample preparation and preservation, centrifugation, and biological safety cabinet products; water analysis instruments; laboratory plastics and chemicals; and pharma services. It has collaboration with WuXi Diagnostics and Mayo Clinic to develop antibodies tests. The company was incorporated in 1956 and is headquartered in Waltham, Massachusetts.", "industry_name": "Life Sciences Tools and Services", "sector_name": "Health Care", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 137912976005, "total_enterprise": 154930976005, "number_of_employees": 75000, "outstanding_shares": 394951104, "eps": 9.18973, "diluted_eps": 9.122311, "earnings_from_cont_operations": 3669000000, "gross_profit": 11373000000, "cash": 2981000000, "total_debt": 19999000000, "total_revenue": 25647000000, "cash_from_operations": 4680000000, "net_income": 3669000000, "ebitda": 6561000000, "year_low_stock_price": 250.21, "year_high_stock_price": 351.86, "seekingalpha_follower_count": 30738, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TMO.png"}