{"symbol": "TRV", "name": "The Travelers Companies", "next_earnings_utc": 1595328900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 7136087500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.3232, "eps_up_revisions": 2, "eps_down_revisions": 17, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 21, "analysts_sell": 2, "analysts_buy": 4, "analysts_outperform": 1, "analysts_hold": 11, "analysts_underperform": 3, "webpage": "travelers.com", "year_founded": 1853, "street_address": "485 Lexington Avenue", "city": "New York", "state": "NY", "zipcode": "10017", "country": "United States", "phone_number": "917-778-6000", "short_description": "The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United states and internationally.", "long_description": "The Travelers Companies, Inc., through its subsidiaries, provides a range of commercial and personal property, and casualty insurance products and services to businesses, government units, associations, and individuals in the United states and internationally. The company operates through three segments: Business Insurance, Bond & Specialty Insurance, and Personal Insurance. The Business Insurance segment offers workers' compensation, commercial automobile and property, general liability, commercial multi-peril, employers' liability, public and product liability, professional indemnity, marine, aviation, onshore and offshore energy, construction, terrorism, personal accident, and kidnap and ransom insurance products. This segment operates through select accounts, which serve small businesses; commercial accounts that serve mid-sized businesses; national accounts, which serve large companies; and national property and other that serve large and mid-sized customers, commercial transportation industry, and agricultural businesses, as well as markets and distributes its products through brokers, wholesale agents, program managers, and specialized retail agents. The Bond & Specialty Insurance segment provides surety, fidelity, management and professional liability, and other property and casualty insurance products through independent agencies and brokers. The Personal Insurance segment offers property and casualty insurance covering personal risks, primarily automobile and homeowners insurance to individuals through independent agencies and brokers. The Travelers Companies, Inc. was founded in 1853 and is based in New York, New York.", "industry_name": "Insurance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 27048377414, "total_enterprise": 33429377414, "number_of_employees": 30800, "outstanding_shares": 252835833, "eps": 9.333979, "diluted_eps": 9.253142, "earnings_from_cont_operations": 2426000000, "gross_profit": 7676000000, "cash": 4577000000, "total_debt": 6925000000, "total_revenue": 31818000000, "cash_from_operations": 5194000000, "net_income": 2426000000, "ebitda": 3986000000, "year_low_stock_price": 76.99, "year_high_stock_price": 155.09, "seekingalpha_follower_count": 24345, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TRV.png"}