{"symbol": "TSC", "name": "TriState Capital Holdings", "next_earnings_utc": 1595276100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 48964000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.26167, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 2, "revenue_down_revisions": 2, "total_analysts": 6, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "tristatecapitalbank.com", "year_founded": 2006, "street_address": "One Oxford Centre", "city": "Pittsburgh", "state": "PA", "zipcode": "15219", "country": "United States", "phone_number": "412-304-0304", "short_description": "TriState Capital Holdings, Inc. operates as the bank holding company for TriState Capital Bank that provides various commercial and private banking services to middle-market businesses and high-net-worth individuals in the United States.", "long_description": "TriState Capital Holdings, Inc. operates as the bank holding company for TriState Capital Bank that provides various commercial and private banking services to middle-market businesses and high-net-worth individuals in the United States. It operates in two segments, Bank and Investment Management. The company’s deposit products include checking accounts, money market deposit accounts, and certificates of deposit, as well as promontory’s certificate of deposit account registry services and insured cash sweep services. It also provides loans that are secured by cash, marketable securities, cash value life insurance, residential property, or other financial assets, as well as commercial and industrial loans, commercial real estate loans, personal loans, asset-based loans, acquisition financing, and letters of credit. In addition, the company offers liquidity and treasury management services, such as online balance reporting, online bill payment, remote deposit, liquidity, wire and ACH, foreign exchange, and controlled disbursement services; and equity and fixed income advisory and sub-advisory services to third party mutual funds and series trust mutual funds, as well as separately managed accounts primarily comprising ultra-high-net-worth and institutional clients that include corporations, ERISA plans, Taft-Hartley funds, municipalities, endowments, and foundations. Further, it provides cash management services; and capital market services, which comprise interest rate swaps and investment management products, as well as engages in wholesaling and marketing the investment products and services. The company offers its products and services through its main office located in Pittsburgh, Pennsylvania, as well as through its four additional representative offices in Cleveland, Ohio; Philadelphia, Pennsylvania; Edison, New Jersey; and New York, New York. TriState Capital Holdings, Inc. was incorporated in 2006 and is headquartered in Pittsburgh, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 446127584, "total_enterprise": null, "number_of_employees": 276, "outstanding_shares": 29841310, "eps": 1.842023, "diluted_eps": 1.790119, "earnings_from_cont_operations": 58524000, "gross_profit": 182234000, "cash": 1168087000, "total_debt": 521117000, "total_revenue": 182234000, "cash_from_operations": 76630000, "net_income": 58524000, "ebitda": null, "year_low_stock_price": 7.59, "year_high_stock_price": 26.43, "seekingalpha_follower_count": 606, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TSC.png"}