{"symbol": "TWER", "name": "Towerstream", "next_earnings_utc": 1591647300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "towerstream.com", "year_founded": 1999, "street_address": "Tech 3 Building", "city": "Middletown", "state": "RI", "zipcode": "02842", "country": "United States", "phone_number": "401-848-5848", "short_description": "Towerstream Corporation, together with its subsidiaries, provides fixed wireless broadband services over a wireless network transmitting over regulated and unregulated radio spectrum to commercial customers in the United States.", "long_description": "Towerstream Corporation, together with its subsidiaries, provides fixed wireless broadband services over a wireless network transmitting over regulated and unregulated radio spectrum to commercial customers in the United States. Its wireless broadband service supports bandwidth on demand, wireless redundancy, virtual private networks, disaster recovery, bundled data, and video services. The company also offers business class Internet services, such as single tenant service that delivers fixed wireless broadband to a single client through a radio receiver/transmitter on the client’s building dedicated solely to that client; and on-net services to connect building at once and at a cost similar for one high bandwidth customer requiring point-to-point equipment. In addition, it provides temporary Internet solutions to provide solutions for a client’s short-term connection requirements in locations where fiber, copper, and cable infrastructure does not exist or is cost prohibitive. Further, the company offers wholesale Internet services to deliver dedicated Internet access and point-to-point transport solutions with bandwidth options from 5Mbps to 10mbps through fixed wireless network. It serves business customers in New York City, Boston, Chicago, Los Angeles, San Francisco, Seattle, Miami, Dallas-Fort Worth, Houston, Philadelphia, Las Vegas-Reno, and Providence-Newport. The company offers its services through direct sales force. Towerstream Corporation was founded in 1999 and is headquartered in Middletown, Rhode Island.", "industry_name": "Diversified Telecommunication Services", "sector_name": "Communication Services", "is_defunct": false, "exchange": "Pink No Info", "equity_type": "stocks", "market_cap": 264196, "total_enterprise": 35428157, "number_of_employees": 46, "outstanding_shares": 550409, "eps": -25.887981, "diluted_eps": -25.887981, "earnings_from_cont_operations": -10210453, "gross_profit": 18891541, "cash": 4173070, "total_debt": null, "total_revenue": null, "cash_from_operations": -1786661, "net_income": null, "ebitda": null, "year_low_stock_price": 0.2, "year_high_stock_price": 1.1, "seekingalpha_follower_count": 84, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/TWER.png"}