{"symbol": "UMPQ", "name": "Umpqua Holdings", "next_earnings_utc": 1595448900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 300306250.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.20039, "eps_up_revisions": 0, "eps_down_revisions": 7, "revenue_up_revisions": 4, "revenue_down_revisions": 4, "total_analysts": 8, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 1, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "umpquabank.com", "year_founded": 1953, "street_address": "One SW Columbia Street", "city": "Portland", "state": "OR", "zipcode": "97258", "country": "United States", "phone_number": "503-727-4100", "short_description": "Umpqua Holdings Corporation operates as the holding company of Umpqua Bank that provides commercial and retail banking, and retail brokerage services.", "long_description": "Umpqua Holdings Corporation operates as the holding company of Umpqua Bank that provides commercial and retail banking, and retail brokerage services. It operates through four segments: Wholesale Bank, Wealth Management, Retail Bank, and Home Lending. The company offers deposit products, including non-interest bearing checking, interest bearing checking and savings, and money market accounts, as well as certificates of deposit. It also provides loans for corporate and commercial customers, such as accounts receivable and inventory financing, multi-family and equipment loans, commercial equipment leases, international trade, real estate construction loans, permanent financing products, and small business administration program financing, as well as capital markets and treasury management services. In addition, the company offers loan products for small businesses; commercial and industrial loans; residential real estate loans for the construction, purchase, and refinancing of residential owner-occupied and rental properties; and consumer loans comprising secured and unsecured personal loans, home equity and personal lines of credit, and motor vehicle loans. Further, it provides financial planning, trust, and investment services; treasury and cash management services; retail brokerage and investment advisory services; digital, mobile, telephone, text, and online banking services; and e-commerce services. The company serves middle market corporate, commercial, and business banking customers; individual investors; and high net worth individuals. As of December 31, 2019, it conducted commercial and retail banking activities at 274 locations in Oregon, Washington, California, Idaho, and Nevada. The company was founded in 1953 and is headquartered in Portland, Oregon.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2508252654, "total_enterprise": null, "number_of_employees": 3943, "outstanding_shares": 220215334, "eps": -7.135153, "diluted_eps": -7.14475, "earnings_from_cont_operations": -1571885000, "gross_profit": 1059297000, "cash": 1903767000, "total_debt": 1985584000, "total_revenue": 1059297000, "cash_from_operations": -145583000, "net_income": -1571885000, "ebitda": null, "year_low_stock_price": 8.88, "year_high_stock_price": 18.94, "seekingalpha_follower_count": 2858, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UMPQ.png"}