{"symbol": "UNB", "name": "Union Bankshares", "next_earnings_utc": 1594821600, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "ublocal.com", "year_founded": 1891, "street_address": "20 Lower Main Street", "city": "Morrisville", "state": "VT", "zipcode": "05661", "country": "United States", "phone_number": "802-888-6600", "short_description": "Union Bankshares, Inc. operates as the bank holding company for Union Bank that provides retail, commercial, and municipal banking services in northern Vermont and New Hampshire.", "long_description": "Union Bankshares, Inc. operates as the bank holding company for Union Bank that provides retail, commercial, and municipal banking services in northern Vermont and New Hampshire. It offers retail depository services, such as personal checking, savings, money market, IRA/SEP/KEOGH, and health savings accounts, as well as certificates of deposit. The company also provides and commercial real estate loans; consumer loans; and municipal loans; commercial loans for plant and equipment, working capital, real estate renovation, and other business purposes to business owners and investors; and residential real estate loans. In addition, it offers small business administration guaranteed, and residential construction and mortgage loans; online cash management services, including account reconciliation, credit card depository, automated clearing house origination, wire transfers, and night depository services; merchant credit card services; remote deposit capture services; and online mortgage application services. Further, the company provides business checking accounts; standby letters of credit, bank checks or money orders, and safe deposit boxes; ATM services and cards; debit cards; and telephone, Internet, and mobile banking services; home improvement loans and overdraft checking facility against preauthorized lines of credit; customer repurchase agreement sweeps; and asset management, fiduciary, and trust services. The company offers retail banking services to individuals; and commercial banking services to small and medium sized corporations, partnerships, and sole proprietorships, as well as nonprofit organizations, local municipalities, and school districts. The company operates 18 banking offices, 2 loan centers, and various ATMs. Union Bankshares, Inc. was founded in 1891 and is headquartered in Morrisville, Vermont.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 87675621, "total_enterprise": null, "number_of_employees": 201, "outstanding_shares": 4473246, "eps": 2.28717, "diluted_eps": 2.28717, "earnings_from_cont_operations": 10223000, "gross_profit": 40111000, "cash": 47779000, "total_debt": 62164000, "total_revenue": 40111000, "cash_from_operations": 3798000, "net_income": 10223000, "ebitda": null, "year_low_stock_price": 16.5, "year_high_stock_price": 38.79, "seekingalpha_follower_count": 529, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UNB.png"}