{"symbol": "UNF", "name": "UniFirst", "next_earnings_utc": 1593604800, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 382483750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.23667, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 4, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "unifirst.com", "year_founded": 1936, "street_address": "68 Jonspin Road", "city": "Wilmington", "state": "MA", "zipcode": "01887", "country": "United States", "phone_number": "978-658-8888", "short_description": "UniFirst Corporation provides workplace uniforms and protective work wear clothing in the United States, Europe, and Canada.", "long_description": "UniFirst Corporation provides workplace uniforms and protective work wear clothing in the United States, Europe, and Canada. The company operates through U.S. Rental and Cleaning, Canadian Rental and Cleaning, Manufacturing, Specialty Garments Rental and Cleaning, and First Aid segments. It designs, manufactures, personalizes, rents, cleans, delivers, and sells a range of uniforms and protective clothing, including shirts, pants, jackets, coveralls, lab coats, smocks, and aprons; and specialized protective wear, such as flame resistant and high visibility garments. The company also rents and sells industrial wiping products, floor mats, facility service products, and dry and wet mops; restroom and cleaning supplies comprising air fresheners, paper products, and hand soaps; and other textile products. In addition, it provides first aid cabinet services and other safety supplies; decontaminates and cleans work clothes, and other items that is exposed to radioactive materials; and services special cleanroom protective wear and facilities. Further, it offers a range of garment service options, including full-service rental programs in which garments are cleaned and serviced; lease programs in which garments are cleaned and maintained by individual employees; and purchase programs to buy garments and related items directly. The company serves automobile service centers and dealers, delivery services, food and general merchandise retailers, food processors and service operations, light manufacturers, maintenance facilities, restaurants, service companies, soft and durable goods wholesalers, transportation companies, government agencies, research and development laboratories, high technology companies, and utilities operating nuclear reactors, as well as others who require employee clothing for image, identification, protection, or utility purposes. UniFirst Corporation was founded in 1936 and is based in Wilmington, Massachusetts.", "industry_name": "Commercial Services and Supplies", "sector_name": "Industrials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3197019588, "total_enterprise": 2846427588, "number_of_employees": 14000, "outstanding_shares": 18890449, "eps": 9.278057, "diluted_eps": 9.211606, "earnings_from_cont_operations": 176130000, "gross_profit": 692127000, "cash": 395323000, "total_debt": 44731000, "total_revenue": 1863339000, "cash_from_operations": 290351000, "net_income": 176130000, "ebitda": 326746000, "year_low_stock_price": 121.89, "year_high_stock_price": 217.9, "seekingalpha_follower_count": 1184, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UNF.png"}