{"symbol": "UNFI", "name": "United Natural Foods, Inc.", "next_earnings_utc": 1591070400, "next_earnings_period_start_date_utc": 1588204800, "next_earnings_period_end_date_utc": 1596153600, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 6605732000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.89333, "eps_up_revisions": 6, "eps_down_revisions": 0, "revenue_up_revisions": 5, "revenue_down_revisions": 0, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 10, "analysts_underperform": 0, "webpage": "unfi.com", "year_founded": 1976, "street_address": "313 Iron Horse Way", "city": "Providence", "state": "RI", "zipcode": "02908", "country": "United States", "phone_number": "401-528-8634", "short_description": "United Natural Foods, Inc., together with its subsidiaries, distributes natural, organic, specialty, produce, and conventional grocery and non-food products in the United States and Canada.", "long_description": "United Natural Foods, Inc., together with its subsidiaries, distributes natural, organic, specialty, produce, and conventional grocery and non-food products in the United States and Canada. It operates through Wholesale and Other segments. The company offers grocery and general merchandise, produce, perishables and frozen foods, nutritional supplements and sports nutrition, bulk and foodservice products, and personal care items. It also distributes an array of specialty protein, cheese, deli, food service, and bakery goods; and organic and conventional produce and non-produce perishable items, and natural and organic specialty and gourmet ethnic products, as well as vitamins, minerals, and supplements. In addition, the company is involved in importing, roasting, packaging, and distributing nuts, dried fruits, seeds, trail mixes, granola, natural and organic snack items, and confections; sale of natural foods and related products to the general public through retail storefronts; and marketing various products on behalf of food vendors. Further, it offers Blue Marble Brands products on wholesale basis through third-party distributors in organic, natural, and specialty food brands, as well as directly to retailers; and Field Day brand products primarily to customers through its independent channel. The company serves supermarket, supernatural, and independent customers, as well as foodservice, e-commerce, and international customers. United Natural Foods, Inc. was founded in 1976 and is headquartered in Providence, Rhode Island.", "industry_name": "Food and Staples Retailing", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1050909958, "total_enterprise": 5200278958, "number_of_employees": 19000, "outstanding_shares": 53617855, "eps": -5.594545, "diluted_eps": -5.594545, "earnings_from_cont_operations": -388322000, "gross_profit": 2404385000, "cash": 40280000, "total_debt": 4192615000, "total_revenue": 25232275000, "cash_from_operations": 297746000, "net_income": -307700000, "ebitda": 453995000, "year_low_stock_price": 5.0, "year_high_stock_price": 23.38, "seekingalpha_follower_count": 7922, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UNFI.png"}