{"symbol": "USB", "name": "U.S. Bancorp", "next_earnings_utc": 1594809900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 5482076750.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.56406, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 1, "revenue_down_revisions": 9, "total_analysts": 26, "analysts_sell": 2, "analysts_buy": 4, "analysts_outperform": 4, "analysts_hold": 13, "analysts_underperform": 3, "webpage": "usbank.com", "year_founded": 1863, "street_address": "800 Nicollet Mall", "city": "Minneapolis", "state": "MN", "zipcode": "55402", "country": "United States", "phone_number": "651-466-3000", "short_description": "U.S. Bancorp, a financial services holding company, provides various financial services in the United States.", "long_description": "U.S. Bancorp, a financial services holding company, provides various financial services in the United States. It operates in five segments: Corporate and Commercial Banking, Consumer and Business Banking, Wealth Management and Investment Services, Payment Services, and Treasury and Corporate Support. The company offers depository services, including checking accounts, savings accounts, and time certificate contracts; lending services, such as traditional credit products; and credit card services, lease financing and import/export trade, asset-backed lending, agricultural finance, and other products, as well as home equity, auto, boat, RV, personal loans, and personal line of credit. It also provides ancillary services comprising capital markets, treasury management, and receivable lock-box collection services to corporate customers; and a range of asset management and fiduciary services for individuals, estates, foundations, business corporations, and charitable organizations. In addition, the company offers investment and insurance products to its customers principally within its markets, as well as fund administration services to a range of mutual and other funds. Further, it provides corporate and purchasing card, and corporate trust services; and merchant processing services, as well as cash and investment management, ATM processing, mortgage banking, and brokerage and leasing services. The company offers its products and services through operating a network of 2,795 banking offices principally operating in the Midwest and West regions of the United States, as well as through online services and over mobile devices. It also operates a network of 4,459 ATMs. The company has a strategic alliance with State Farm Bank. The company was founded in 1863 and is headquartered in Minneapolis, Minnesota.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 53563640253, "total_enterprise": null, "number_of_employees": 69651, "outstanding_shares": 1506289096, "eps": 3.883333, "diluted_eps": 3.883333, "earnings_from_cont_operations": 6417000000, "gross_profit": 20732000000, "cash": 51102000000, "total_debt": 80351000000, "total_revenue": 20732000000, "cash_from_operations": 5947000000, "net_income": 6386000000, "ebitda": null, "year_low_stock_price": 28.36, "year_high_stock_price": 61.11, "seekingalpha_follower_count": 39775, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/USB.png"}