{"symbol": "UVSP", "name": "Univest Financial", "next_earnings_utc": 1595448900, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 60413000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.32333, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 1, "revenue_down_revisions": 1, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "univest.net", "year_founded": 1876, "street_address": "Univest Plaza", "city": "Souderton", "state": "PA", "zipcode": "18964", "country": "United States", "phone_number": "215-721-2400", "short_description": "Univest Financial Corporation operates as the holding company for Univest Bank and Trust Co. that provides banking products and services primarily in Pennsylvania.", "long_description": "Univest Financial Corporation operates as the holding company for Univest Bank and Trust Co. that provides banking products and services primarily in Pennsylvania. It operates through three segments: Banking, Wealth Management, and Insurance. The Banking segment provides a range of banking services, such as deposit making, loan origination and servicing, mortgage banking, other general banking services, and equipment lease financing for individuals, businesses, municipalities, and nonprofit organizations. The Wealth Management segment offers trust and investment advisory services, guardian and custodian services, and other trust and brokerage services, as well as manages private investment accounts for individuals and institutions. The Insurance segment includes a full-service insurance brokerage agency offering commercial property and casualty insurance, group life and health coverage, employee benefit solutions, personal insurance lines, and human resources consulting services. The company also offers investment consulting and management, fiduciary, financial and retirement planning, investment management services. It serves customers in Bucks, Berks, Chester, Delaware, Lancaster, Lehigh, Montgomery, Northampton, and Philadelphia counties in Pennsylvania; and Atlantic and Cape May counties in New Jersey through 55 banking offices. The company was formerly known as Univest Corporation of Pennsylvania and changed its name to Univest Financial Corporation in January 2019. Univest Financial Corporation was founded in 1876 and is headquartered in Souderton, Pennsylvania.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 479839096, "total_enterprise": null, "number_of_employees": 873, "outstanding_shares": 29187293, "eps": 1.722666, "diluted_eps": 1.720362, "earnings_from_cont_operations": 50478000, "gross_profit": 210804000, "cash": 185813000, "total_debt": 363994000, "total_revenue": 210804000, "cash_from_operations": 67145000, "net_income": 50478000, "ebitda": null, "year_low_stock_price": 13.2, "year_high_stock_price": 27.8, "seekingalpha_follower_count": 508, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UVSP.png"}