{"symbol": "UVV", "name": "Universal Corporation", "next_earnings_utc": 1590611400, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "universalcorp.com", "year_founded": 1886, "street_address": "9201 Forest Hill Avenue", "city": "Richmond", "state": "VA", "zipcode": "23235", "country": "United States", "phone_number": "804-359-9311", "short_description": "Universal Corporation engages in the supply of leaf tobacco products worldwide.", "long_description": "Universal Corporation engages in the supply of leaf tobacco products worldwide. The company operates through North America, South America, Africa, Europe, Asia, Dark Air-Cured, Oriental, and Special Services segments. It is involved in procuring, financing, processing, packing, storing, and shipping leaf tobacco for sale to manufacturers of consumer tobacco products. The company contracts, purchases, processes, and sells flue-cured, burley, and oriental tobaccos that are primarily used in the manufacture of cigarettes; and dark air-cured tobaccos principally used in the manufacture of cigars, natural wrapped cigars and cigarillos, smokeless, and pipe tobacco products. It also provides value-added services, including blending, chemical, and physical testing of tobacco; service cutting for various manufacturers; manufacturing reconstituted leaf tobacco; just-in-time inventory management services; electronic nicotine delivery systems; e-liquid testing services; and smoke testing services for customers. In addition, the company offers testing services for crop protection agents and tobacco constituents in seed, leaf, and finished products, including e-cigarette liquids and vapors; and analytical services that include chemical compound testing in finished tobacco products and mainstream smoke, as well as engages in the research and development growth trials with various partners for non-tobacco agriproducts production, such as vanilla. Further, it produces and sells dehydrated and juiced fruit and vegetable products, as well as provides water pipe style leaf tobacco; and recycles waste materials from tobacco production. The company was founded in 1886 and is headquartered in Richmond, Virginia.", "industry_name": "Tobacco", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1056387512, "total_enterprise": 1544195512, "number_of_employees": 28000, "outstanding_shares": 24670423, "eps": 3.488137, "diluted_eps": 3.472254, "earnings_from_cont_operations": 93652000, "gross_profit": 375127000, "cash": 64734000, "total_debt": 509127000, "total_revenue": 1949608000, "cash_from_operations": 88937000, "net_income": 87476000, "ebitda": 194219000, "year_low_stock_price": 37.04, "year_high_stock_price": 63.18, "stocktwits_watchlist_count": 495, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/UVV.png"}