{"symbol": "VCSY", "name": "Vertical Computer Systems", "next_earnings_utc": 1593007200, "next_earnings_period_start_date_utc": null, "next_earnings_period_end_date_utc": null, "next_earnings_has_time": true, "next_earnings_name": "None QNone", "next_earnings_year": null, "next_earnings_quarter": null, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": null, "eps_up_revisions": null, "eps_down_revisions": null, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 0, "analysts_sell": null, "analysts_buy": null, "analysts_outperform": null, "analysts_hold": null, "analysts_underperform": null, "webpage": "vcsy.com", "year_founded": null, "street_address": "101 West Renner Road", "city": "Richardson", "state": "TX", "zipcode": "75082", "country": "United States", "phone_number": "972- 437-5200", "short_description": "Vertical Computer Systems, Inc., together with its subsidiaries, provides application software, cloud-based and software services, Internet core technologies, and intellectual property assets primarily in the United States, Canada, and Brazil.", "long_description": "Vertical Computer Systems, Inc., together with its subsidiaries, provides application software, cloud-based and software services, Internet core technologies, and intellectual property assets primarily in the United States, Canada, and Brazil. The company offers emPath, a Web-based software to handle payroll and human resources; PTS, a time and attendance software; SnAPPnet, a physician credentialing application; and SiteFlash platform, which publishes content on the Web that enables the user to build and operate Websites with the ability to separate form, function, and content. It also provides Emily scripting language, a markup language executive that is used to create Web-based applications, which communicate through XML and HTTP; and Ploinks and Ploinks SPC, a personal secure communication application that provides users the ability to shift their personal data and communications from cloud service providers to their own personal server located on their mobile device, as well as to backup data on their personal computer using the Puddle, a storage and backup service to Ploinks. In addition, the company offers cloud-based services to develop, operate, and host the application in data centers; and software services comprising professional, maintenance, custom maintenance, and managed services. It serves human resources and payroll, software development, time and attendance, healthcare credentialing, and personal secure communication channel markets. The company was formerly known as Externet World Inc. and changed its name to Vertical Computer Systems, Inc. in November 1999. Vertical Computer Systems, Inc. is headquartered in Richardson, Texas.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "Pink No Info", "equity_type": "stocks", "market_cap": 11675452, "total_enterprise": null, "number_of_employees": 24, "outstanding_shares": 1207545201, "eps": -0.003355, "diluted_eps": -0.003355, "earnings_from_cont_operations": -3474158, "gross_profit": 2432140, "cash": 224369, "total_debt": null, "total_revenue": null, "cash_from_operations": -793784, "net_income": null, "ebitda": null, "year_low_stock_price": 0.0023, "year_high_stock_price": 0.0155, "seekingalpha_follower_count": 347, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VCSY.png"}