{"symbol": "VIPS", "name": "Vipshop Holdings Limited", "next_earnings_utc": 1590570000, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 2515982709.424821, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.1057996732578446, "eps_up_revisions": 0, "eps_down_revisions": 4, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 24, "analysts_sell": 1, "analysts_buy": 13, "analysts_outperform": 6, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "vip.com", "year_founded": 2008, "street_address": "No. 20 Huahai Street", "city": "Guangzhou", "state": null, "zipcode": "510370", "country": "China", "phone_number": "86 20 2233 0000", "short_description": "Vipshop Holdings Limited operates as an online discount retailer for various brands in the People's Republic of China.", "long_description": "Vipshop Holdings Limited operates as an online discount retailer for various brands in the People's Republic of China. It operates through four segments, Vip.com, Shan Shan Outlets, Internet Finance, and Others. The company offers women's apparel, such as casual wear, jeans, dresses, outerwear, swimsuits, lingerie, pajamas, and maternity clothes; men's apparel comprising casual and smart-casual T-shirts, polo shirts, jackets, pants, and underwear; women and men casual and formal shoes; and accessories that include belts, jewelry, watches, and glasses for women and men. It also provides handbags, which comprise purses, satchels, duffel bags, and wallets; apparel, gears and accessories, furnishings and decor, toys, and games for boys, girls, infants, and toddlers; sportswear, sports gear, and footwear for tennis, badminton, soccer, swimming, and other sporting activities; and consumer electronic products, including computers, cell phones, digital cameras, and home appliances. In addition, the company offers skin care and cosmetic products, such as cleansers, lotions, face and body creams, face masks, sunscreens, foundations, lipsticks, eye shadows, and other cosmetics; and home furnishings comprising bed and bath products, home decors, dining and tabletop items, and small household appliances. Further, it provides designer apparel, footwear, and accessories; and snacks and health supplements, and occasion-based gifts; and Internet finance services, which comprise consumer and supplier financing, and microcredit. The company offers its branded products through its vip.com and vipshop.com online platforms, as well as through its internet website and cellular phone application. Additionally, it offers warehousing, logistics, product procurement, research and development, technology development, and consulting services. The company was founded in 2008 and is headquartered in Guangzhou, the People's Republic of China.", "industry_name": "Internet and Direct Marketing Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 10153540641, "total_enterprise": 9246318076, "number_of_employees": 20442, "outstanding_shares": 672419910, "eps": 0.864099441324735, "diluted_eps": 0.849773801146074, "earnings_from_cont_operations": 572524810, "gross_profit": 2970059602, "cash": 1382546640, "total_debt": 414639446, "total_revenue": 13355702078, "cash_from_operations": 1765095434, "net_income": 576890663, "ebitda": 925717445, "year_low_stock_price": 6.17, "year_high_stock_price": 18.95, "stocktwits_watchlist_count": 6082, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VIPS.png"}