{"symbol": "VRA", "name": "Vera Bradley", "next_earnings_utc": 1591185600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 80232600.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.266, "eps_up_revisions": 0, "eps_down_revisions": 3, "revenue_up_revisions": 0, "revenue_down_revisions": 3, "total_analysts": 5, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 0, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "verabradley.com", "year_founded": 1982, "street_address": "12420 Stonebridge Road", "city": "Roanoke", "state": "IN", "zipcode": "46783", "country": "United States", "phone_number": "877 708 8372", "short_description": "Vera Bradley, Inc., together with its subsidiaries, designs, manufactures, and sells women's handbags, luggage and travel items, fashion and home accessories, and gifts.", "long_description": "Vera Bradley, Inc., together with its subsidiaries, designs, manufactures, and sells women's handbags, luggage and travel items, fashion and home accessories, and gifts. It operates through three segments: Vera Bradley Direct, Vera Bradley Indirect, and Pura Vida. The company offers bag products, such as totes, crossbodies, satchels, clutches, backpacks, baby bags, and lunch bags; accessories, including wallets, wristlets, eyeglass cases, scarves, and various technology accessories; bracelets, rings, and necklaces under Pura Vida brand name; and travel products consisting of rolling luggage, cosmetics, and travel and packing accessories, as well as travel bags comprising duffel and weekend bags. It also provides home products that include throw blankets, beach towels, and comforters, as well as items, such as mugs and tumblers; and other products, including apparel/footwear, stationery, and merchandising products, as well as freight, licensing, and gift card breakage services. The company sells its Vera Bradley branded products through its full-line and factory outlet stores in the United States; and verabradley.com, an online outlet site, as well as its annual outlet sale in Fort Wayne, Indiana. As of February 1, 2020, it operated 88 full-line and 63 factory outlet stores. The company sells its Pura Vida branded products through wholesale retailers, as well as through Pura Vida websites, including www.puravidabracelets.com and www.puravidabracelets.eu. It also sells its Vera Bradley branded products to approximately 2,200 specialty retail locations, department stores, national accounts, third party e-commerce sites, and third-party inventory liquidators, as well as through licensing agreements. Vera Bradley, Inc. was founded in 1982 and is headquartered in Roanoke, Indiana.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 174846819, "total_enterprise": 281123819, "number_of_employees": 2700, "outstanding_shares": 33304156, "eps": 0.472206, "diluted_eps": 0.47, "earnings_from_cont_operations": 15244000, "gross_profit": 280075000, "cash": 58894000, "total_debt": 135122000, "total_revenue": 495212000, "cash_from_operations": 20624000, "net_income": 16047000, "ebitda": 55705000, "year_low_stock_price": 3.12, "year_high_stock_price": 12.75, "seekingalpha_follower_count": 3135, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VRA.png"}