{"symbol": "VRNT", "name": "Verint Systems", "next_earnings_utc": 1593547500, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 324842500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.68038, "eps_up_revisions": 0, "eps_down_revisions": 6, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 8, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 4, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "verint.com", "year_founded": 1994, "street_address": "175 Broadhollow Road", "city": "Melville", "state": "NY", "zipcode": "11747", "country": "United States", "phone_number": "631 962 9600", "short_description": "Verint Systems Inc. provides actionable intelligence solutions worldwide.", "long_description": "Verint Systems Inc. provides actionable intelligence solutions worldwide. It operates through Customer Engagement and Cyber Intelligence segments. The company offers Workforce Forecasting and Scheduling for management of workforce scheduling in contact centers, back office operations, and branches; Verint Mobile Apps that delivers work-life balance ownership to employees and managers on-the-go; Knowledge Management solution for reduce training time, increase first call resolution, and improve customer satisfaction scores; Virtual Assistant, which provides automated and real-time support for the employee; Verint Real-Time Analytics that surfaces contextual guidance to an employee; Verint Robotic Process Automation solutions; and Verint Employee Desktop that unifies disparate applications on an employee's desktop. It also offers Verint Recording for capturing customer interactions across voice and digital channels; Verint Automated Quality Management products that automate the quality process from scoring evaluations to assigning coaching; Verint Performance Management, which triggers automated workflows; Verint Interaction Analytics to reduce cost by identifying operational process challenges; Verint Desktop and Process Analytics; Verint Work Manager; and Verint Performance Management solutions. In addition, the company provides Intelligent Virtual Assistant; Web Self-Service that enable customers to self-serve on the web or via their mobile devices; Communities, which enable organizations to manage online communities for their employees, customers, and partners; Verint Experience Cloud that connects siloes of customer experience data to identify problems, predict outcomes, and drive actions; Omni-Channel Recording, which captures customer interaction data; compliance recording that supports compliance audits and the avoidance of fines; and Fraud Prevention And Cyber Intelligence Solutions. The company was founded in 1994 and is headquartered in Melville, New York.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2992054854, "total_enterprise": 3579256854, "number_of_employees": 6500, "outstanding_shares": 64525660, "eps": 0.433758, "diluted_eps": 0.43, "earnings_from_cont_operations": 35683000, "gross_profit": 863852000, "cash": 399361000, "total_debt": 973494000, "total_revenue": 1303634000, "cash_from_operations": 237904000, "net_income": 28684000, "ebitda": 159098000, "year_low_stock_price": 32.44, "year_high_stock_price": 59.98, "seekingalpha_follower_count": 3562, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VRNT.png"}