{"symbol": "VSAT", "name": "Viasat, Inc.", "next_earnings_utc": 1590523500, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 586379500.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.25667, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 4, "total_analysts": 10, "analysts_sell": 0, "analysts_buy": 2, "analysts_outperform": 3, "analysts_hold": 5, "analysts_underperform": 0, "webpage": "viasat.com", "year_founded": 1986, "street_address": "6155 El Camino Real", "city": "Carlsbad", "state": "CA", "zipcode": "92009", "country": "United States", "phone_number": "760-476-2200", "short_description": "Viasat, Inc. provides broadband and communications products and services worldwide.", "long_description": "Viasat, Inc. provides broadband and communications products and services worldwide. The company’s Satellite Services segment offers satellite-based fixed broadband services, including broadband Internet access and voice over Internet protocol services to consumers and businesses; in-flight Internet and aviation software services to commercial airlines; and mobile broadband services comprising network management and high-speed Internet connectivity services for customers using airborne, maritime, and ground mobile satellite systems. As of March 31, 2019, this segment provided broadband Internet services to approximately 586,000 subscribers. Its Commercial Networks segment offers fixed satellite networks comprising satellite network infrastructure and ground terminals; mobile broadband satellite communication systems; and antenna systems for terrestrial and satellite applications, such as earth imaging, remote sensing, mobile satellite communication, Ka-band earth stations, and other multi-band antennas. This segment also provides design and technology services, including analysis, design, development, and specification of satellites and ground systems; ASIC and monolithic microwave integrated circuit design; and network function virtualization. The company’s Government Systems segment offers various mobile and fixed broadband modems, terminals, network access control systems, and antenna systems; cybersecurity and information assurance products and services; and tactical radio and information distribution systems to enable voice, and real-time collection and dissemination of secure real-time digital information between command centers, communications nodes, ground and maritime platforms, and air platforms. Viasat Inc. has a collaboration agreement with Facebook Inc. to enhance the deployment of high-speed Internet to communities. The company was founded in 1986 and is headquartered in Carlsbad, California.", "industry_name": "Communications Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2598866862, "total_enterprise": 4474911862, "number_of_employees": 5600, "outstanding_shares": 62129258, "eps": 0.011711, "diluted_eps": 0.00441, "earnings_from_cont_operations": 14278000, "gross_profit": 677945000, "cash": 47778000, "total_debt": 1904780000, "total_revenue": 2274738000, "cash_from_operations": 406252000, "net_income": 717000, "ebitda": 314969000, "year_low_stock_price": 25.1, "year_high_stock_price": 97.31, "stocktwits_watchlist_count": 597, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/VSAT.png"}