{"symbol": "WAL", "name": "Western Alliance Bancorporation", "next_earnings_utc": 1594931100, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 314971410.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.93671, "eps_up_revisions": 1, "eps_down_revisions": 9, "revenue_up_revisions": 6, "revenue_down_revisions": 1, "total_analysts": 12, "analysts_sell": 0, "analysts_buy": 8, "analysts_outperform": 3, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "westernalliancebancorporation.com", "year_founded": 1994, "street_address": "One East Washington Street", "city": "Phoenix", "state": "AZ", "zipcode": "85004", "country": "United States", "phone_number": "602-389-3500", "short_description": "Western Alliance Bancorporation operates as the holding company for Western Alliance Bank that provides various banking products and related services primarily in Arizona, California, and Nevada.", "long_description": "Western Alliance Bancorporation operates as the holding company for Western Alliance Bank that provides various banking products and related services primarily in Arizona, California, and Nevada. The company offers deposit products, including checking accounts, savings accounts, and money market accounts, as well as fixed-rate and fixed maturity certificates of deposit accounts. It also offers commercial and industrial loan products, such as working capital lines of credit, inventory and accounts receivable lines, mortgage warehouse lines, equipment loans and leases, and other commercial loans; commercial real estate loans, which are secured by multi-family residential properties, professional offices, industrial facilities, retail centers, hotels, and other commercial properties; construction and land development loans for single family and multi-family residential projects, industrial/warehouse properties, office buildings, retail centers, medical office facilities, and residential lot developments; and consumer loans. In addition, the company provides other financial services, such as Internet banking, wire transfers, electronic bill payment and presentment, lock box services, courier, and cash management services. Further, it holds certain investment securities, municipal and non-profit loans, and leases; invests primarily in low income housing tax credits and small business investment corporations; and holds certain real estate loans and related securities. As of December 31, 2018, the company operated 38 branch locations and 11 loan production offices. Western Alliance Bancorporation was founded in 1994 and is headquartered in Phoenix, Arizona.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 3810842222, "total_enterprise": null, "number_of_employees": 1835, "outstanding_shares": 99891015, "eps": 4.533146, "diluted_eps": 4.513808, "earnings_from_cont_operations": 462339000, "gross_profit": 1051750000, "cash": 420618000, "total_debt": 895189000, "total_revenue": 1051750000, "cash_from_operations": 690437000, "net_income": 462339000, "ebitda": null, "year_low_stock_price": 20.9, "year_high_stock_price": 58.94, "seekingalpha_follower_count": 4020, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WAL.png"}