{"symbol": "WBS", "name": "Webster Financial", "next_earnings_utc": 1595331000, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 304892560.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.57052, "eps_up_revisions": 0, "eps_down_revisions": 10, "revenue_up_revisions": 2, "revenue_down_revisions": 6, "total_analysts": 13, "analysts_sell": 0, "analysts_buy": 3, "analysts_outperform": 3, "analysts_hold": 7, "analysts_underperform": 0, "webpage": "websteronline.com", "year_founded": 1935, "street_address": "145 Bank Street", "city": "Waterbury", "state": "CT", "zipcode": "06702", "country": "United States", "phone_number": "203-578-2202", "short_description": "Webster Financial Corporation operates as the holding company for Webster Bank, National Association that provides a range of banking, investment, and financial services to individuals, families, and businesses in the United States.", "long_description": "Webster Financial Corporation operates as the holding company for Webster Bank, National Association that provides a range of banking, investment, and financial services to individuals, families, and businesses in the United States. It operates through three segments: Commercial Banking, HSA Bank, and Community Banking. The Commercial Banking segment provides lending, deposit, and cash management services to middle market companies; and commercial and industrial lending and leasing, commercial real estate lending, equipment financing, and asset-based lending, as well as treasury and payment services. This segment also offers asset management, financial planning and trust services, and deposit and loan products for high net worth clients, not-for-profit organizations, and business clients. The HSA Bank segment offers health savings accounts, health reimbursement accounts, flexible spending accounts, and other financial solutions to employers for the benefit of their employees and individuals. The Community Banking segment offers deposit and fee-based services, residential mortgages, home equity lines or loans, unsecured consumer loans, and credit cards to consumers, as well as investment and securities-related services, including brokerage and investment advice through a strategic partnership with LPL Financial Holdings Inc. This segment also provides credit, deposit, and cash flow management products to businesses and professional service firms. The company also offers online and mobile banking services, as well as through its Website. As of April 7, 2020, it operated 157 banking centers and 309 ATMs. Webster Financial Corporation was founded in 1935 and is headquartered in Waterbury, Connecticut.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 2551802793, "total_enterprise": null, "number_of_employees": 3298, "outstanding_shares": 90169710, "eps": 3.411264, "diluted_eps": 3.392579, "earnings_from_cont_operations": 321186000, "gross_profit": 1129258000, "cash": 623162000, "total_debt": 3784421000, "total_revenue": 1129258000, "cash_from_operations": 198928000, "net_income": 321186000, "ebitda": null, "year_low_stock_price": 18.16, "year_high_stock_price": 54.04, "seekingalpha_follower_count": 1788, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WBS.png"}