{"symbol": "WDAY", "name": "Workday, Inc.", "next_earnings_utc": 1590609600, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1003531820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.48734, "eps_up_revisions": 16, "eps_down_revisions": 8, "revenue_up_revisions": 13, "revenue_down_revisions": 8, "total_analysts": 38, "analysts_sell": 3, "analysts_buy": 11, "analysts_outperform": 7, "analysts_hold": 16, "analysts_underperform": 1, "webpage": "workday.com", "year_founded": 2005, "street_address": "6110 Stoneridge Mall Road", "city": "Pleasanton", "state": "CA", "zipcode": "94588", "country": "United States", "phone_number": "925-951-9000", "short_description": "Workday, Inc. provides enterprise cloud applications worldwide.", "long_description": "Workday, Inc. provides enterprise cloud applications worldwide. Its applications help its customers to manage critical business functions and optimize their financial and human capital resources. The company offers Workday Financial Management application that provides functions of general ledger, accounting, accounts payable and receivable, cash and asset management, revenue management, and grants management, as well as project and resource management, time and expense tracking, project billing, revenue recognition, financial reporting, and analytics. It also provides Workday Human Capital Management (HCM) application, which includes human resources management, such as workforce lifecycle and organization management, compensation, absence, and employee benefits administration; and global talent management comprising goal and performance management, succession planning, and career and development planning, as well as Skills cloud, a machine-learning-powered universal skills language to help source, utilize, develop, and retain talent. In addition, the company offers business planning, analytics, and other solutions, including Insights Business Planning Cloud, a solution for finance, human resource, and sales planning; Workday Prism Analytics that enables customers to bring together various data with analytics tools for financial and people analytics to make business decisions; Workday Student, a student and faculty lifecycle information system to help colleges and universities; and Workday Data-as-a-Service that provides data to customers to enable informed decision-making. It serves technology, financial services, business and professional services, healthcare and life sciences, manufacturing, retail and hospitality, education, and government and non-profit industries. The company was formerly known as North Tahoe Power Tools, Inc. and changed its name to Workday, Inc. in July 2005. Workday, Inc. was founded in 2005 and is headquartered in Pleasanton, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 38216989932, "total_enterprise": 37842274932, "number_of_employees": 12200, "outstanding_shares": 233272233, "eps": -2.115782, "diluted_eps": -2.115782, "earnings_from_cont_operations": -480674000, "gross_profit": 2561948000, "cash": 1944573000, "total_debt": 1569858000, "total_revenue": 3627206000, "cash_from_operations": 864598000, "net_income": -480674000, "ebitda": -225952000, "year_low_stock_price": 107.75, "year_high_stock_price": 226.83, "stocktwits_watchlist_count": 9119, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WDAY.png"}