{"symbol": "WDFC", "name": "WD-40 Company", "next_earnings_utc": 1594325100, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q3", "next_earnings_year": 2020, "next_earnings_quarter": 3, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 108100000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 1.075, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 1, "total_analysts": 2, "analysts_sell": 0, "analysts_buy": 1, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 0, "webpage": "wd40company.com", "year_founded": 1953, "street_address": "9715 Businesspark Avenue", "city": "San Diego", "state": "CA", "zipcode": "92131", "country": "United States", "phone_number": "619-275-1400", "short_description": "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific.", "long_description": "WD-40 Company develops and sells maintenance products, and homecare and cleaning products in the Americas, Europe, the Middle East, Africa, and the Asia-Pacific. The company offers multi-purpose maintenance products, including aerosol sprays, non-aerosol trigger sprays, and in liquid-bulk form products under the WD-40 Multi-Use brand name for various consumer uses and industrial applications; specialty maintenance products, such as penetrants, degreasers, corrosion inhibitors, greases, lubricants, and rust removers under the WD-40 Specialist brand; and bicycle maintenance products comprising wet and dry chain lubricants, chain cleaners and degreasers, and foaming wash products for avid and recreational cyclists, bike enthusiasts, and mechanics under the WD-40 Bike brand name. It also provides multi-purpose and specialty drip oils, and spray lubricant products, as well as other specialty maintenance products under the 3-IN-ONE brand name; and professional spray maintenance products and lubricants for the bike market under the GT85 brand name. In addition, the company offers automatic toilet bowl cleaners under the 2000 Flushes brand name; aerosol carpet stain removers, and a liquid trigger carpet stain and odor eliminators under the Spot Shot brand; room and rug deodorizers under the Carpet Fresh brand name; carpet and household cleaners, and rug and room deodorizers under the 1001 brand; heavy-duty hand cleaner products under the Lava brand name in the United States, as well as under the Solvol brand in Australia; and liquid mildew stain removers and automatic toilet bowl cleaners under the X-14 brand name. It sells its products primarily through mass retail and home center stores, warehouse club stores, grocery stores, hardware stores, automotive parts outlets, sport retailers, independent bike dealers, online retailers, and industrial distributors and suppliers. WD-40 Company was founded in 1953 and is headquartered in San Diego, California.", "industry_name": "Household Products", "sector_name": "Consumer Staples", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2622290022, "total_enterprise": 2703021022, "number_of_employees": 495, "outstanding_shares": 13668439, "eps": 3.855062, "diluted_eps": 3.849564, "earnings_from_cont_operations": 53244000, "gross_profit": 227496000, "cash": 30503000, "total_debt": 111234000, "total_revenue": 419338000, "cash_from_operations": 69007000, "net_income": 53244000, "ebitda": 86947000, "year_low_stock_price": 151.16, "year_high_stock_price": 211.68, "seekingalpha_follower_count": 4395, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WDFC.png"}