{"symbol": "WFC", "name": "Wells Fargo & Company", "next_earnings_utc": 1594727700, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 18592015350.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.29687, "eps_up_revisions": 0, "eps_down_revisions": 11, "revenue_up_revisions": 0, "revenue_down_revisions": 10, "total_analysts": 28, "analysts_sell": 4, "analysts_buy": 2, "analysts_outperform": 1, "analysts_hold": 18, "analysts_underperform": 3, "webpage": "wellsfargo.com", "year_founded": 1852, "street_address": "420 Montgomery Street", "city": "San Francisco", "state": "CA", "zipcode": "94104", "country": "United States", "phone_number": "866-249-3302", "short_description": "Wells Fargo & Company, a diversified financial services company, provides banking, investment, mortgage, and consumer and commercial finance products and services to individuals, businesses, and institutions in the United States and internationally.", "long_description": "Wells Fargo & Company, a diversified financial services company, provides banking, investment, mortgage, and consumer and commercial finance products and services to individuals, businesses, and institutions in the United States and internationally. It operates in three segments: Community Banking, Wholesale Banking, and Wealth and Investment Management. The Community Banking segment offers checking and savings accounts; credit and debit cards; and automobile, student, mortgage, home equity, and small business lending products. The Wholesale Banking segment provides commercial, corporate, capital markets, cash management, and real estate banking products and services, including traditional commercial loans and lines of credit, letters of credit, asset-based lending, equipment leasing, international trade facilities, trade financing, collection services, foreign exchange services, treasury management, institutional fixed-income sales, interest rate, commodity and equity risk management, online/electronic products, corporate trust fiduciary and agency services, and investment banking services. It also offers commercial and residential development, land acquisition and development, rehabilitation, permanent securitization, and commercial real estate loans; secured and unsecured lines of credit; affordable housing loans and letters of credit; and interim financing arrangements. The Wealth and Investment Management segment provides personalized wealth management, investment, and retirement products and services; and delivers financial planning, private banking, credit, investment management, and fiduciary services. The company also offers brokerage, and Internet and mobile banking services. As of March 16, 2020, it operated through 7,400 locations; approximately 13,000 ATMs; and offices in 32 countries and territories. The Company was founded in 1852 and is headquartered in San Francisco, California.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 108526935016, "total_enterprise": null, "number_of_employees": 259800, "outstanding_shares": 4099997545, "eps": 2.913282, "diluted_eps": 2.889583, "earnings_from_cont_operations": 14579000000, "gross_profit": 75406000000, "cash": 356295000000, "total_debt": 350473000000, "total_revenue": 75406000000, "cash_from_operations": 16052000000, "net_income": 14342000000, "ebitda": null, "year_low_stock_price": 22.0, "year_high_stock_price": 54.75, "seekingalpha_follower_count": 231988, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WFC.png"}