{"symbol": "WIT", "name": "Wipro", "next_earnings_utc": 1594807200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1974384463.621266, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.0505, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 4, "analysts_sell": 1, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 2, "analysts_underperform": 1, "webpage": "wipro.com", "year_founded": 1945, "street_address": "Doddakannelli", "city": "Bengaluru", "state": null, "zipcode": "560035", "country": "India", "phone_number": "91 80 2844 0011", "short_description": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide.", "long_description": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise (ISRE). The company's IT services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The company's IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. Its ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has a research collaboration agreement with Tel Aviv University for core and applied research in image and text analytics; a collaboration with Indian Institute of Science to develop solutions for autonomous systems, robotics, and 5G; a strategic partnership with Google for cloud adoption and digital transformation; and a strategic alliance with Smart Energy Water. Wipro Limited was founded in 1945 and is based in Bengaluru, India.", "industry_name": "IT Services", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 16018791074, "total_enterprise": 12891510880, "number_of_employees": 182886, "outstanding_shares": 5689063664, "eps": 0.220929250347982, "diluted_eps": 0.220322118380062, "earnings_from_cont_operations": 1295327103, "gross_profit": 2308570292, "cash": 4432730165, "total_debt": 1289056804, "total_revenue": 8089507523, "cash_from_operations": 1334168489, "net_income": 1288765162, "ebitda": 1542626102, "year_low_stock_price": 2.52, "year_high_stock_price": 4.61, "seekingalpha_follower_count": 8479, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WIT.png"}