{"symbol": "WOR", "name": "Worthington Industries", "next_earnings_utc": 1593082500, "next_earnings_period_start_date_utc": 1582934400, "next_earnings_period_end_date_utc": 1590883200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q4", "next_earnings_year": 2020, "next_earnings_quarter": 4, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 653000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.255, "eps_up_revisions": 0, "eps_down_revisions": 2, "revenue_up_revisions": 0, "revenue_down_revisions": 2, "total_analysts": 3, "analysts_sell": 0, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 3, "analysts_underperform": 0, "webpage": "worthingtonindustries.com", "year_founded": 1955, "street_address": "200 Old Wilson Bridge Road", "city": "Columbus", "state": "OH", "zipcode": "43085", "country": "United States", "phone_number": "614-438-3210", "short_description": "Worthington Industries, Inc., a metals manufacturing company, focuses on value-added steel processing and manufactured metal products in the United States, Austria, Canada, Mexico, Poland, Portugal, and Turkey.", "long_description": "Worthington Industries, Inc., a metals manufacturing company, focuses on value-added steel processing and manufactured metal products in the United States, Austria, Canada, Mexico, Poland, Portugal, and Turkey. It operates through three segments: Steel Processing, Pressure Cylinders, and Engineered Cabs. The Steel Processing segment processes flat-rolled steel for customers primarily in the automotive, aerospace, agricultural, appliance, construction, container, hardware, heavy-truck, HVAC, lawn and garden, leisure and recreation, office furniture, and office equipment markets. It also toll processes steel for steel mills, large end-users, service centers, and other processors. The Pressure Cylinders segment manufactures and sells filled and unfilled pressure cylinders, tanks, hand torches, well water and expansion tanks, and oil and gas equipment, as well as various accessories and related products for end-use market applications, including industrial products, consumer products, and oil and gas equipment. The Engineered Cabs segment designs and manufactures custom-engineered open and enclosed cabs, as well as operator stations and custom fabrications for heavy mobile equipment used in the agricultural, construction, forestry, military, and mining industries; and machined structural components, complex and painted weldments, and engine doors. It also designs and manufactures reusable custom steel platforms, racks, and pallets for supporting, protecting, and handling products in the shipping process. The company was founded in 1955 and is headquartered in Columbus, Ohio.", "industry_name": "Metals and Mining", "sector_name": "Materials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1843614588, "total_enterprise": 2629366588, "number_of_employees": 12000, "outstanding_shares": 55547291, "eps": 1.815893, "diluted_eps": 1.774006, "earnings_from_cont_operations": 112330000, "gross_profit": 479450000, "cash": 103430000, "total_debt": 738484000, "total_revenue": 3386334000, "cash_from_operations": 326522000, "net_income": 100359000, "ebitda": 224805000, "year_low_stock_price": 19.28, "year_high_stock_price": 44.69, "seekingalpha_follower_count": 2843, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WOR.png"}