{"symbol": "WSM", "name": "Williams-Sonoma, Inc.", "next_earnings_utc": 1590696900, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1078079790.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.04158, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 8, "total_analysts": 25, "analysts_sell": 1, "analysts_buy": 3, "analysts_outperform": 2, "analysts_hold": 16, "analysts_underperform": 3, "webpage": "williams-sonomainc.com", "year_founded": 1956, "street_address": "3250 Van Ness Avenue", "city": "San Francisco", "state": "CA", "zipcode": "94109", "country": "United States", "phone_number": "415 421 7900", "short_description": "Williams-Sonoma, Inc. operates as an omni-channel specialty retailer of various products for home.", "long_description": "Williams-Sonoma, Inc. operates as an omni-channel specialty retailer of various products for home. It offers cooking, dining, and entertaining products, such as cookware, tools, electrics, cutlery, tabletop and bar, outdoor, furniture, and a library of cookbooks under the Williams Sonoma brand, as well as home furnishings and decorative accessories under the Williams Sonoma Home brand; and furniture, bedding, bathroom accessories, rugs, curtains, lighting, tabletop, outdoor, and decorative accessories under the Pottery Barn brand. The company also provides home decor products under the West Elm brand; products designed for creating childhood memories by decorating nurseries, bedrooms, and play spaces where children could play, laugh, learn, and grow under the Pottery Barn Kids brand; and line of furniture, bedding, lighting, decorative accents, and others for teen bedrooms, dorm rooms, study spaces, and lounges under the Pottery Barn Teen brand. In addition, it offers a range of assortments of lighting, hardware, furniture, and home decor inspired by history under the Rejuvenation brand; and women's and men's accessories, small leather goods, jewelry, key item apparel, paper, entertaining and bar, home decor, and seasonal items under the Mark and Graham brand. The company markets its products through e-commerce websites, direct-mail catalogs, and retail stores. As of February 2, 2020, it operated 614 stores comprising 572 stores in 43 states, Washington, D.C., and Puerto Rico; 20 stores in Canada; 19 stores in Australia; 3 stores in the United Kingdom; and 129 franchised stores, as well as e-commerce websites in various countries in the Middle East, the Philippines, Mexico, and South Korea. Williams-Sonoma, Inc. was founded in 1956 and is headquartered in San Francisco, California.", "industry_name": "Specialty Retail", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 5137785757, "total_enterprise": 6327943757, "number_of_employees": 19300, "outstanding_shares": 77213492, "eps": 4.558585, "diluted_eps": 4.49, "earnings_from_cont_operations": 356062000, "gross_profit": 2139092000, "cash": 432162000, "total_debt": 1622320000, "total_revenue": 5898008000, "cash_from_operations": 607294000, "net_income": 356062000, "ebitda": 656908000, "year_low_stock_price": 26.01, "year_high_stock_price": 77.0, "stocktwits_watchlist_count": 1685, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WSM.png"}