{"symbol": "WST", "name": "West Pharmaceutical Services", "next_earnings_utc": 1595498400, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 491222050.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.886, "eps_up_revisions": 0, "eps_down_revisions": 5, "revenue_up_revisions": 0, "revenue_down_revisions": 5, "total_analysts": 6, "analysts_sell": 1, "analysts_buy": 2, "analysts_outperform": 1, "analysts_hold": 2, "analysts_underperform": 0, "webpage": "westpharma.com", "year_founded": 1923, "street_address": "530 Herman O. West Drive", "city": "Exton", "state": "PA", "zipcode": "19341-0645", "country": "United States", "phone_number": "610 594 2900", "short_description": "West Pharmaceutical Services, Inc. manufactures and sells containment and delivery systems for injectable drugs and healthcare products in the United States, Germany, Ireland, France, Other European countries, and internationally.", "long_description": "West Pharmaceutical Services, Inc. manufactures and sells containment and delivery systems for injectable drugs and healthcare products in the United States, Germany, Ireland, France, Other European countries, and internationally. The company operates through two segments, Proprietary Products and Contract-Manufactured Products. The Proprietary Products segment offers stoppers and seals for injectable packaging systems; syringe and cartridge components, including custom solutions for the needs of injectable drug applications, as well as administration systems that enhance the safe delivery of drugs through advanced reconstitution, mixing, and transfer technologies; and films, coatings, and washing and sterilization processes and services to enhance the quality of packaging components. It also provides drug containment solutions, including Crystal Zenith, a cyclic olefin polymer in the form of vials, syringes, and cartridges; and self-injection devices, as well as a range of integrated solutions, including analytical lab services, pre-approval primary packaging support and engineering development, regulatory expertise, and after-sales technical support. This segment serves biologic, generic, and pharmaceutical drug companies. The Contract-Manufactured Products segment is involved in the design, manufacture, and automated assembly of components and devices used in surgical, diagnostic, ophthalmic, injectable, and other drug delivery systems, as well as consumer products. This segment serves pharmaceutical, diagnostic, and medical device companies. It distributes its products through its sales force and distribution network, as well as contract sales agents and regional distributors. The company was founded in 1923 and is headquartered in Exton, Pennsylvania.", "industry_name": "Health Care Equipment and Supplies", "sector_name": "Health Care", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 15901026417, "total_enterprise": 15895926417, "number_of_employees": 8200, "outstanding_shares": 73602233, "eps": 3.524002, "diluted_eps": 3.46998, "earnings_from_cont_operations": 260600000, "gross_profit": 625900000, "cash": 335300000, "total_debt": 330200000, "total_revenue": 1887900000, "cash_from_operations": 376700000, "net_income": 260600000, "ebitda": 412100000, "year_low_stock_price": 113.04, "year_high_stock_price": 221.96, "seekingalpha_follower_count": 2502, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WST.png"}