{"symbol": "WTFC", "name": "Wintrust Financial", "next_earnings_utc": 1595369700, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 378328150.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.78144, "eps_up_revisions": 0, "eps_down_revisions": 11, "revenue_up_revisions": 5, "revenue_down_revisions": 4, "total_analysts": 12, "analysts_sell": 0, "analysts_buy": 6, "analysts_outperform": 2, "analysts_hold": 4, "analysts_underperform": 0, "webpage": "wintrust.com", "year_founded": 1991, "street_address": "9700 West Higgins Road", "city": "Rosemont", "state": "IL", "zipcode": "60018", "country": "United States", "phone_number": "847-939-9000", "short_description": "Wintrust Financial Corporation operates as a financial holding company in the Chicago metropolitan area, southern Wisconsin, and northwest Indiana.", "long_description": "Wintrust Financial Corporation operates as a financial holding company in the Chicago metropolitan area, southern Wisconsin, and northwest Indiana. It operates in three segments: Community Banking, Specialty Finance, and Wealth Management. The Community Banking segment offers non-interest bearing deposits, non-brokered interest-bearing transaction accounts, and savings and domestic time deposits; home equity, consumer, and real estate loans; safe deposit facilities; and automatic teller machine (ATM), online and mobile banking, and other services. It also engages in the origination and purchase of residential mortgages for sale into the secondary market; and provision of lending, deposits, and cash management services to condominium, homeowner, and community associations, as well as asset-based lending for middle-market companies. In addition, this segment offers loan and deposit services to mortgage brokerage companies; lending to restaurant franchisees; direct leasing; small business administration loans; commercial mortgages and construction loans; and financial solutions. It provides personal and commercial banking services primarily to individuals, small to mid-sized businesses, local governmental units, and institutional customers. The Specialty Finance segment offers commercial and life insurance premiums financing for businesses and individuals; accounts receivable financing, value-added, and out-sourced administrative services; and other specialty finance services, as well as data processing of payrolls, billing, and cash management services to temporary staffing industry. The Wealth Management segment provides trust and investment, asset management, tax-deferred exchange, securities brokerage, and retirement plan services. As of December 31, 2019, the company had approximately 187 banking facilities and 230 ATMs. Wintrust Financial Corporation was founded in 1991 and is headquartered in Rosemont, Illinois.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 2438640673, "total_enterprise": null, "number_of_employees": 5057, "outstanding_shares": 57569421, "eps": 5.621641, "diluted_eps": 5.547436, "earnings_from_cont_operations": 329363000, "gross_profit": 1396828000, "cash": 2596795000, "total_debt": 2719762000, "total_revenue": 1396828000, "cash_from_operations": -201502000, "net_income": 329363000, "ebitda": null, "year_low_stock_price": 22.02, "year_high_stock_price": 74.46, "seekingalpha_follower_count": 1550, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WTFC.png"}