{"symbol": "WWW", "name": "Wolverine World Wide", "next_earnings_utc": 1595413800, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 341463820.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -0.08818, "eps_up_revisions": 1, "eps_down_revisions": 9, "revenue_up_revisions": 0, "revenue_down_revisions": 9, "total_analysts": 12, "analysts_sell": 1, "analysts_buy": 6, "analysts_outperform": 0, "analysts_hold": 4, "analysts_underperform": 1, "webpage": "wolverineworldwide.com", "year_founded": 1883, "street_address": "9341 Courtland Drive NE", "city": "Rockford", "state": "MI", "zipcode": "49351", "country": "United States", "phone_number": "616 866 5500", "short_description": "Wolverine World Wide, Inc. designs, manufactures, sources, markets, licenses, and distributes footwear, apparel, and accessories in the United States, Europe, the Middle East, Africa, the Asia Pacific, Canada and Latin America.", "long_description": "Wolverine World Wide, Inc. designs, manufactures, sources, markets, licenses, and distributes footwear, apparel, and accessories in the United States, Europe, the Middle East, Africa, the Asia Pacific, Canada and Latin America. The company operates through two segments, Wolverine Michigan Group and Wolverine Boston Group. It offers casual footwear and apparel; performance outdoor and athletic footwear and apparel; kids' footwear; industrial work boots and apparel; and uniform shoes and boots. The company sources, markets, and licenses a range of footwear styles, such as shoes, boots, and sandals under the Bates, Cat, Chaco, Harley-Davidson, Hush Puppies, Hytest, Keds, Merrell, Saucony, Sperry, Wolverine, and Stride Rite brand names. It also markets Merrell and Wolverine branded apparel and accessories, as well as licenses its brands for use on non-footwear products, including the Hush Puppies apparel, eyewear, watches, socks, handbags, and plush toys; Wolverine branded eyewear and gloves; and Keds, Saucony, and Sperry branded apparel. In addition, the company markets pigskin leather under the Wolverine Warrior Leather, Weather Tight, and All Season Weather Leathers trademarks for use in the footwear industry. Further, it operates brick and mortar retail stores, and e-commerce sites. The company sells its products to department stores, national chains, catalog and specialty retailers, independent retailers, uniform outlets, and mass merchant and government customers through retail stores, as well as through third-party licensees and distributors. As of December 28, 2019, it operated 96 retail stores, as well as 41 consumer direct e-commerce sites. Wolverine World Wide, Inc. was founded in 1883 and is based in Rockford, Michigan.", "industry_name": "Textiles, Apparel and Luxury Goods", "sector_name": "Consumer Discretionary", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 1700071673, "total_enterprise": 2643771673, "number_of_employees": 4000, "outstanding_shares": 81187759, "eps": 1.19457, "diluted_eps": 1.175764, "earnings_from_cont_operations": 101100000, "gross_profit": 885400000, "cash": 472600000, "total_debt": 1406000000, "total_revenue": 2189600000, "cash_from_operations": 278400000, "net_income": 101000000, "ebitda": 168200000, "year_low_stock_price": 12.19, "year_high_stock_price": 34.7, "seekingalpha_follower_count": 3308, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/WWW.png"}