{"symbol": "XLNX", "name": "Xilinx", "next_earnings_utc": 1595449200, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 690563580.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.61056, "eps_up_revisions": 0, "eps_down_revisions": 14, "revenue_up_revisions": 0, "revenue_down_revisions": 21, "total_analysts": 29, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 4, "analysts_hold": 16, "analysts_underperform": 2, "webpage": "xilinx.com", "year_founded": 1984, "street_address": "2100 Logic Drive", "city": "San Jose", "state": "CA", "zipcode": "95124", "country": "United States", "phone_number": "408 559 7778", "short_description": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide.", "long_description": "Xilinx, Inc. designs and develops programmable devices and associated technologies worldwide. The company offers integrated circuits (ICs) in the form of programmable logic devices (PLDs), such as programmable system on chips, and three dimensional ICs; adaptive compute acceleration platform; software design tools to program the PLDs; software development environments and embedded platforms; targeted reference designs; printed circuit boards; and intellectual property (IP) core licenses covering Ethernet, memory controllers, Interlaken, and peripheral component interconnect express interfaces, as well as domain-specific IP in the areas of embedded, digital signal processing and connectivity, and market-specific IP cores. It also offers development boards; development kits, including hardware, design tools, IP, and reference designs that are designed to streamline and accelerate the development of domain-specific and market-specific applications; and configuration products comprising one-time programmable and in-system programmable storage devices to configure field programmable gate arrays. In addition, it provides design, customer training, field engineering, and technical support services. The company offers its products to electronic equipment manufacturers in sub- markets, such as data center, wireless, wireline, aerospace and defense, test and measurement, industrial, scientific and medical, automotive, audio, video and broadcast, and consumer. It sells its products through a network of independent distributors; and through direct sales to original equipment manufacturers and electronic manufacturing service providers, as well as independent sales representatives. Xilinx, Inc. was founded in 1984 and is headquartered in San Jose, California.", "industry_name": "Semiconductors and Semiconductor Equipment", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 22358632433, "total_enterprise": 21401159433, "number_of_employees": 4891, "outstanding_shares": 243160766, "eps": 3.149067, "diluted_eps": 3.11, "earnings_from_cont_operations": 792721000, "gross_profit": 2137432000, "cash": 2267216000, "total_debt": 1309743000, "total_revenue": 3162666000, "cash_from_operations": 1190836000, "net_income": 792721000, "ebitda": 981983000, "year_low_stock_price": 67.68, "year_high_stock_price": 133.0, "seekingalpha_follower_count": 34153, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/XLNX.png"}