{"symbol": "YRD", "name": "Yiren Digital", "next_earnings_utc": 1594245600, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": null, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.234, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": null, "revenue_down_revisions": null, "total_analysts": 5, "analysts_sell": 3, "analysts_buy": 0, "analysts_outperform": 0, "analysts_hold": 1, "analysts_underperform": 1, "webpage": "yirendai.com", "year_founded": 2012, "street_address": "Building 9", "city": "Beijing", "state": null, "zipcode": "100022", "country": "China", "phone_number": "86 10 5395 3680", "short_description": "Yiren Digital Ltd., through its subsidiaries, operates as an online consumer finance marketplace that connects borrowers and investors primarily in the People's Republic of China.", "long_description": "Yiren Digital Ltd., through its subsidiaries, operates as an online consumer finance marketplace that connects borrowers and investors primarily in the People's Republic of China. The company provides loan facilitation services; post-origination services, such as cash processing, collection, and SMS services; and automated investing tool for investors to invest in loans through its marketplace, and self-directed investing tool that enables investors to select lending opportunities to approved borrowers that are posted on its marketplace. Its loan products portfolio includes unsecured consumer loans, such as standard, fasttrack, and micro loan products; secured consumer loan, which include secured financial leasing, auto-secured, and property-secured loans; and small business loans. The company also distributes fixed income, mutual fund investment, insurance, and other wealth management products offered by banks; and maintains a secondary loan market on its marketplace where investors can transfer the loans they hold prior to maturity at the fair value of the remaining loans. In addition, it provides online investor education services, which include a range of investment and trading topics, and various types of training programs on wealth planning, market insights, and investment strategies; consultancy information technology support; referral; and IT, system maintenance, and customer support services. The company offers its products through www.yirendai.com, www.yxpuhui.com, and a wealth management website and mobile application. As of December 31, 2019, it had 37 fixed income products, 302 mutual fund products, and 132 insurance products. The company was formerly known as Yirendai Ltd. and changed its name to Yiren Digital Ltd. in September 2019. Yiren Digital Ltd. was founded in 2012 and is based in Beijing, the People's Republic of China. Yiren Digital Ltd. is a subsidiary of Creditease Holdings (Cayman) Limited.", "industry_name": "Consumer Finance", "sector_name": "Financials", "is_defunct": false, "exchange": "NYSE", "equity_type": "stocks", "market_cap": 387003113, "total_enterprise": -29082426, "number_of_employees": 31388, "outstanding_shares": 92806502, "eps": 1.79210960950179, "diluted_eps": 1.77945956426202, "earnings_from_cont_operations": 165966910, "gross_profit": 1142009938, "cash": 459303738, "total_debt": 43218199, "total_revenue": 1237528041, "cash_from_operations": 39375548, "net_income": 165966910, "ebitda": 181438912, "year_low_stock_price": 2.83, "year_high_stock_price": 15.82, "seekingalpha_follower_count": 4514, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/YRD.png"}