{"symbol": "ZION", "name": "Zions Bancorporation, National Association", "next_earnings_utc": 1595277300, "next_earnings_period_start_date_utc": 1585612800, "next_earnings_period_end_date_utc": 1593475200, "next_earnings_has_time": true, "next_earnings_name": "2020 Q2", "next_earnings_year": 2020, "next_earnings_quarter": 2, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 700043830.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.62765, "eps_up_revisions": 0, "eps_down_revisions": 13, "revenue_up_revisions": 5, "revenue_down_revisions": 5, "total_analysts": 25, "analysts_sell": 0, "analysts_buy": 4, "analysts_outperform": 3, "analysts_hold": 18, "analysts_underperform": 0, "webpage": "zionsbancorporation.com", "year_founded": 1873, "street_address": "One South Main Street", "city": "Salt Lake City", "state": "UT", "zipcode": "84133-1109", "country": "United States", "phone_number": "801-844-7637", "short_description": "Zions Bancorporation, National Association provides various banking and related services primarily in Arizona, California, Colorado, Idaho, Nevada, New Mexico, Oregon, Texas, Utah, Washington, and Wyoming.", "long_description": "Zions Bancorporation, National Association provides various banking and related services primarily in Arizona, California, Colorado, Idaho, Nevada, New Mexico, Oregon, Texas, Utah, Washington, and Wyoming. The company offers community banking services, such as small and medium-sized business and corporate banking; commercial and residential development, construction, and term lending; retail banking; treasury cash management and related products and services; residential mortgage servicing and lending services; trust and wealth management services; capital markets services, including municipal finance advisory and underwriting; and investment services. It also offers personal banking services to individuals, including home mortgages, bankcards, other installment loans, home equity lines of credit, checking accounts, savings accounts, certificates of deposit of various types and maturities, trust services, safe deposit facilities, and internet and mobile banking services. In addition, the company provides self-directed brokerage services; small business administration lending and secondary market agricultural real estate mortgage loans; corporate trust services for municipalities; and bond transfer, stock transfer, and escrow services. As of December 31, 2019, it operated 434 branches. The company was formerly known as ZB, National Association and changed its name to Zions Bancorporation, National Association in September 2018. Zions Bancorporation, National Association was founded in 1873 and is headquartered in Salt Lake City, Utah.", "industry_name": "Banks", "sector_name": "Financials", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5391877464, "total_enterprise": null, "number_of_employees": 10188, "outstanding_shares": 163861950, "eps": 3.389374, "diluted_eps": 3.20391, "earnings_from_cont_operations": 617000000, "gross_profit": 2533000000, "cash": 3139000000, "total_debt": 5844000000, "total_revenue": 2533000000, "cash_from_operations": 892000000, "net_income": 617000000, "ebitda": null, "year_low_stock_price": 23.58, "year_high_stock_price": 52.48, "seekingalpha_follower_count": 6065, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ZION.png"}