{"symbol": "ZLAB", "name": "Zai Lab", "next_earnings_utc": 1592479800, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -1.02756, "eps_up_revisions": 1, "eps_down_revisions": 0, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 4, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "zailaboratory.com", "year_founded": 2013, "street_address": "Building 1, Jinchuang Plaza", "city": "Shanghai", "state": null, "zipcode": "201210", "country": "China", "phone_number": "86 21 6163 2588", "short_description": "Zai Lab Limited, a biopharmaceutical company, engages in discovering or licensing, developing, and commercializing proprietary therapeutics that address medical needs in the fields of oncology, autoimmune, and infectious diseases in China.", "long_description": "Zai Lab Limited, a biopharmaceutical company, engages in discovering or licensing, developing, and commercializing proprietary therapeutics that address medical needs in the fields of oncology, autoimmune, and infectious diseases in China. The company offers Niraparib, an oral small molecule poly ADP ribose polymerase 1/2 inhibitor for the treatment of multiple solid tumors, including ovarian and other types of lung cancer; and Optune, a cancer therapy for the treatment of glioblastoma multiforme. It also develops Ripretinib, a switch control inhibitor for the treatment of KIT and/or PDGFRa-driven cancers, including gastrointestinal stromal tumors, systemic mastocytosis, and other cancers; REGN1979 for the treatment of diffuse large B-cell lymphoma and follicular lymphoma; Margetuximab an immune-optimized anti-HER2 monoclonal antibody for the treatment of breast and gastric cancers; and INCMGA0012, an investigational monoclonal antibody for the treatment of MSI-high endometrial cancer. In addition, the company develops Bemarituzumab, a humanized monoclonal antibody for the treatment of gastric and gastroesophageal cancers; Omadacycline, an antibiotic to treat acute bacterial skin and skin structure, and community-acquired bacterial pneumonia infections; and Durlobactam for the treatment of acinetobacter baumannii bacterial infections. Zai Lab Limited has license and collaboration agreements with the TESARO Inc.; Paratek Bermuda, Ltd.; Five Prime Therapeutics, Inc.; Entasis Therapeutics Holdings, Inc.; Crescendo Biologics Ltd.; Novocure Limited; MacroGenics Inc.; Deciphera Pharmaceuticals, LLC; and Incyte Corporation. The company was founded in 2013 and is headquartered in Shanghai, China.", "industry_name": "Biotechnology", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5461766874, "total_enterprise": 5207612874, "number_of_employees": 692, "outstanding_shares": 74675511, "eps": -3.030488, "diluted_eps": -3.030488, "earnings_from_cont_operations": -195071000, "gross_profit": 9236000, "cash": 275932000, "total_debt": 21778000, "total_revenue": 12985000, "cash_from_operations": -191011000, "net_income": -195071000, "ebitda": -199430000, "year_low_stock_price": 27.02, "year_high_stock_price": 76.39, "seekingalpha_follower_count": 2088, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ZLAB.png"}