{"symbol": "ZLAB", "name": "Zai Lab", "next_earnings_utc": 1592479800, "next_earnings_period_start_date_utc": 1577750400, "next_earnings_period_end_date_utc": 1585612800, "next_earnings_has_time": true, "next_earnings_name": "2020 Q1", "next_earnings_year": 2020, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 1000000.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": -1.02756, "eps_up_revisions": 0, "eps_down_revisions": 1, "revenue_up_revisions": 0, "revenue_down_revisions": 0, "total_analysts": 11, "analysts_sell": 0, "analysts_buy": 7, "analysts_outperform": 4, "analysts_hold": 0, "analysts_underperform": 0, "webpage": "zailaboratory.com", "year_founded": 2013, "street_address": "Building 1, Jinchuang Plaza", "city": "Shanghai", "state": null, "zipcode": "201210", "country": "China", "phone_number": "86 21 6163 2588", "short_description": "Zai Lab Limited, a biopharmaceutical company, engages in discovering or licensing, developing, and commercializing proprietary therapeutics that address medical needs in the fields of oncology, infectious, and autoimmune diseases in China and internationally.", "long_description": "Zai Lab Limited, a biopharmaceutical company, engages in discovering or licensing, developing, and commercializing proprietary therapeutics that address medical needs in the fields of oncology, infectious, and autoimmune diseases in China and internationally. The company's lead drug candidate is ZL-2306, an oral small molecule PARP 1/2 inhibitor for treatment of multiple solid tumor, including ovarian and other types of cancer. Its products in Phase III clinical trial comprise Niraparib, a small molecule PARP 1/2 inhibitor for the treatment of multiple solid tumor types; Optune, a cancer therapy; Margetuximab, an immune-optimized anti-HER2 monoclonal antibody for the treatment of breast and gastric cancers; Bemarituzumab, a humanized monoclonal antibody for the treatment of gastric and gastroesophageal cancers; Brivanib, a small molecule dual target tyrosine kinase inhibitor for the treatment of hepatocellular carcinoma; and Omadacycline, an antibiotic to treat acute bacterial skin and skin structure, community-acquired bacterial pneumonia, and urinary tract infections. The company's clinical stage products also include MGD013, a bispecific DART molecule that is in Phase I clinical trial for the treatment of various solid tumors and hematological malignancies; and ETX2514, a novel beta-lactamase inhibitor that has completed Phase II cUTI trial for the treatment of acinetobacter baumannii bacterial infections. Zai Lab Limited has license and collaboration agreements with the TESARO Inc.; Paratek Bermuda, Ltd.; Five Prime Therapeutics, Inc.; Bristol-Myers Squibb Company; Entasis Therapeutics Holdings, Inc.; Sanofi; MacroGenics Inc.; and NovoCure Limited. It also has a strategic collaboration with Regeneron Pharmaceuticals, Inc. The company was founded in 2013 and is headquartered in Shanghai, China.", "industry_name": "Biotechnology", "sector_name": "Health Care", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 5555858018, "total_enterprise": 5301704018, "number_of_employees": 692, "outstanding_shares": 74675511, "eps": -3.030488, "diluted_eps": -3.030488, "earnings_from_cont_operations": -195071000, "gross_profit": 9236000, "cash": 275932000, "total_debt": 21778000, "total_revenue": 12985000, "cash_from_operations": -191011000, "net_income": -195071000, "ebitda": -199430000, "year_low_stock_price": 25.51, "year_high_stock_price": 76.39, "seekingalpha_follower_count": 2078, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ZLAB.png"}