{"symbol": "ZM", "name": "Zoom Video Communications, Inc.", "next_earnings_utc": 1591133400, "next_earnings_period_start_date_utc": 1580428800, "next_earnings_period_end_date_utc": 1588204800, "next_earnings_has_time": true, "next_earnings_name": "2021 Q1", "next_earnings_year": 2021, "next_earnings_quarter": 1, "next_earnings_revenue_num_analysts": null, "next_earnings_revenue_consensus": 202488140.0, "next_earnings_eps_num_analysts": null, "next_earnings_eps_consensus": 0.09811, "eps_up_revisions": 16, "eps_down_revisions": 1, "revenue_up_revisions": 14, "revenue_down_revisions": 0, "total_analysts": 28, "analysts_sell": 2, "analysts_buy": 6, "analysts_outperform": 2, "analysts_hold": 16, "analysts_underperform": 2, "webpage": "zoom.us", "year_founded": 2011, "street_address": "55 Almaden Boulevard", "city": "San Jose", "state": "CA", "zipcode": "95113", "country": "United States", "phone_number": "888 799 9666", "short_description": "Zoom Video Communications, Inc. provides a video-first communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa.", "long_description": "Zoom Video Communications, Inc. provides a video-first communications platform in the Americas, the Asia Pacific, Europe, the Middle East, and Africa. The company's product portfolio includes Zoom Meetings that offers HD video, voice, chat, and content sharing through mobile devices, desktops, laptops, telephones, and conference room systems; Zoom Phone, an enterprise cloud phone system that provides secure call routing, call queuing, call detail reports, call recording, call quality monitoring, voicemail, switch to video, and other services, as well as inbound and outbound calling services; and Zoom Chat enables sharing messages, images, audio files, and content in desktop, laptop, tablet, and mobile devices for meeting and phone customers. It also offers Zoom Rooms, a software-based conference room system; Zoom Conference Room Connector, a gateway for SIP/H.323 endpoints to join Zoom meetings; and Zoom Video Webinars enables users to conduct large-scale online events, such as town hall meetings, workshops, and marketing presentations. In addition, the company provides Zoom for Developers that allows developers to integrate its video, phone, chat, and content sharing into other applications, as well as manages Zoom accounts; and Zoom App Marketplace enhance developers to publish their apps. It serves education, entertainment/media, enterprise infrastructure, finance, government, healthcare, manufacturing, non-profit/not for profit and social impact, retail/consumer products, and software/Internet industries, as well as individuals. The company was formerly known as Zoom Communications, Inc. and changed its name to Zoom Video Communications, Inc. in May 2012. Zoom Video Communications, Inc. was founded in 2011 and is headquartered in San Jose, California.", "industry_name": "Software", "sector_name": "Information Technology", "is_defunct": false, "exchange": "NASDAQ", "equity_type": "stocks", "market_cap": 50605237273, "total_enterprise": 49822510273, "number_of_employees": 2532, "outstanding_shares": 281954743, "eps": 0.093091, "diluted_eps": 0.089999, "earnings_from_cont_operations": 25305000, "gross_profit": 507262000, "cash": 855194000, "total_debt": 72467000, "total_revenue": 622658000, "cash_from_operations": 151892000, "net_income": 25305000, "ebitda": 29145000, "year_low_stock_price": 60.97, "year_high_stock_price": 181.5, "seekingalpha_follower_count": 52055, "image_url": "https://raw.githubusercontent.com/earnbros/earnbros.github.io/master/api/images/companies/ZM.png"}